{
  "siteConfigs": {
    "sellers-services-llc": {
      "business name": "Sellers Services LLC",
      "about_us_images": [
        {
          "small": "https://lh5.googleusercontent.com/p/AF1QipO_xL8drgrOxMHQFKwpSnxhwqEI4plr3Kjm13co=w203-h270-k-no",
          "large": "https://lh5.googleusercontent.com/p/AF1QipO_xL8drgrOxMHQFKwpSnxhwqEI4plr3Kjm13co=w2048-h2048-k-no",
          "original": "https://lh5.googleusercontent.com/p/AF1QipO_xL8drgrOxMHQFKwpSnxhwqEI4plr3Kjm13co=w2048-h2048-k-no"
        },
        {
          "small": "https://lh5.googleusercontent.com/p/AF1QipPvijNkDmHI0YbozrpQZaUy77nk6J0QtQ-Tat25=w203-h270-k-no",
          "large": "https://lh5.googleusercontent.com/p/AF1QipPvijNkDmHI0YbozrpQZaUy77nk6J0QtQ-Tat25=w2048-h2048-k-no",
          "original": "https://lh5.googleusercontent.com/p/AF1QipPvijNkDmHI0YbozrpQZaUy77nk6J0QtQ-Tat25=w2048-h2048-k-no"
        }
      ],
      "about_us_paragraph": "### About Us\n\nSellers Services LLC is a leading provider of top-notch landscaping, lawn care, and irrigation services dedicated to creating outdoor paradises that exceed your expectations. Our approach is tailored to understand and meet your unique needs and preferences, ensuring every interaction resonates with you. We lead the way in our local industry by pioneering new standards through quality and excellence. At Sellers Services LLC, we prioritize relationships, recognizing that every connection counts. Our commitment to excellence and customer satisfaction has earned us a reputation as a trusted and reliable service provider in the community.\n\n###"
    },
    "angel-plumbing-company": {
      "business name": "Angel Plumbing Company",
      "about_us_images": [
        {
          "small": "https://lh5.googleusercontent.com/p/AF1QipOPp6-YYxzvUBQluVwCIlvfBILdeRXE0drrdthX=w203-h270-k-no",
          "large": "https://lh5.googleusercontent.com/p/AF1QipOPp6-YYxzvUBQluVwCIlvfBILdeRXE0drrdthX=w2048-h2048-k-no",
          "original": "https://lh5.googleusercontent.com/p/AF1QipOPp6-YYxzvUBQluVwCIlvfBILdeRXE0drrdthX=w2048-h2048-k-no"
        },
        {
          "small": "https://lh5.googleusercontent.com/p/AF1QipOX92pgSSn0f-K1FHTVKkOS7c4Lrxnzmmx3A8AF=w203-h270-k-no",
          "large": "https://lh5.googleusercontent.com/p/AF1QipOX92pgSSn0f-K1FHTVKkOS7c4Lrxnzmmx3A8AF=w2048-h2048-k-no",
          "original": "https://lh5.googleusercontent.com/p/AF1QipOX92pgSSn0f-K1FHTVKkOS7c4Lrxnzmmx3A8AF=w2048-h2048-k-no"
        }
      ],
      "about_us_paragraph": "**About Us:**\nAngel Plumbing Company is a dedicated and reliable plumbing service provider, committed to delivering top-notch solutions for both residential and commercial clients. With a strong focus on customer satisfaction, our team of skilled professionals ensures that every job is completed efficiently and with the highest quality. Whether you need routine maintenance, emergency repairs, or new installations, we are here to provide you with peace of mind and exceptional service.\n\n**"
    },
    "mpe-services": {
      "business name": "MPE Services",
      "about_us_images": [
        {
          "small": "https://lh5.googleusercontent.com/p/AF1QipO8FHnESLOu6OHr75RBVgaPM1pYJ3XInofwe_jx=w203-h270-k-no",
          "large": "https://lh5.googleusercontent.com/p/AF1QipO8FHnESLOu6OHr75RBVgaPM1pYJ3XInofwe_jx=w2048-h2048-k-no",
          "original": "https://lh5.googleusercontent.com/p/AF1QipO8FHnESLOu6OHr75RBVgaPM1pYJ3XInofwe_jx=w2048-h2048-k-no"
        },
        {
          "small": "https://lh5.googleusercontent.com/p/AF1QipO5TNZ5Mhvr3g_ruXfPUJ06zYm7_q4snY8cDzLv=w203-h270-k-no",
          "large": "https://lh5.googleusercontent.com/p/AF1QipO5TNZ5Mhvr3g_ruXfPUJ06zYm7_q4snY8cDzLv=w2048-h2048-k-no",
          "original": "https://lh5.googleusercontent.com/p/AF1QipO5TNZ5Mhvr3g_ruXfPUJ06zYm7_q4snY8cDzLv=w2048-h2048-k-no"
        }
      ],
      "about_us_paragraph": "**About Us:**\n\nMPE Services is a trusted provider of comprehensive home and commercial services in Athens, Alabama. Headquartered in Florence, Alabama, with multiple locations including Athens, we specialize in HVAC repair and maintenance, full-service electrical services, and plumbing needs. Our team of licensed technicians is dedicated to delivering top-notch service with a focus on customer satisfaction. Whether you need urgent repairs or routine maintenance, our experts are equipped to handle any issue related to heating, cooling, electrical systems, or plumbing. We pride ourselves on providing reliable solutions that ensure quality workmanship and customer satisfaction.\n\n**"
    },
    "huntsville-plumbing-inc": {
      "business name": "Huntsville Plumbing Inc",
      "about_us_images": [
        {
          "small": "https://lh5.googleusercontent.com/p/AF1QipPrxRaIRWiNXFFbT8gZp5zq2SUTcvCTPQvaPI0r=w203-h270-k-no",
          "large": "https://lh5.googleusercontent.com/p/AF1QipPrxRaIRWiNXFFbT8gZp5zq2SUTcvCTPQvaPI0r=w2048-h2048-k-no",
          "original": "https://lh5.googleusercontent.com/p/AF1QipPrxRaIRWiNXFFbT8gZp5zq2SUTcvCTPQvaPI0r=w2048-h2048-k-no"
        },
        {
          "small": "https://lh5.googleusercontent.com/p/AF1QipPlYyLDGe4bsiR1fykj7zleObJYsVXY4-nlToJS=w203-h270-k-no",
          "large": "https://lh5.googleusercontent.com/p/AF1QipPlYyLDGe4bsiR1fykj7zleObJYsVXY4-nlToJS=w2048-h2048-k-no",
          "original": "https://lh5.googleusercontent.com/p/AF1QipPlYyLDGe4bsiR1fykj7zleObJYsVXY4-nlToJS=w2048-h2048-k-no"
        }
      ],
      "about_us_paragraph": "### About Us\n\nHuntsville Plumbing, Inc. is a trusted and accredited plumbing service provider based in Madison, Alabama. With over 26 years of experience, our team of certified professional technicians is dedicated to delivering top-notch plumbing solutions to homeowners in the Madison area. We specialize in a wide range of services including sump pump installation and repair, comprehensive bathroom solutions, professional garbage disposal installation and repair, thorough plumbing inspections, and expert repiping and gas pipe repair services. Our commitment to quality, customer satisfaction, and transparency sets us apart as a reliable choice for all your plumbing needs.\n\n###"
    },
    "all-american-faucet-parts": {
      "business name": "All American Faucet Parts",
      "about_us_paragraph": "### About Us\n\nAll American Faucet Parts, Inc. is a leading supplier of plumbing and heating equipment and supplies in Mobile, Alabama. Founded with a commitment to quality and customer satisfaction, we specialize in providing a wide range of name-brand products for tubs, toilets, and other plumbing fixtures. Our extensive inventory ensures that we can meet the diverse needs of both residential and commercial customers. With a focus on durability and reliability, our products are designed to meet the rigorous standards of the plumbing industry.\n\n###"
    },
    "red-bay-ace-hardware": {
      "business name": "Red Bay Ace Hardware",
      "about_us_paragraph": "### About Us\n\nRed Bay Ace Hardware is your local Ace Hardware store, proudly serving the community of Red Bay, Alabama. As one of over 5,000 Ace stores globally, we are committed to being \"the Helpful Place\" by offering personal service, quality products, and a convenient shopping experience. Our store, located at 518 4th Ave SE, Red Bay, AL 35582, is locally owned and operated by Glen Vinson, with Amanda Mills as our dedicated manager. We strive to help our neighbors with all their grill, hardware, home improvement, lawn and garden, and tool needs. Whether you're tackling a DIY project or simply need some household essentials, we are here to assist you with the best products and expert advice.\n\n###"
    },
    "apex-plumbing-llc": {
      "business name": "APEX Plumbing, LLC",
      "about_us_paragraph": "**About Us:**\nApex Plumbing, LLC in Hartselle, Alabama, is a professional and family-owned business with a commitment to providing high-quality plumbing services. With over a decade of experience in the industry, we pride ourselves on being quick, professional, and reasonably priced. Our team is dedicated to ensuring that every aspect of our service is meticulously thought out to deliver outstanding results. We treat each plumbing need as if it were our own, striving for long-lasting solutions and transparent communication throughout the process.\n\n**"
    }
  }
}