{
  "siteConfigs": {
    "sellers-services-llc": {
      "business name": "Sellers Services LLC",
      "about_us_images": [
        {
          "small": "https://lh5.googleusercontent.com/p/AF1QipO_xL8drgrOxMHQFKwpSnxhwqEI4plr3Kjm13co=w203-h270-k-no",
          "large": "https://lh5.googleusercontent.com/p/AF1QipO_xL8drgrOxMHQFKwpSnxhwqEI4plr3Kjm13co=w2048-h2048-k-no",
          "original": "https://lh5.googleusercontent.com/p/AF1QipO_xL8drgrOxMHQFKwpSnxhwqEI4plr3Kjm13co=w2048-h2048-k-no"
        },
        {
          "small": "https://lh5.googleusercontent.com/p/AF1QipPvijNkDmHI0YbozrpQZaUy77nk6J0QtQ-Tat25=w203-h270-k-no",
          "large": "https://lh5.googleusercontent.com/p/AF1QipPvijNkDmHI0YbozrpQZaUy77nk6J0QtQ-Tat25=w2048-h2048-k-no",
          "original": "https://lh5.googleusercontent.com/p/AF1QipPvijNkDmHI0YbozrpQZaUy77nk6J0QtQ-Tat25=w2048-h2048-k-no"
        }
      ],
      "about_us_paragraph": "### About Us\n\nSellers Services LLC is a leading provider of top-notch landscaping, lawn care, and irrigation services dedicated to creating outdoor paradises that exceed your expectations. Our approach is tailored to understand and meet your unique needs and preferences, ensuring every interaction resonates with you. We lead the way in our local industry by pioneering new standards through quality and excellence. At Sellers Services LLC, we prioritize relationships, recognizing that every connection counts. Our commitment to excellence and customer satisfaction has earned us a reputation as a trusted and reliable service provider in the community.\n\n###"
    },
    "angel-plumbing-company": {
      "business name": "Angel Plumbing Company",
      "about_us_images": [
        {
          "small": "https://lh5.googleusercontent.com/p/AF1QipOPp6-YYxzvUBQluVwCIlvfBILdeRXE0drrdthX=w203-h270-k-no",
          "large": "https://lh5.googleusercontent.com/p/AF1QipOPp6-YYxzvUBQluVwCIlvfBILdeRXE0drrdthX=w2048-h2048-k-no",
          "original": "https://lh5.googleusercontent.com/p/AF1QipOPp6-YYxzvUBQluVwCIlvfBILdeRXE0drrdthX=w2048-h2048-k-no"
        },
        {
          "small": "https://lh5.googleusercontent.com/p/AF1QipOX92pgSSn0f-K1FHTVKkOS7c4Lrxnzmmx3A8AF=w203-h270-k-no",
          "large": "https://lh5.googleusercontent.com/p/AF1QipOX92pgSSn0f-K1FHTVKkOS7c4Lrxnzmmx3A8AF=w2048-h2048-k-no",
          "original": "https://lh5.googleusercontent.com/p/AF1QipOX92pgSSn0f-K1FHTVKkOS7c4Lrxnzmmx3A8AF=w2048-h2048-k-no"
        }
      ],
      "about_us_paragraph": "**About Us:**\nAngel Plumbing Company is a dedicated and reliable plumbing service provider, committed to delivering top-notch solutions for both residential and commercial clients. With a strong focus on customer satisfaction, our team of skilled professionals ensures that every job is completed efficiently and with the highest quality. Whether you need routine maintenance, emergency repairs, or new installations, we are here to provide you with peace of mind and exceptional service.\n\n**"
    },
    "mpe-services": {
      "business name": "MPE Services",
      "about_us_images": [
        {
          "small": "https://lh5.googleusercontent.com/p/AF1QipO8FHnESLOu6OHr75RBVgaPM1pYJ3XInofwe_jx=w203-h270-k-no",
          "large": "https://lh5.googleusercontent.com/p/AF1QipO8FHnESLOu6OHr75RBVgaPM1pYJ3XInofwe_jx=w2048-h2048-k-no",
          "original": "https://lh5.googleusercontent.com/p/AF1QipO8FHnESLOu6OHr75RBVgaPM1pYJ3XInofwe_jx=w2048-h2048-k-no"
        },
        {
          "small": "https://lh5.googleusercontent.com/p/AF1QipO5TNZ5Mhvr3g_ruXfPUJ06zYm7_q4snY8cDzLv=w203-h270-k-no",
          "large": "https://lh5.googleusercontent.com/p/AF1QipO5TNZ5Mhvr3g_ruXfPUJ06zYm7_q4snY8cDzLv=w2048-h2048-k-no",
          "original": "https://lh5.googleusercontent.com/p/AF1QipO5TNZ5Mhvr3g_ruXfPUJ06zYm7_q4snY8cDzLv=w2048-h2048-k-no"
        }
      ],
      "about_us_paragraph": "**About Us:**\n\nMPE Services is a trusted provider of comprehensive home and commercial services in Athens, Alabama. Headquartered in Florence, Alabama, with multiple locations including Athens, we specialize in HVAC repair and maintenance, full-service electrical services, and plumbing needs. Our team of licensed technicians is dedicated to delivering top-notch service with a focus on customer satisfaction. Whether you need urgent repairs or routine maintenance, our experts are equipped to handle any issue related to heating, cooling, electrical systems, or plumbing. We pride ourselves on providing reliable solutions that ensure quality workmanship and customer satisfaction.\n\n**"
    },
    "huntsville-plumbing-inc": {
      "business name": "Huntsville Plumbing Inc",
      "about_us_images": [
        {
          "small": "https://lh5.googleusercontent.com/p/AF1QipPrxRaIRWiNXFFbT8gZp5zq2SUTcvCTPQvaPI0r=w203-h270-k-no",
          "large": "https://lh5.googleusercontent.com/p/AF1QipPrxRaIRWiNXFFbT8gZp5zq2SUTcvCTPQvaPI0r=w2048-h2048-k-no",
          "original": "https://lh5.googleusercontent.com/p/AF1QipPrxRaIRWiNXFFbT8gZp5zq2SUTcvCTPQvaPI0r=w2048-h2048-k-no"
        },
        {
          "small": "https://lh5.googleusercontent.com/p/AF1QipPlYyLDGe4bsiR1fykj7zleObJYsVXY4-nlToJS=w203-h270-k-no",
          "large": "https://lh5.googleusercontent.com/p/AF1QipPlYyLDGe4bsiR1fykj7zleObJYsVXY4-nlToJS=w2048-h2048-k-no",
          "original": "https://lh5.googleusercontent.com/p/AF1QipPlYyLDGe4bsiR1fykj7zleObJYsVXY4-nlToJS=w2048-h2048-k-no"
        }
      ],
      "about_us_paragraph": "### About Us\n\nHuntsville Plumbing, Inc. is a trusted and accredited plumbing service provider based in Madison, Alabama. With over 26 years of experience, our team of certified professional technicians is dedicated to delivering top-notch plumbing solutions to homeowners in the Madison area. We specialize in a wide range of services including sump pump installation and repair, comprehensive bathroom solutions, professional garbage disposal installation and repair, thorough plumbing inspections, and expert repiping and gas pipe repair services. Our commitment to quality, customer satisfaction, and transparency sets us apart as a reliable choice for all your plumbing needs.\n\n###"
    },
    "all-american-faucet-parts": {
      "business name": "All American Faucet Parts",
      "about_us_paragraph": "### About Us\n\nAll American Faucet Parts, Inc. is a leading supplier of plumbing and heating equipment and supplies in Mobile, Alabama. Founded with a commitment to quality and customer satisfaction, we specialize in providing a wide range of name-brand products for tubs, toilets, and other plumbing fixtures. Our extensive inventory ensures that we can meet the diverse needs of both residential and commercial customers. With a focus on durability and reliability, our products are designed to meet the rigorous standards of the plumbing industry.\n\n###"
    },
    "red-bay-ace-hardware": {
      "business name": "Red Bay Ace Hardware",
      "about_us_paragraph": "### About Us\n\nRed Bay Ace Hardware is your local Ace Hardware store, proudly serving the community of Red Bay, Alabama. As one of over 5,000 Ace stores globally, we are committed to being \"the Helpful Place\" by offering personal service, quality products, and a convenient shopping experience. Our store, located at 518 4th Ave SE, Red Bay, AL 35582, is locally owned and operated by Glen Vinson, with Amanda Mills as our dedicated manager. We strive to help our neighbors with all their grill, hardware, home improvement, lawn and garden, and tool needs. Whether you're tackling a DIY project or simply need some household essentials, we are here to assist you with the best products and expert advice.\n\n###"
    },
    "apex-plumbing-llc": {
      "business name": "APEX Plumbing, LLC",
      "about_us_paragraph": "**About Us:**\nApex Plumbing, LLC in Hartselle, Alabama, is a professional and family-owned business with a commitment to providing high-quality plumbing services. With over a decade of experience in the industry, we pride ourselves on being quick, professional, and reasonably priced. Our team is dedicated to ensuring that every aspect of our service is meticulously thought out to deliver outstanding results. We treat each plumbing need as if it were our own, striving for long-lasting solutions and transparent communication throughout the process.\n\n**"
    },
    "bear-plumbing-llc": {
      "business name": "Bear Plumbing, LLC",
      "about_us_paragraph": "### About Us\n\nBear Plumbing LLC is a professional plumbing service based in Vandiver, Alabama. With a commitment to delivering top-notch service, we provide a wide range of plumbing solutions to homeowners and businesses in the area. Our services include Water Heater Service, Plumbing Remodels, Faucet Leak Repairs, Water Service Lines, and Sewer Repairs. We pride ourselves on being family-owned and operated, ensuring that every customer receives personalized attention and reliable warranties. Our team of skilled plumbers is dedicated to tackling every plumbing issue efficiently and effectively, ensuring that you can enjoy a hassle-free home.\n\n###"
    },
    "baine-services": {
      "business name": "Baine Services",
      "about_us_paragraph": "**About Us:**\nBaine Services, located at 104 Cascade Drive in Athens, Alabama, is a trusted and reliable plumbing and services provider dedicated to delivering exceptional customer service. With over 26 years of experience in the industry, our team of skilled professionals is committed to ensuring that every client receives top-notch service. Whether you need routine maintenance, emergency repairs, or comprehensive plumbing solutions, Baine Services is here to meet your needs with integrity and efficiency.\n\n**"
    },
    "boydstun-plumbing-llc": {
      "business name": "Boydstun Plumbing LLC",
      "about_us_paragraph": "### About Us\n\nBoydstun Plumbing LLC is a reputable plumbing service provider based in Harvest, Alabama. We specialize in offering top-notch plumbing solutions for both residential and commercial properties. Our team of certified professionals is dedicated to providing excellent service, ensuring that every job is completed with precision and integrity. We pride ourselves on our prompt response times, transparent pricing, and commitment to customer satisfaction. Whether you need emergency drain cleaning, sewer line repair, or hot water heater installation, Boydstun Plumbing LLC is here to serve you with professionalism and reliability.\n\n###"
    },
    "barnett-plumbing-llc": {
      "business name": "Barnett Plumbing, LLC",
      "about_us_paragraph": "### About Us\n\nBarnett Plumbing, LLC is a trusted and accredited plumbing service provider based in Florence, Alabama. With over 30 years of experience in the industry, our team, led by Mr. Kenneth Barnett, is dedicated to delivering top-notch plumbing solutions to residential and commercial clients. We are committed to providing fast, reliable, and professional services, ensuring that our customers' plumbing needs are met efficiently and effectively. Our focus on quality materials, skilled technicians, and competitive pricing sets us apart as a reliable choice for all your plumbing requirements.\n\n###"
    },
    "fussell-plumbing": {
      "business name": "Fussell Plumbing",
      "about_us_paragraph": "**About Us:**\nFussell Plumbing, LLC, is a dedicated and reliable plumbing service provider based in Franklinton, Louisiana. With a commitment to excellence, our team of skilled professionals offers comprehensive plumbing solutions for both residential and commercial clients. We pride ourselves on our prompt and professional service, ensuring that every customer receives top-notch care. Our expertise spans a wide range of services, including water treatment system installation and repair, ensuring that our clients have access to clean and safe water.\n\n**"
    },
    "jason-s-drain-service": {
      "business name": "Jason's Drain Service",
      "about_us_paragraph": "### About Us\n\nJason's Drain Service is a reputable plumbing company based in Cottondale, Alabama. With a commitment to excellence and customer satisfaction, we provide a wide range of plumbing services including drain opening, repair, and maintenance. Our team of skilled professionals is dedicated to delivering prompt, professional, and affordable solutions for all your plumbing needs. We pride ourselves on our excellent communication skills, timely service, and reasonable prices, as evident from our 4.9-star rating based on 17 customer reviews.\n\n###"
    },
    "ard-s-plumbing-and-electric": {
      "business name": "Ard's Plumbing and Electric",
      "about_us_paragraph": "### About Us\n\nArd's Plumbing & Electric is a trusted service provider based in Newton, AL, dedicated to delivering top-notch plumbing and electrical services to both residential and commercial clients. With a commitment to excellence and customer satisfaction, our team of skilled professionals is equipped to handle a wide range of plumbing and electrical needs. From routine maintenance to emergency repairs, we strive to provide prompt, reliable, and affordable solutions that meet the highest standards of quality. Our goal is to ensure that every home and business in our community has access to safe, efficient, and well-maintained plumbing and electrical systems.\n\n###"
    },
    "salser-plumbing-and-septic-service-llc": {
      "business name": "Salser Plumbing and Septic Service, LLC",
      "about_us_paragraph": "**About Us:**\nSalser Plumbing and Septic Service, LLC is a trusted and family-owned business dedicated to providing top-notch plumbing and septic services to residential, commercial, and industrial customers in Vincent, AL, and surrounding areas. With years of experience and a commitment to excellence, our team of licensed professionals ensures fast and reliable service 24/7. We pride ourselves on our professional uniformed technicians who are equipped with the latest tools and technology to handle any plumbing or septic issue efficiently. Our goal is to provide knowledgeable and friendly service at competitive rates, ensuring the complete satisfaction of every customer we contact.\n\n**"
    },
    "morrison-plumbing": {
      "business name": "Morrison Plumbing",
      "about_us_paragraph": "### About Us\n\nMorrison Plumbing has been the number one option for plumbing service, AC service, and heating service throughout the Metro East for over 30 years. We are fully licensed and insured in the state of Illinois. Our commitment to providing local area homeowners with complete satisfaction on all our services is unwavering. We are a drug-free workplace and always put safety first. Our professional technicians offer friendly, clean, and quality home improvement services, including heating and AC service. Whether you need small or large-scale plumbing projects handled, our experienced plumbers are equipped to perform home plumbing repairs, installations, and troubleshooting in any residential setting.\n\n###"
    },
    "h2o-worx": {
      "business name": "H2O Worx",
      "about_us_paragraph": "### About Us\n\nH2O Worx is a leading utility construction company dedicated to delivering exceptional services in the field of water and utility management. Our team is committed to providing top-notch solutions for businesses and communities, ensuring that our work is both challenging and rewarding. We strive to be the best in our industry by employing the best technicians and fostering an environment that feels like a family. Our core values are built on the dedicated service of each team member, and we are instrumental in tackling complex issues and solving intricate problems.\n\n###"
    },
    "poe-s-services": {
      "business name": "Poe's services",
      "about_us_paragraph": "**About Us:**\nPoe's Services, located in Montevallo, Alabama, is dedicated to providing top-notch maintenance services to the community. Our team is committed to delivering reliable and efficient solutions for all your maintenance needs. With a focus on quality and customer satisfaction, we strive to make a positive impact in the lives of our clients. Our mission is to ensure that every home and business in Montevallo runs smoothly and efficiently, providing peace of mind for our valued customers.\n\n**"
    },
    "hydrotech-plumbing-llc": {
      "business name": "HydroTech Plumbing LLC",
      "about_us_paragraph": "### About Us\n\nHydrotech Plumbing LLC is a trusted and reliable plumbing service provider based in Tulsa, Oklahoma. Our team of skilled professionals is dedicated to delivering top-notch plumbing solutions for both residential and commercial clients. We offer a wide range of services including bathroom remodeling, bathtub installation, drain cleaning, emergency plumbing, faucet repair, and much more. Our commitment to quality and customer satisfaction is evident in every project we undertake. With years of experience in the industry, we have built a reputation for our prompt service and attention to detail. Whether you need routine maintenance or an urgent repair, Hydrotech Plumbing LLC is here to serve you with professionalism and integrity.\n\n###"
    },
    "strickland-plumbing-maintenance": {
      "business name": "Strickland Plumbing & Maintenance",
      "about_us_paragraph": "### About Us\n\nStrickland Plumbing & HVAC, Inc. is a leading provider of premium HVAC and plumbing services in Lufkin, TX. Founded on a commitment to craftsmanship and community service, our company has grown from humble beginnings to become a trusted name in the industry. With a mission to deliver unparalleled service and expertise, we offer customized residential and commercial solutions that meet the unique needs of each client. Our team of certified professionals is dedicated to enhancing indoor living with efficient and reliable solutions for heating, cooling, and plumbing systems. We pride ourselves on our 24/7 emergency response, advanced solutions like Nuflow Pipe Relining, and comprehensive maintenance services that ensure your systems operate at peak performance.\n\n###"
    },
    "cobb-underground-llc": {
      "business name": "Cobb Underground, LLC",
      "about_us_paragraph": "### About Us\n\nCobb Underground, LLC is a utility installation company based in Alabaster, Alabama. Founded by Mr. Brian Cobb, the company specializes in providing comprehensive utility installation services, including directional drilling and cable plowing. With a commitment to excellence and customer satisfaction, Cobb Underground serves the state of Alabama, ensuring reliable and efficient utility solutions for various industries such as electricians, excavating contractors, HVAC contractors, landscapers, and more. The company's focus on precision and reliability has earned it a reputation as a trusted partner in the utility construction sector.\n\n###"
    },
    "r-d-heating-and-air-hvac-maintenance-contractor-heating-and-air-conditioning-service-pell-city-al": {
      "business name": "R & D Heating and Air - HVAC Maintenance Contractor, Heating and Air Conditioning Service Pell City AL",
      "about_us_paragraph": "**About Us:**\nR & D Heating and Air is a highly-rated HVAC contractor based in Pell City, Alabama. We specialize in providing top-notch heating and air conditioning services to both residential and commercial clients. Our team of expert technicians is dedicated to ensuring that your HVAC system runs efficiently and effectively throughout the year. From routine maintenance to repairs and replacements, we offer comprehensive solutions tailored to meet your specific needs. Our commitment to quality, reliability, and customer satisfaction has earned us a reputation as one of the most trusted HVAC service providers in Pell City.\n\n**"
    },
    "leak-pros-of-al-ga": {
      "business name": "Leak Pros of Al & Ga",
      "about_us_paragraph": "**About Us:**\nLeak Pros of Georgia is a premier water damage restoration service provider in the Metro Atlanta area. Our team of certified specialists is dedicated to delivering exceptional, white-glove service to ensure your home is restored to its original condition. We operate under three core principles: Communication, Cleanliness, and Care. Our owner oversees every job to ensure each client feels safe, cared for, and informed throughout the process. With a focus on prompt 24/7 emergency services, we guarantee unparalleled cleanliness and care for both homes and personal belongings at each job site.\n\n**"
    },
    "lewis-design-handyman-home-service": {
      "business name": "Lewis Design Handyman & Home Service",
      "about_us_paragraph": "### About Us\n\nAt Lewis Design Handyman & Home Service, we are dedicated to transforming your home into a beautiful and functional space that meets your every need. With over a decade of experience in whole house remodeling, our team of in-house designers and skilled craftsmen work together to guide you through every step of the process. From kitchen remodels to bathroom renovations, we bring innovative methods and creative design solutions to ensure that your home remodel ideas become a reality. Our commitment to exceptional customer service and continued training ensures that you can feel confident you are working with the best in the industry.\n\n###"
    },
    "timothy-foster-constrution-company": {
      "business name": "TIMOTHY FOSTER CONSTRUTION COMPANY",
      "about_us_paragraph": "### About Us\n\nTimothy Foster Construction Company, founded in 1989, is a premier general contracting firm serving the Roanoke, Alabama area. With a commitment to excellence and customer satisfaction, we provide unmatched remodeling services that cater to the unique needs of our clients. Our team of skilled professionals is dedicated to delivering high-quality projects on time and within budget. Whether you're looking for residential or commercial construction services, Timothy Foster Construction Company is your trusted partner for all your building needs.\n\n###"
    },
    "harris-county-plumbing": {
      "business name": "Harris County Plumbing",
      "about_us_paragraph": "### About Us\n\nHarris County Plumbing is dedicated to providing top-notch plumbing services to residents and businesses in Harris County, Texas. Our team of expert plumbers, with over 30 years of combined experience, is committed to ensuring your home or office runs smoothly and efficiently. We specialize in a wide range of plumbing services, including water heater installation and repair, drain cleaning, leak detection, and repiping. Our mission is to deliver fast, reliable, and professional service while maintaining the highest standards of customer satisfaction. We pride ourselves on our clean trucks, clean uniforms, and a guarantee of quality work without surprise fees. Whether you're facing a minor issue or a major emergency, our licensed technicians are available 24/7 to meet your plumbing needs.\n\n###"
    },
    "reese-plumbing-llc": {
      "business name": "Reese Plumbing LLC",
      "about_us_paragraph": "**About Us:**\nReese Plumbing LLC is a dedicated and reliable plumbing service provider based in Pineville, South Carolina. With a commitment to excellence and customer satisfaction, our team of skilled professionals offers a wide range of plumbing services, from routine maintenance to complex repairs. We strive to deliver top-notch service with a focus on efficiency and integrity, ensuring that every customer receives the best possible experience.\n\n**"
    },
    "twin-river-contractors": {
      "business name": "Twin River Contractors",
      "about_us_paragraph": "### About Us\n\nTwo Rivers Lumber Company, LLC, is a state-of-the-art dimensional southern yellow pine mill located near Demopolis, Alabama, at the confluence of the Tombigbee and Black Warrior Rivers. Founded by the McElroy family and Roy Geiger, the company aims to efficiently manufacture lumber by matching the area?s abundant quality timber with the best technology and the best people. Since its inception in 2017, Two Rivers Lumber has established itself as a significant player in Alabama's forest products industry. The company's commitment to innovation and sustainability has driven its growth, with plans to expand further through a $115 million sawmill project in Coosa County, set to create 130 jobs and contribute significantly to the local economy.\n\n###"
    },
    "kelly-c-williams-plumbing-inc": {
      "business name": "Kelly C. Williams Plumbing, Inc.",
      "about_us_paragraph": "**About Us:**\nKelly C. Williams Plumbing, Inc. is a trusted and reliable plumbing service provider based in Fortson, Georgia. Our team of experienced professionals is dedicated to delivering top-notch plumbing solutions to both residential and commercial clients. We offer a wide range of services, from routine maintenance and repairs to complex installations and emergency fixes. Our commitment to quality, customer satisfaction, and community involvement sets us apart as a leading plumbing company in the region.\n\n**"
    },
    "m-m-pumping-septic-repair": {
      "business name": "M & M Pumping & Septic Repair",
      "about_us_paragraph": "### About Us\n\nM & M Pumping & Septic Repair is a trusted provider of comprehensive septic services, dedicated to maintaining the highest standards of quality and customer satisfaction. With over 75 years of combined experience in the industry, our team of skilled professionals offers a wide range of services including septic tank maintenance, pump outs, repairs, installations, and replacements. We prioritize integrity and honesty in all our interactions with customers, ensuring that every interaction is transparent and reliable. Our commitment to excellence is reflected in our state-of-the-art equipment and adherence to all state, county, and municipal licensing requirements.\n\n###"
    },
    "alabama-water-heater": {
      "business name": "Alabama Water Heater",
      "about_us_paragraph": "### About Us\n\nAlabama Water Heater Services is dedicated to providing top-notch water heater solutions for residents in Birmingham and surrounding areas. Our team of expert plumbers specializes in the installation, maintenance, and repair of both traditional and tankless water heaters. We offer high-quality services from trusted brands like Rinnai, ensuring that our customers receive reliable and efficient hot water solutions. At Alabama Water Heater Services, we pride ourselves on transparency and honesty, providing all-inclusive pricing and comprehensive support for our products. Whether you're looking to upgrade to a tankless system or need emergency repairs, our licensed and insured technicians are here to help.\n\n###"
    },
    "fortner-plumbing": {
      "business name": "Fortner Plumbing",
      "about_us_paragraph": "### About Us\n\nFortner Plumbing is a trusted name in the plumbing industry, committed to providing top-quality plumbing services to both residential and commercial clients. With years of experience, our team of highly skilled plumbers is dedicated to delivering efficient solutions, exceptional workmanship, and unparalleled customer service. We understand the importance of reliable plumbing systems and strive to ensure that our clients receive prompt, reliable, and affordable services tailored to their unique needs. From routine maintenance and repairs to complex installations and renovations, Fortner Plumbing is your go-to partner for all your plumbing needs. We take pride in our attention to detail, professionalism, and commitment to exceeding customer expectations. When you choose Fortner Plumbing, you can trust that your plumbing is in safe hands.\n\n###"
    },
    "north-american-heating-and-air": {
      "business name": "North American Heating and Air",
      "about_us_paragraph": "### About Us\n\nNorth American Heating and Air has been a leading provider of high-quality HVAC services for over 30 years. Located in the heart of America, our mission is to offer the quickest, easiest, and cheapest service possible to restore your environment to normal. We pride ourselves on meeting and exceeding industry standards, ensuring that our customers receive top-notch heating, ventilation, and air conditioning solutions. Our extensive experience and commitment to excellence have earned us a reputation as a world-wide comfort bringing company, with partnerships spanning multiple countries. We continuously strive to improve our services by incorporating cutting-edge technologies and green solutions like thermal solar and geothermal systems from renowned manufacturers such as Water Furnace, Climate Master, and Dandelion Geothermal.\n\n###"
    },
    "autauga-county-handyman": {
      "business name": "Autauga county handyman",
      "about_us_paragraph": "### About Us\n\nAt CAD T. Handyman Service, we have been serving residential customers in Montgomery, Elmore, and Autauga counties for over 20 years. Founded by General Contractor and Owner, Cad Turner, our commitment to quality work at an affordable price has earned us a high level of trust among our clients. We pride ourselves on meeting the needs of our customers, with a significant portion of our business coming from repeat customers and referrals. Our goal is to deliver exceptional service that ensures you don't have to pay for your project twice. We welcome the opportunity to earn your trust and provide you with the best service in the industry.\n\n###"
    },
    "ramos-handyman-services": {
      "business name": "Ramos Handyman Services",
      "about_us_paragraph": "**About Us:**\nRamos Handyman Services is a reliable and trusted provider of handyman services in Euless, TX. We offer a wide range of services including handyman work, interior painting, lawn mowing and trimming, and pressure washing. Our team of skilled professionals is dedicated to delivering high-quality workmanship and exceptional customer service. With years of experience in the industry, we pride ourselves on our punctuality, professionalism, and commitment to ensuring that every job is completed efficiently and to your satisfaction.\n\n**"
    },
    "joe-reid-dawes-plumbing-service": {
      "business name": "Joe Reid - Dawes Plumbing Service",
      "about_us_paragraph": "### About Us\n\nAt Joe Reid - Dawes Plumbing Service, we are dedicated to providing top-notch plumbing solutions to the residents of Mobile, Alabama. With a commitment to excellence and customer satisfaction, our team of skilled plumbers is equipped to handle a wide range of plumbing services, from routine maintenance to emergency repairs. Our experienced professionals are certified and licensed to ensure that every job is done right the first time. We pride ourselves on our fast response times, quality service, and the most cutting-edge equipment available in the industry. Whether you need help with leaky faucets, clogged drains, or any other plumbing issue, Joe Reid - Dawes Plumbing Service is your trusted partner for all your plumbing needs.\n\n###"
    },
    "brian-harden-plumbing-inc": {
      "business name": "Brian Harden Plumbing Inc.",
      "about_us_paragraph": "**About Us:**\nBrian Harden Plumbing Inc. is a trusted and locally-owned plumbing service based in Theodore, Alabama. With over 24 years of experience, our team, led by President and Owner Brian O. Harden, provides comprehensive plumbing solutions to ensure your home or business runs smoothly. From routine maintenance to intricate installations like tankless water heaters, we offer a wide range of services including faucet, sink, toilet, tub, and disposal repairs and replacements. Our commitment to quality and customer satisfaction has earned us BBB accreditation since 2004. We are licensed by the State of Alabama Plumbers & Gas Fitters Examining Board (license number MPG-4032) and dedicated to providing reliable, professional service to our community.\n\n**"
    },
    "a-c-e-plumbing-solutions": {
      "business name": "A.C.E. Plumbing Solutions",
      "about_us_paragraph": "### About Us\n\nA.C.E. Plumbing Solutions is a dedicated and experienced plumbing company committed to delivering top-notch services in the Baltimore area. With over 30 years of industry expertise, our state-licensed plumbers are skilled experts knowledgeable in their field and well-equipped to remedy any plumbing problem. We offer a comprehensive menu of residential and commercial plumbing services, including gas line installation and repair, water and sewer line replacement, full home piping, water heater installation, and boiler installation. Our commitment to customer satisfaction is evident in our Customer Satisfaction Guarantee, ensuring you receive courteous, reliable, and dependable service from a trusted Baltimore plumbing contractor.\n\n###"
    },
    "alabama-septic-service": {
      "business name": "Alabama Septic Service",
      "about_us_paragraph": "**About Us:**\nAlabama Septic Services LLC is a trusted authority on septic tank services, proudly serving Montgomery, Alabama, for over 50 years. Our locally owned and operated company specializes in comprehensive septic tank pumping, repairs, and maintenance. We offer fast response times, affordable rates, and superior services to ensure your septic system operates smoothly. Our team is dedicated to providing exceptional customer service, including free estimates and quick follow-ups. Whether you need emergency septic system assistance or routine maintenance, we are here to help 24/7.\n\n**"
    },
    "b-b-torch-regulator-and-repair-service-llc": {
      "business name": "B & B Torch Regulator and Repair Service LLC",
      "about_us_paragraph": "### About Us\n\nB & B Torch Regulator and Repair Service LLC is a trusted cutting equipment repair shop located in Cleveland, Alabama. Specializing in hydraulic and pneumatic systems, our team of skilled technicians offers comprehensive repair services for torch regulators, ensuring that your equipment operates at peak performance. With years of experience in the industry, we provide reliable and efficient solutions for all your cutting equipment needs. Our commitment to quality and customer satisfaction has earned us a reputation as a go-to service provider for businesses and individuals requiring top-notch torch regulator repairs.\n\n###"
    },
    "central-fire-protection": {
      "business name": "Central Fire Protection",
      "about_us_paragraph": "**About Us:**\nCentral Fire Protection, Inc. is a Specialty Contractor based in Birmingham, Alabama, dedicated to providing top-notch fire protection services. With a focus on Fire Suppression, we specialize in designing, installing, inspecting, and maintaining fire protection systems for various sectors including Commercial, Healthcare, Industrial, and Energy. Our team of NICET-certified engineers ensures that our clients receive the highest level of service and safety. Since joining Procore in March 2023, we have successfully managed numerous projects, demonstrating our commitment to excellence and reliability.\n\n**"
    },
    "sims-plumbing-air": {
      "business name": "Sims plumbing & air",
      "about_us_paragraph": "### About Us\n\nAt Sims Plumbing & Heating, we are dedicated to providing top-notch plumbing and heating services in Madisonville, KY. Our team of skilled professionals is committed to delivering reliable, efficient, and trustworthy solutions for all your home and business needs. With years of experience in the industry, we pride ourselves on our comprehensive services, including installation, repair, and maintenance of plumbing and heating systems. Our goal is to ensure your comfort and peace of mind by providing exceptional service with a personal touch.\n\n###"
    },
    "quality-plumbing-co": {
      "business name": "Quality Plumbing Co.",
      "about_us_paragraph": "### About Us\n\nQuality Plumbing Co. in Union Grove, Alabama, is a trusted and reliable plumbing service provider dedicated to delivering exceptional quality and customer satisfaction. With over 20 years of experience serving both residential and commercial customers, our team of skilled plumbers is committed to providing top-notch services that meet and exceed our clients' expectations. Led by Master Plumber Doug Cater, our company emphasizes continuous training and on-the-job coaching to ensure our technicians are equipped with the latest techniques and a customer-centric attitude. We offer a wide range of services including faucet and sink installations, water heater maintenance, sump pump repairs, and waste line inspections using advanced video camera technology. Our \"Call Ahead\" service ensures prompt arrival and flexible scheduling to accommodate your needs. Each truck is fully stocked to complete most jobs in one trip, saving you time and money.\n\n###"
    },
    "affordable-airconditing-asap": {
      "business name": "Affordable Airconditing ASAP",
      "about_us_paragraph": "### About Us\n\nAffordable Heating & Air LLC is your trusted partner for all your HVAC needs in Birmingham, Alabama. Specializing in budget-friendly and energy-efficient HVAC services, we offer a wide range of solutions to keep your home or business comfortable year-round. Our team of NATE-Certified technicians is dedicated to providing professional, reliable, and efficient services. Whether you need emergency AC or furnace repair, installation, or maintenance, we are here to help. With a 100% satisfaction guarantee and 24/7 same-day emergency services, you can trust Affordable Heating & Air LLC to keep your indoor space comfortable and your utility bills low.\n\n###"
    },
    "tracy-duncan-plumbing": {
      "business name": "Tracy Duncan Plumbing",
      "about_us_paragraph": "**About Us:**\nTracy Duncan Plumbing is a reliable and dedicated plumbing service provider based in Nauvoo, Alabama. We offer comprehensive plumbing solutions, including emergency services and drain cleaning, available 24 hours a day, 7 days a week without extra charges for nights or weekends. Our commitment to quality and customer satisfaction has earned us a reputation as a trusted name in the community. With years of experience and a focus on prompt, professional service, Tracy Duncan Plumbing is your go-to solution for all your plumbing needs.\n\n**"
    },
    "local-professional-handyman": {
      "business name": "Local Professional Handyman",
      "about_us_paragraph": "### About Us\n\nWelcome to Local Professional Handyman, your trusted partner for all your home maintenance and improvement needs. Founded on January 7, 2024, as a Limited Liability Company (LLC), we are dedicated to providing unparalleled service and craftsmanship to our clients in Bloomington, IN. Our team is equipped to handle a wide range of tasks, from general repairs and installation services to painting, carpentry, plumbing, and electrical repairs. We pride ourselves on delivering quality workmanship across all our services, aiming to exceed customer expectations with every project we undertake.\n\nOur operations are rooted in Bloomington, where we cater to the needs of the local community. Our deep understanding of the area, combined with our commitment to serving our neighbors, positions us as a handyman service that truly cares about making a difference in the community. By focusing our efforts locally, we ensure a prompt and reliable service that our customers can depend on.\n\nOur founder brings valuable experience from previously running a successful handyman business, giving us a competitive edge in the market. Additionally, our expertise in carpentry sets us apart from the competition, alongside our comprehensive suite of handyman services. This unique combination of skills and offerings makes us uniquely qualified to meet the diverse needs of our customers.\n\n###"
    },
    "stephen-seibert-plumbing-llc": {
      "business name": "Stephen Seibert Plumbing, LLC",
      "about_us_paragraph": "**About Us:**\nStephen Seibert Plumbing, LLC is a reputable plumbing company based in Hartselle, Alabama. With a commitment to providing top-notch service, we offer a wide range of plumbing solutions for both residential and commercial clients. Our team of skilled professionals is dedicated to ensuring that every job is done efficiently and with the highest quality. Whether you need repairs, installations, or maintenance services, we strive to deliver fast and reliable solutions at an affordable price. Our goal is to build long-lasting relationships with our customers by providing exceptional service and ensuring their plumbing needs are met with professionalism and integrity.\n\n**"
    },
    "lovelace-service-heating-air": {
      "business name": "Lovelace Service Heating & Air",
      "about_us_paragraph": "### About Us\n\nLovelace Services Heating & Air, based in Decatur, Alabama, has been a trusted name in heating and air conditioning services since 1991. With over three decades of experience, our expert team is dedicated to providing top-notch heating and air conditioning services to keep your home comfortable. We specialize in HVAC installation/repair, commercial refrigeration, and appliance repair. Our commitment to quality and customer satisfaction has earned us a reputation as a reliable and efficient service provider in the region.\n\n### Extra Info\n\n- **Services**: HVAC installation/repair, commercial refrigeration, appliance repair.\n- **Experience**: Over three decades of service in the HVAC industry.\n- **Location**: Decatur, Alabama (35601).\n- **Reviews**: Available on platforms like Angie's List and Yellow Pages, highlighting our excellent customer service and quality workmanship[1][2].\n- **History**: Founded in 1991, Lovelace Services Heating & Air has established itself as a trusted name in the community[4]."
    },
    "north-alabama-drain-cleaning-etc-llc": {
      "business name": "North Alabama Drain CLeaning,etc LLC",
      "about_us_paragraph": "**About Us:**\nNorth Alabama Drain Cleaning, LLC is a trusted and experienced provider of full-service residential, commercial, and industrial septic tank and drain cleaning services. Established in 1993, our company has over 30 years of collective experience in the industry. We specialize in using advanced sewer machines and high-velocity water pressure methods to ensure efficient and effective drain cleaning. Our top priority is customer service, and we offer on-demand septic and drain cleaning services, including emergency services as needed. We also provide monthly, quarterly, and annual maintenance plans to keep your drains flowing smoothly. Our team of licensed, insured, and bonded technicians is dedicated to providing professional and courteous service. We are members of the Decatur Chamber of Commerce and the Better Business Bureau (BBB), ensuring our commitment to quality and reliability.\n\n**"
    },
    "d-l-remodeling-and-flooring": {
      "business name": "D&L Remodeling and Flooring",
      "about_us_paragraph": "**About Us:**\nD&L Remodeling and Flooring is a seasoned remodeling service provider dedicated to transforming homes in Waldorf, MD. With a focus on delivering top-notch services, our team of experts specializes in a wide range of projects including bathroom remodeling, ensuring that every client receives the utmost care and attention to detail. Our commitment to customer satisfaction is paramount, and we pride ourselves on arriving on time and ready to work, minimizing any disruption to your daily routine. Our personalized approach ensures that each project is tailored to meet the unique needs and tastes of our clients, guaranteeing an outcome that exceeds expectations.\n\n**"
    },
    "right-a-way-rooter": {
      "business name": "Right-A-Way Rooter",
      "about_us_paragraph": "### About Us\n\nRight A Way Rooter, based in Dothan, Alabama, is a reputable plumbing service provider dedicated to delivering top-notch drain cleaning and rooter services. As a trusted name in the community, we pride ourselves on our commitment to excellence and customer satisfaction. Our team of skilled professionals is equipped with the latest technology and techniques to tackle any plumbing issue efficiently. Whether you're dealing with clogged drains or complex sewer problems, we offer customized solutions tailored to your needs. Our 24/7 emergency service ensures that you're never left without help when you need it most.\n\n###"
    },
    "shaw-s-handyman-services": {
      "business name": "Shaw's Handyman Services",
      "about_us_paragraph": "### About Us\n\nAt Shaw's Handyman Services, we pride ourselves on being your reliable and local handyman for all your home maintenance, home repair, and renovating needs. Our team specializes in installing windows, doors, flooring, and more. We understand the importance of trust and attention to detail in your home, which is why we focus on communication and ensuring every job is done right. Whether you need something installed, built, fixed, or maintained, our skilled crew is equipped to handle a wide range of projects from small repairs to larger renovations. We are committed to providing top-notch service and ensuring your home looks its best for years to come.\n\n###"
    },
    "stinnett-heating-cooling": {
      "business name": "Stinnett Heating & Cooling",
      "about_us_paragraph": "**About Us:**\nStinnett Heating & Cooling, based in Enterprise, Alabama, is a specialized HVAC contractor dedicated to providing top-notch heating and cooling solutions for residential and commercial clients. With a commitment to customer satisfaction and professional service, our team of NATE-certified technicians ensures that every installation, repair, and maintenance task is completed with precision and care. We pride ourselves on our courteous and customer-oriented office staff, who work tirelessly to address any concerns promptly. Our goal is to make your home or business comfortable and efficient, all while delivering exceptional service.\n\n**"
    },
    "rediworx-drain-sewer-cleaning": {
      "business name": "RediWorx Drain & Sewer Cleaning",
      "about_us_paragraph": "**About Us:**\nRediWorx Drain & Sewer Cleaning is dedicated to providing top-notch services for all your drain and sewer needs. With a commitment to honesty, transparency, and trustworthiness, we aim to make the process of addressing plumbing issues as stress-free as possible. Our team of experts uses state-of-the-art equipment to diagnose and correct problems efficiently, whether it's a minor clog or a major sewer line repair. We pride ourselves on our customer-centric approach, ensuring that every client is educated and informed throughout the process. With 24/7 emergency services available, we are here to help you in your time of need, providing reliable solutions that meet your unique requirements.\n\n**"
    },
    "terrapin-creek-plumbing-and-septic-service-llc": {
      "business name": "Terrapin Creek Plumbing And Septic Service, LLC",
      "about_us_paragraph": "### About Us\n\nTerrapin Creek Plumbing and Septic Service, LLC is a reliable and professional plumbing and septic service provider based in Centre, Alabama. Our team is dedicated to providing top-notch service with a focus on customer satisfaction. We understand the importance of timely and efficient solutions for all your plumbing and septic needs. Our commitment to quality and reliability has earned us a strong reputation in the community, as evident from our positive reviews and BBB accreditation since May 2023. We pride ourselves on our prompt response times, on-time arrivals, and thorough problem-solving capabilities.\n\n###"
    },
    "dorsey-plumbing-llc": {
      "business name": "Dorsey Plumbing LLC",
      "about_us_paragraph": "### About Us\n\nDorsey Plumbing LLC is a locally owned and operated plumbing service dedicated to providing fast, friendly, and dependable solutions for both residential and commercial plumbing needs. With over 30 years of experience, our team at Justin Dorsey Plumbing has built a reputation for punctuality, professionalism, and courtesy. We offer a wide range of services including emergency plumbing, water heater installation, well service, piping, and storm drainage solutions. Our commitment to customer satisfaction is evident in the high percentage of repeat and referral business we receive, reflecting our dedication to keeping our customers happy.\n\n###"
    }
  }
}