{
  "siteConfigs": {
    "blackbelt-hardware-outdoors": {
      "business name": "Blackbelt Hardware & Outdoors",
      "about_us_images": [
        {
          "small": "https://lh5.googleusercontent.com/p/AF1QipNUDXvQkblyx8wzAJ1xZsPZbhaHa0cuZtzkZqzF=w203-h270-k-no",
          "large": "https://lh5.googleusercontent.com/p/AF1QipNUDXvQkblyx8wzAJ1xZsPZbhaHa0cuZtzkZqzF=w2048-h2048-k-no",
          "original": "https://lh5.googleusercontent.com/p/AF1QipNUDXvQkblyx8wzAJ1xZsPZbhaHa0cuZtzkZqzF=w2048-h2048-k-no"
        },
        {
          "small": "https://lh5.googleusercontent.com/p/AF1QipOslhm5lr3fxvXpmG5TkglQkkTEJHqCS10dujwK=w203-h270-k-no",
          "large": "https://lh5.googleusercontent.com/p/AF1QipOslhm5lr3fxvXpmG5TkglQkkTEJHqCS10dujwK=w2048-h2048-k-no",
          "original": "https://lh5.googleusercontent.com/p/AF1QipOslhm5lr3fxvXpmG5TkglQkkTEJHqCS10dujwK=w2048-h2048-k-no"
        }
      ]
    },
    "southern-turnkey-services-llc": {
      "business name": "Southern Turnkey Services LLC",
      "about_us_images": [
        {
          "small": "https://lh5.googleusercontent.com/p/AF1QipOZje5RVRwmzO-2A-3zuJwJl9AJ8KoEHysAo9kO=w203-h270-k-no",
          "large": "https://lh5.googleusercontent.com/p/AF1QipOZje5RVRwmzO-2A-3zuJwJl9AJ8KoEHysAo9kO=w2048-h2048-k-no",
          "original": "https://lh5.googleusercontent.com/p/AF1QipOZje5RVRwmzO-2A-3zuJwJl9AJ8KoEHysAo9kO=w2048-h2048-k-no"
        },
        {
          "small": "https://lh5.googleusercontent.com/p/AF1QipMEb50cO-kA3j_sPBP6D4MHrKLzX-uQWfJ4V5jr=w203-h270-k-no",
          "large": "https://lh5.googleusercontent.com/p/AF1QipMEb50cO-kA3j_sPBP6D4MHrKLzX-uQWfJ4V5jr=w2048-h2048-k-no",
          "original": "https://lh5.googleusercontent.com/p/AF1QipMEb50cO-kA3j_sPBP6D4MHrKLzX-uQWfJ4V5jr=w2048-h2048-k-no"
        }
      ]
    },
    "tiger-mechanical-service": {
      "business name": "Tiger Mechanical Service",
      "about_us_images": [
        {
          "small": "https://lh5.googleusercontent.com/p/AF1QipNrvTF1Pq1wH9_2OAqoRtwTRh7I4rIlfp5X2Elq=w203-h270-k-no",
          "large": "https://lh5.googleusercontent.com/p/AF1QipNrvTF1Pq1wH9_2OAqoRtwTRh7I4rIlfp5X2Elq=w2048-h2048-k-no",
          "original": "https://lh5.googleusercontent.com/p/AF1QipNrvTF1Pq1wH9_2OAqoRtwTRh7I4rIlfp5X2Elq=w2048-h2048-k-no"
        },
        {
          "small": "https://lh5.googleusercontent.com/p/AF1QipOKrmIEmVYlPq_zaVlWZtE-E8YvL7W_6_zfQ9hk=w203-h270-k-no",
          "large": "https://lh5.googleusercontent.com/p/AF1QipOKrmIEmVYlPq_zaVlWZtE-E8YvL7W_6_zfQ9hk=w2048-h2048-k-no",
          "original": "https://lh5.googleusercontent.com/p/AF1QipOKrmIEmVYlPq_zaVlWZtE-E8YvL7W_6_zfQ9hk=w2048-h2048-k-no"
        }
      ]
    },
    "1drain-doctor-plumbing-drain-cleaning": {
      "business name": "1Drain Doctor plumbing/drain cleaning",
      "about_us_images": [
        {
          "small": "https://lh5.googleusercontent.com/p/AF1QipNfQLfWf188sj1vqozjauFIGNQZmkkQhKsgotwV=w203-h270-k-no",
          "large": "https://lh5.googleusercontent.com/p/AF1QipNfQLfWf188sj1vqozjauFIGNQZmkkQhKsgotwV=w2048-h2048-k-no",
          "original": "https://lh5.googleusercontent.com/p/AF1QipNfQLfWf188sj1vqozjauFIGNQZmkkQhKsgotwV=w2048-h2048-k-no"
        },
        {
          "small": "https://lh5.googleusercontent.com/p/AF1QipPkoUlBC2BRmdtHOuAeyJ3Mv_1bSGGlWAuKcSvx=w203-h270-k-no",
          "large": "https://lh5.googleusercontent.com/p/AF1QipPkoUlBC2BRmdtHOuAeyJ3Mv_1bSGGlWAuKcSvx=w2048-h2048-k-no",
          "original": "https://lh5.googleusercontent.com/p/AF1QipPkoUlBC2BRmdtHOuAeyJ3Mv_1bSGGlWAuKcSvx=w2048-h2048-k-no"
        }
      ]
    },
    "p-o-services-llc": {
      "business name": "P&O Services LLC",
      "about_us_images": [
        {
          "small": "https://lh5.googleusercontent.com/p/AF1QipPXjLqU3qTYDk5sOdfO_oJkq6sjDW6WYm6yVSUm=w203-h270-k-no",
          "large": "https://lh5.googleusercontent.com/p/AF1QipPXjLqU3qTYDk5sOdfO_oJkq6sjDW6WYm6yVSUm=w2048-h2048-k-no",
          "original": "https://lh5.googleusercontent.com/p/AF1QipPXjLqU3qTYDk5sOdfO_oJkq6sjDW6WYm6yVSUm=w2048-h2048-k-no"
        },
        {
          "small": "https://lh5.googleusercontent.com/p/AF1QipOGwmf6Y0kNlkRcwh-21MNpqRlZv2wFLi9Fgfrh=w203-h270-k-no",
          "large": "https://lh5.googleusercontent.com/p/AF1QipOGwmf6Y0kNlkRcwh-21MNpqRlZv2wFLi9Fgfrh=w2048-h2048-k-no",
          "original": "https://lh5.googleusercontent.com/p/AF1QipOGwmf6Y0kNlkRcwh-21MNpqRlZv2wFLi9Fgfrh=w2048-h2048-k-no"
        }
      ]
    },
    "bear-plumbing-llc": {
      "business name": "Bear Plumbing, LLC",
      "about_us_paragraph": "### About Us\n\nBear Plumbing, LLC is a professional plumbing service based in Vandiver, Alabama. Founded on the principle of delivering quality work to homeowners, we have been serving the community for over 20 years. Led by our dedicated founder, Drew Thomas, our team of skilled plumbers is committed to providing efficient and reliable solutions for all your plumbing needs. From water heater service and plumbing remodels to faucet leak repairs and sewer repairs, we offer a wide range of services designed to keep your home's plumbing system running smoothly. Our family-owned and operated business prides itself on fast turnaround times, reliable warranties, and a commitment to customer satisfaction.\n\n###"
    },
    "baine-services": {
      "business name": "Baine Services",
      "about_us_paragraph": "**About Us:**\nBaine Services, located at 104 Cascade Drive in Athens, Alabama, is a trusted and reliable plumbing and services provider dedicated to delivering exceptional service to the community. With a commitment to quality and customer satisfaction, our team of skilled professionals is equipped to handle a wide range of plumbing needs, from routine maintenance to complex repairs. Our goal is to ensure that every homeowner in Athens enjoys safe, efficient, and reliable plumbing systems.\n\n**"
    },
    "boydstun-plumbing-llc": {
      "business name": "Boydstun Plumbing LLC",
      "about_us_paragraph": "### About Us\n\nBoyd Plumbing Company is a dedicated and reliable plumbing service provider based in Cantonment, Florida. Founded by Tami Boyd, the company has been serving both residential and commercial clients with a commitment to excellence. Our team of skilled plumbers is equipped with the latest technology and highest quality parts to ensure that every plumbing task is completed to the highest standards. We offer a wide range of services including faucet installations, sewer line replacements, and water heater installations. Our goal is to exceed our clients' expectations by providing personalized service and transparent pricing. Whether you need routine maintenance or emergency repairs, Boyd Plumbing Company is here to provide you with peace of mind knowing that your plumbing system is in good hands.\n\n###"
    },
    "barnett-plumbing-llc": {
      "business name": "Barnett Plumbing, LLC",
      "about_us_paragraph": "### About Us\n\nBarnett Plumbing, LLC is a reputable plumbing service provider based in Florence, Alabama. Founded by Kenneth Barnett, the company has been serving the community for over 30 years, offering top-notch plumbing solutions to residential and commercial clients. With a commitment to excellence and customer satisfaction, Barnett Plumbing, LLC specializes in a wide range of services including water heater installation and repair, kitchen and bathroom plumbing repairs, and comprehensive plumbing maintenance. Our skilled plumbers are equipped with the latest techniques and cutting-edge tools to ensure efficient and reliable service.\n\n###"
    },
    "fussell-plumbing": {
      "business name": "Fussell Plumbing",
      "about_us_paragraph": "### About Us\n\nFussell Plumbing Company, LLC is a reputable plumbing service provider based in Alabama. Founded in [year], our company has been dedicated to delivering top-notch plumbing solutions to residential and commercial clients. Our team of skilled professionals is committed to providing excellent customer service, ensuring that every job is done with attention to detail and quality materials. We offer a wide range of services including piping, plumbing, fire sprinkler systems, and sewer laterals. Our goal is to resolve all plumbing issues efficiently and effectively, making us the trusted choice for plumbing needs in the area.\n\n###"
    },
    "jason-s-drain-service": {
      "business name": "Jason's Drain Service",
      "about_us_paragraph": "### About Us\n\nJason's Drain Service is a trusted plumbing service located in Cottondale, Alabama. Founded with a commitment to excellence and customer satisfaction, we provide top-notch drain cleaning and plumbing services to residents in the greater Cottondale area. Our team is dedicated to delivering prompt, professional, and reliable solutions for all your plumbing needs. With an impressive 4.9-star rating based on 17 reviews, we have built a reputation for honesty, quick service, and reasonable prices. Whether you're dealing with a clogged drain or need routine maintenance, our experienced plumbers are here to help you keep your home flowing smoothly.\n\n###"
    },
    "ard-s-plumbing-and-electric": {
      "business name": "Ard's Plumbing and Electric",
      "about_us_paragraph": "### About Us\n\nArd's Plumbing and Electric is a trusted and reliable service provider in Dothan, Alabama, dedicated to delivering exceptional plumbing and electrical solutions. With years of experience in the industry, our team is committed to providing top-notch service, ensuring that every customer receives professional, punctual, and responsive care. We pride ourselves on our quality workmanship, competitive pricing, and a strong commitment to customer satisfaction. Our services include a wide range of plumbing and electrical repairs, installations, and maintenance, ensuring that your home or business is always running smoothly.\n\n###"
    },
    "salser-plumbing-and-septic-service-llc": {
      "business name": "Salser Plumbing and Septic Service, LLC",
      "about_us_paragraph": "### About Us\n\nSalser Plumbing and Septic Service, LLC, is a trusted and reliable provider of comprehensive plumbing and septic services. With years of experience in the industry, our team is dedicated to delivering top-notch solutions for all your plumbing needs. We specialize in a wide range of services including pipe lining, drain cleaning, gas fixture installations, water heaters, and commercial plumbing. Our commitment to quality and customer satisfaction has earned us a strong reputation in the community.\n\n###"
    },
    "morrison-plumbing": {
      "business name": "Morrison Plumbing",
      "about_us_paragraph": "### About Us\n\nMorrison Plumbing has been the premier choice for plumbing, heating, and air conditioning services in the Metro East area for over 30 years. We are fully licensed and insured in the state of Illinois, ensuring that our customers receive top-notch service with complete peace of mind. Our commitment to providing local homeowners with exceptional satisfaction is unwavering. We are a drug-free workplace and prioritize safety above all else. Our professional technicians are dedicated to delivering friendly, clean, and quality home improvement services. Whether you need plumbing repairs, installations, or troubleshooting in any residential setting, Morrison Plumbing is equipped to handle almost any project from small to large scale.\n\n###"
    },
    "h2o-worx": {
      "business name": "H2O Worx",
      "about_us_paragraph": "### About Us\n\nWater Worx Services, Inc. is a utility contractor specializing in professional sewer and water utility services for Central and Eastern North Carolina. We offer a range of services including sewer and water hookups, backflow prevention, storm drain maintenance, and expert service on fire hydrants and water meters. Our company is dedicated to providing reliable and prompt services to both residential and commercial clients. With a focus on integrity and professionalism, we strive to exceed expectations on every job.\n\n###"
    },
    "poe-s-services": {
      "business name": "Poe's services",
      "about_us_paragraph": "### About Us\n\nWelcome to Poe's Services, a trusted and expert maintenance company located in Montevallo, Alabama. Our mission is to provide top-notch maintenance services that meet the unique needs of our clients. With a strategic location at 8088 AL-155, Montevallo, AL 35115, we are poised to respond quickly to any maintenance emergency or request. Our highly trained and certified team is equipped with the latest technology to ensure efficient and effective service delivery. Our commitment to quality and professionalism has earned us a stellar reputation, reflected in our 13 Google My Business reviews with an average rating of 5/5. Whether you need routine maintenance or urgent repairs, Poe's Services is dedicated to providing personalized service that exceeds your expectations.\n\n###"
    },
    "hydrotech-plumbing-llc": {
      "business name": "HydroTech Plumbing LLC",
      "about_us_paragraph": "### About Us\n\nHydrotech Plumbing LLC is a trusted and reliable plumbing service provider dedicated to delivering exceptional quality and integrity in every aspect of our business. With a wide range of services including bathroom remodeling, bathtub installation, drain cleaning, emergency plumbing, faucet installation, and much more, we cater to all your residential and commercial plumbing needs. Our commitment to excellence is evident in our meticulous attention to detail and our ability to solve complex plumbing issues efficiently. We serve the Tulsa area, including Broken Arrow, Jenks, Oakhurst, Owasso, Sand Springs, Sapulpa, and Tulsa.\n\n###"
    },
    "strickland-plumbing-maintenance": {
      "business name": "Strickland Plumbing & Maintenance",
      "about_us_paragraph": "### About Us\n\nStrickland Plumbing & HVAC, Inc. is a leading provider of HVAC and plumbing services in Lufkin, TX. Founded on a commitment to craftsmanship and community service, our company has grown from humble beginnings to become a trusted name in the industry. With a mission to deliver unparalleled service and expertise, we have established ourselves as a pillar in the community through our reliability, professionalism, and dedication to customer satisfaction. Our journey is marked by a rich history of innovation and adaptation, from offering basic services to expanding our offerings with cutting-edge technologies like Nuflow Pipe Relining. Today, Strickland Plumbing & HVAC, Inc. stands as a name synonymous with trust, quality, and impeccable service.\n\n###"
    },
    "cobb-underground-llc": {
      "business name": "Cobb Underground, LLC",
      "about_us_paragraph": "**About Us:**\nCobb Underground, LLC is a utility installation company based in Alabaster, Alabama. Founded by Mr. Brian Cobb, the company has been serving the region since 2013. Cobb Underground specializes in providing top-notch utility installation services, including directional drilling and cable plowing. Our commitment to excellence and customer satisfaction has earned us a reputation as a reliable and efficient service provider in the utility construction industry.\n\n**"
    },
    "r-d-heating-and-air-hvac-maintenance-contractor-heating-and-air-conditioning-service-pell-city-al": {
      "business name": "R & D Heating and Air - HVAC Maintenance Contractor, Heating and Air Conditioning Service Pell City AL",
      "about_us_paragraph": "### About Us\n\nR & D Heating and Air is a highly-rated HVAC contractor located in Pell City, Alabama. Founded on the principles of professionalism, reliability, and customer satisfaction, we specialize in heating and air conditioning services. Our team is dedicated to providing quick and reliable solutions to various HVAC issues, ensuring that our clients' homes are always comfortable and well-maintained. With a strong reputation for excellent customer service and fair pricing, R & D Heating and Air is the go-to choice for many residents in the area.\n\n###"
    },
    "leak-pros-of-al-ga": {
      "business name": "Leak Pros of Al & Ga",
      "about_us_paragraph": "### About Us\n\nAtlanta Leak Pros is a family-owned and operated swimming pool contractor dedicated to providing high-quality services in Atlanta, GA, and the surrounding areas. With over 13 years of experience in the industry, our team specializes in a range of services including pool leak detection, repairs, renovations, and resurfacing. We are committed to delivering tailored solutions that enhance both the functionality and beauty of your pool. Our commitment to quality and hands-on service has earned us an impeccable reputation with all 5-star reviews. We prioritize leak detection before repairs to address the root cause and prevent future issues, ensuring your pool is restored quickly and lasts longer.\n\n###"
    },
    "lewis-design-handyman-home-service": {
      "business name": "Lewis Design Handyman & Home Service",
      "about_us_paragraph": "### About Us\n\nAt Lewis Design Build Remodel, we are dedicated to transforming your home into the space you've always envisioned. With over a decade of experience in whole house remodeling, we bring together a team of in-house designers and skilled craftsmen to guide you through every step of the process. Whether you're looking to renovate one room or several, our streamlined approach ensures that your home remodel ideas become reality. We pride ourselves on our innovative methods, creative design solutions, and exceptional customer service. From beautiful, functional kitchens to modern, practical bathrooms, we help homeowners achieve their dream homes.\n\n###"
    },
    "timothy-foster-constrution-company": {
      "business name": "TIMOTHY FOSTER CONSTRUTION COMPANY",
      "about_us_paragraph": "### About Us\n\nTimothy Foster Construction Company is a reputable general contracting firm serving the Roanoke, Alabama area. Our company is dedicated to providing top-notch construction services, ensuring that every project meets the highest standards of quality and reliability. With a strong commitment to client satisfaction, we offer a wide range of services including general contracting, tailored to meet the unique needs of our clients.\n\n###"
    },
    "harris-county-plumbing": {
      "business name": "Harris County Plumbing",
      "about_us_paragraph": "### About Us\n\nAt Harris County Plumbing, we pride ourselves on being the go-to local plumbers for all your residential and commercial plumbing needs in Harris County, Texas. Our team of highly skilled and experienced plumbers is dedicated to providing top-notch services, from minor repairs to complex installations. We understand the unique challenges of homes and businesses in the area and strive to exceed our customers' expectations with every job. Whether you're dealing with a clogged drain, a leaky pipe, or a malfunctioning water heater, our reliable and efficient plumbing solutions ensure that your daily routine remains uninterrupted.\n\n###"
    },
    "reese-plumbing-llc": {
      "business name": "Reese Plumbing LLC",
      "about_us_paragraph": "### About Us\n\nReese Plumbing LLC is a dedicated and experienced plumbing service provider based in Alabama. Founded with a commitment to excellence, we offer a wide range of residential and commercial plumbing services designed to meet the diverse needs of our clients. Whether you require a simple faucet installation or a complete sewer line replacement, our team of skilled professionals is equipped to handle every project with precision and care. We strive to exceed expectations by ensuring that all plumbing work is completed to the highest standards. Our dedication to delivering exceptional service, combined with our use of the highest quality parts and equipment, sets us apart in the industry. We provide free consultations to explain all available options, ensuring that each client receives personalized attention and chooses the scope of work that's right for their home or business.\n\n###"
    },
    "twin-river-contractors": {
      "business name": "Twin River Contractors",
      "about_us_paragraph": "**About Us:**\nTwin River Contractors is a reputable construction company based in Demopolis, Alabama. With over 10 years of experience in the industry, we specialize in providing top-notch excavation services to our clients. Our commitment to quality and reliability has earned us a strong reputation in the community. We pride ourselves on our dedication to each project, ensuring that every task is completed efficiently and to the highest standards.\n\n**"
    },
    "kelly-c-williams-plumbing-inc": {
      "business name": "Kelly C. Williams Plumbing, Inc.",
      "about_us_paragraph": "### About Us\n\nKelly C. Williams Plumbing, Inc. is a family-owned and operated business that has been serving the Fortson, Georgia community for over 50 years. Founded in 1974, we have established ourselves as a trusted and reliable plumbing service provider. Our commitment to quality and customer satisfaction has earned us a reputation for excellence in the industry. Our team of licensed and insured plumbers is dedicated to providing prompt and efficient solutions for all your plumbing needs, from routine maintenance to emergency repairs.\n\n###"
    },
    "m-m-pumping-septic-repair": {
      "business name": "M & M Pumping & Septic Repair",
      "about_us_paragraph": "**About Us:**\nM&M Pumping & Septic Repair is a family-owned business dedicated to providing top-notch septic services to residential and commercial properties. With over 75 years of combined experience, we have established a reputation for reliability, integrity, and exceptional customer service. Our team of skilled professionals specializes in a wide range of septic services including tank cleaning, system repairs, replacements, and custom engineered septic field design and installation. We pride ourselves on setting the bar high for contractors by putting the customer first in every aspect of our work.\n\n**"
    },
    "alabama-water-heater": {
      "business name": "Alabama Water Heater",
      "about_us_paragraph": "### About Us\n\nAlabama Water Heater is a trusted provider of water heater services in the Birmingham area, dedicated to ensuring your home's hot water supply is always reliable and efficient. With years of experience in the industry, we offer a wide range of services including water heater installation, repair, and replacement. Our team of skilled technicians is fully licensed and insured, providing top-notch service with upfront pricing and a 100% satisfaction guarantee. We pride ourselves on our commitment to customer satisfaction and our ability to offer energy-efficient solutions that lower your bills.\n\n###"
    },
    "fortner-plumbing": {
      "business name": "Fortner Plumbing",
      "about_us_paragraph": "### About Us\n\nFortner Plumbing is a trusted name in the plumbing industry, committed to providing top-quality plumbing services to both residential and commercial clients. With years of extensive experience, our team of highly skilled plumbers is dedicated to delivering efficient solutions, exceptional workmanship, and unparalleled customer service. We understand the importance of reliable plumbing systems and strive to ensure that our clients receive prompt, trustworthy, and cost-effective services tailored to their unique needs. Whether it's routine maintenance, essential repairs, or intricate installations and renovations, Fortner Plumbing is your trusted partner for comprehensive plumbing services. We take pride in our meticulous attention to detail, unwavering professionalism, and a customer-centric approach. When you choose Fortner Plumbing, you can have complete confidence that your plumbing needs will be handled with utmost care and expertise.\n\n###"
    },
    "north-american-heating-and-air": {
      "business name": "North American Heating and Air",
      "about_us_paragraph": "### About Us\n\nNorth American Heating and Air is a leading provider of exceptional HVAC solutions, dedicated to enhancing occupant comfort and energy efficiency within the built environment. Our commitment to innovation and customer satisfaction has been unwavering since our inception. We leverage cutting-edge technology and a deep understanding of the industry to offer tailored solutions that cater to diverse customer needs. Our focus on digitization, urbanization, and climate change has enabled us to develop technologically advanced HVAC systems that meet the evolving demands of our clients.\n\n###"
    },
    "autauga-county-handyman": {
      "business name": "Autauga county handyman",
      "about_us_paragraph": "### About Us\n\nWelcome to Autauga County Handyman, your trusted partner for all your home and business repair needs. We are a locally owned and operated business dedicated to providing top-notch handyman services with a personal touch. Our team is comprised of experienced professionals who have been serving the Autauga County community for years, ensuring that every job is done with precision and care. We pride ourselves on our reliability, prompt service, and commitment to customer satisfaction.\n\n###"
    },
    "ramos-handyman-services": {
      "business name": "Ramos Handyman Services",
      "about_us_paragraph": "### About Us\n\nRamos Handyman Services is a reliable and versatile handyman service dedicated to providing top-notch assistance for all your home and property needs. With a strong commitment to quality, professionalism, and responsiveness, we strive to deliver exceptional service in every project we undertake. Our team of skilled professionals is equipped to handle a wide range of tasks, including interior painting, lawn mowing and trimming, pressure washing, and more. We serve the local communities with integrity and efficiency, ensuring that every customer receives personalized attention and satisfaction.\n\n###"
    },
    "joe-reid-dawes-plumbing-service": {
      "business name": "Joe Reid - Dawes Plumbing Service",
      "about_us_paragraph": "### About Us\n\nAt Joe Reid - Dawes Plumbing Service, we pride ourselves on providing top-notch plumbing solutions to the Mobile, Alabama community. Founded by Joe Reid, our service has earned a reputation for reliability and exceptional customer service. With years of experience in the industry, we offer a wide range of plumbing services including residential and commercial repairs, installations, and maintenance. Our commitment to quality and customer satisfaction has earned us positive reviews from satisfied clients who appreciate our professionalism and competitive pricing.\n\n###"
    },
    "brian-harden-plumbing-inc": {
      "business name": "Brian Harden Plumbing Inc.",
      "about_us_paragraph": "### About Us\n\nBrian Harden Plumbing Inc. is a family-owned and operated plumbing service based in Theodore, Alabama. Established in 2002, we have over 20 years of experience providing reliable and expert plumbing solutions to both residential and commercial clients. Our commitment to craftsmanship and dedication to our community has made us a trusted name in the region. We offer a wide range of services including meticulous drain cleaning, dependable septic tank cleaning, and intricate installations such as tankless water heaters. Our skilled sewer contractors work diligently to remedy any plumbing issue with gentleness and precision, ensuring peace flows seamlessly through every pipe and connection. We are more than just a plumbing company; we are neighbors striving to uplift our community by fostering connections and upholding values that bind us together.\n\n###"
    },
    "a-c-e-plumbing-solutions": {
      "business name": "A.C.E. Plumbing Solutions",
      "about_us_paragraph": "### About Us\n\nA.C.E. Plumbing Solutions is a dynamic and innovative plumbing company based in Stoke-on-Trent, Staffordshire, England. Incorporated on 25 April 2023, we are committed to providing top-notch plumbing services with a focus on quality and customer satisfaction. Our team, led by Director Alexander Kevan Carr, brings over a decade of experience in the plumbing industry, ensuring that every job is done with precision and care. We specialize in plumbing, heat, and air-conditioning installation (SIC 43220), catering to both residential and commercial clients. Our mission is to deliver reliable, efficient, and cost-effective solutions that meet the unique needs of our customers.\n\n###"
    },
    "alabama-septic-service": {
      "business name": "Alabama Septic Service",
      "about_us_paragraph": "**About Us:**\nAlabama Septic Services LLC is a locally owned and operated company dedicated to providing top-notch septic services in the tri-county area. With over 50 years of experience, our team is licensed through the Alabama Onsite Wastewater Board in the pumper classification through Advanced Level II classification and Adenus certified. We understand the importance of reliable septic systems for both residents and businesses, offering a range of services including septic tank pumping, repairs, maintenance, and new system installations. Our commitment to quality work and customer satisfaction ensures that your septic needs are met promptly and professionally.\n\n**"
    },
    "b-b-torch-regulator-and-repair-service-llc": {
      "business name": "B & B Torch Regulator and Repair Service LLC",
      "about_us_paragraph": "### About Us\n\nB & B Torch Regulator and Repair Service LLC is a dedicated and experienced company based in Cleveland, Alabama. Founded on January 9, 2017, we specialize in providing top-notch torch and regulator repair services to our clients. Our team is committed to delivering high-quality solutions with precision and reliability. We pride ourselves on our extensive knowledge and expertise in the field, ensuring that every repair is done to the highest standards. Our mission is to provide exceptional service, ensuring that our customers' equipment operates efficiently and safely.\n\n###"
    },
    "central-fire-protection": {
      "business name": "Central Fire Protection",
      "about_us_paragraph": "### About Us\n\nCentral Fire Protection Inc. is a leading provider of fire protection systems and services in the Southeast, with a strong presence in Birmingham, Alabama. Specializing in commercial, industrial, and residential fire protection systems, our team offers comprehensive solutions including design, installation, inspection, repairs, maintenance, and fire/security alarm services. Our N.I.C.E.T. certified engineering technicians and experienced sprinkler fitters work alongside our sales force and project managers to deliver uncompromising solutions tailored to your specific needs. We are dedicated to ensuring the highest level of safety and compliance with local regulations.\n\n###"
    },
    "sims-plumbing-air": {
      "business name": "Sims plumbing & air",
      "about_us_paragraph": "### About Us\n\nSims Plumbing & Air is a trusted provider of comprehensive HVAC and plumbing services in the Sims, NC area. With a commitment to delivering top-notch solutions, our experienced technicians are dedicated to ensuring your home or business remains comfortable and efficient throughout the year. Whether you need maintenance, repair, or installation services for your heating, cooling, or plumbing systems, we offer a wide range of specialized tools and expert knowledge to handle your needs with precision. Our goal is to provide honest advice and exceptional service that keeps you coming back.\n\n###"
    },
    "quality-plumbing-co": {
      "business name": "Quality Plumbing Co.",
      "about_us_paragraph": "**About Us:**\nQuality Plumbing Co. is a trusted and reliable plumbing service provider in Union Grove, Alabama. Our team of skilled and licensed plumbers is dedicated to delivering top-notch service with professionalism and punctuality. We offer a wide range of plumbing services, including drain cleaning, gas line installation, and emergency plumbing repairs. Our commitment to quality and customer satisfaction has earned us a 5-star rating with one customer review, highlighting our exceptional service and reliability.\n\n**"
    },
    "affordable-airconditing-asap": {
      "business name": "Affordable Airconditing ASAP",
      "about_us_paragraph": "### About Us\n\nAffordable Heating & Air LLC is your trusted partner for all your HVAC needs in Birmingham, Alabama. Specializing in budget-friendly HVAC services and energy-efficient products, we aim to provide top-notch solutions that save you money while keeping your indoor space comfortable. Our team of NATE-Certified technicians is dedicated to professionalism and expertise, ensuring that every service visit minimizes disruptions and respects your property. With a 100% satisfaction guarantee, we strive to make every interaction with us a positive one. Whether you need emergency heating and cooling services, AC or furnace repair, or installation of new systems, Affordable Heating & Air LLC is here to serve you promptly and efficiently.\n\n###"
    },
    "tracy-duncan-plumbing": {
      "business name": "Tracy Duncan Plumbing",
      "about_us_paragraph": "### About Us\n\nTracy Duncan Plumbing is a family-owned and operated business dedicated to providing top-notch plumbing solutions to homeowners and businesses in Jasper, Alabama. With over 20 years of experience, our team of licensed and insured plumbers is committed to delivering high-quality, reliable services. From gas line installation to emergency water heater repair, we offer a comprehensive range of plumbing services designed to meet the unique needs of our community. Our mission is to ensure your plumbing system runs smoothly and efficiently, while prioritizing your safety and satisfaction.\n\n###"
    },
    "local-professional-handyman": {
      "business name": "Local Professional Handyman",
      "about_us_paragraph": "### About Us\n\nLocal Professional Handyman is your trusted partner for all your home and business repair needs. With years of experience in the industry, our team of skilled professionals is dedicated to providing top-notch handyman services that ensure your property remains in excellent condition. We pride ourselves on our commitment to quality, reliability, and customer satisfaction. Our services include a wide range of tasks such as door installation and repair, tile installation and repair, drywall installation and repair, restroom repair, painting services, commercial carpentry, cubicle and furniture assembly, installation of crown molding, fence installation and repair, stucco repair, and removal of graffiti. We understand the importance of your time and schedule, so we arrive on time and fully equipped to tackle any project efficiently.\n\n###"
    },
    "stephen-seibert-plumbing-llc": {
      "business name": "Stephen Seibert Plumbing, LLC",
      "about_us_paragraph": "### About Us\n\nStephen Seibert Plumbing, LLC is a reputable plumbing company based in Hartselle, Alabama, dedicated to providing top-notch plumbing services to residential and commercial clients. Founded on May 24, 2013, the company has been serving the community for over 11 years with a commitment to excellence and customer satisfaction. Our team of skilled professionals is equipped to handle a wide range of plumbing tasks, including gas and appliance installation, sewer laterals, septic tanks and systems, and boiler/water heater services. We pride ourselves on our reliability, professionalism, and attention to detail, ensuring that every project is completed efficiently and to the highest standards.\n\n###"
    },
    "lovelace-service-heating-air": {
      "business name": "Lovelace Service Heating & Air",
      "about_us_paragraph": "### About Us\n\nLovelace Services Heating & Air, established in 1991, is a trusted name in Decatur, Alabama, specializing in HVAC installation and repair, as well as commercial refrigeration and appliance repair. Our commitment to quality and customer satisfaction has earned us a reputation for professionalism and responsiveness. We pride ourselves on providing reliable heating and cooling solutions to both residential and commercial clients, ensuring their comfort and efficiency.\n\n###"
    },
    "north-alabama-drain-cleaning-etc-llc": {
      "business name": "North Alabama Drain CLeaning,etc LLC",
      "about_us_paragraph": "### About Us\n\nAnderson Plumbing of North Alabama, LLC is a professional plumbing company dedicated to providing top-notch services for both residential and commercial needs. With over 18+ years of experience, our team of highly skilled and licensed plumbers is equipped to handle a wide range of plumbing services with prompt, efficient, and affordable solutions. We pride ourselves on our commitment to excellence and customer satisfaction, ensuring that every job is done right.\n\n###"
    },
    "d-l-remodeling-and-flooring": {
      "business name": "D&L Remodeling and Flooring",
      "about_us_paragraph": "### About Us\n\nD&L Remodeling and Flooring is a dedicated construction company based in Palm Bay, Florida. Specializing in demolition and rough carpentry, we pride ourselves on delivering high-quality services to residential clients. Our team of skilled professionals ensures that every project is completed with precision and care, transforming spaces into beautiful and functional living areas. With a commitment to excellence and customer satisfaction, we strive to make every renovation experience seamless and enjoyable.\n\n###"
    },
    "right-a-way-rooter": {
      "business name": "Right-A-Way Rooter",
      "about_us_paragraph": "**About Us:**\nRight-A-Way Rooter, located in Dothan, Alabama, is dedicated to providing top-notch plumbing services to residential and commercial clients. Our team of skilled professionals is committed to delivering high-quality work with integrity and honesty. We specialize in a variety of services including grease trap pumping, leach line repair, and septic tank pumping. Our goal is to ensure that every customer receives prompt and reliable service, making us the trusted choice for all their plumbing needs.\n\n**"
    },
    "shaw-s-handyman-services": {
      "business name": "Shaw's Handyman Services",
      "about_us_paragraph": "### About Us\n\nShaw's Handyman Services, formerly known as Handyman Services of CT, has been a trusted name in southeastern Connecticut for over 15 years. Founded by Colin Shaw in June 2006, the company initially focused on providing reliable and local handyman services for home maintenance, repair, and renovation needs. Over the years, Shaw's Handyman Services has expanded its offerings to include larger projects like kitchen and bathroom remodels, as well as home additions. Despite this growth, the company has maintained its commitment to smaller-scale projects, ensuring that every homeowner can find the right solution for their needs. Our dedicated team of skilled craftsmen, led by Colin Shaw, personally manages each project to ensure exceptional quality and customer service. We pride ourselves on earning your trust through clear communication and attention to detail.\n\n###"
    },
    "stinnett-heating-cooling": {
      "business name": "Stinnett Heating & Cooling",
      "about_us_paragraph": "### About Us\n\nStinnett Heating & Cooling, located in Enterprise, Alabama, is a locally owned and operated HVAC contractor dedicated to providing top-notch heating and cooling services to the community. Founded in 2006, our team of highly trained and fully licensed technicians is committed to delivering excellent customer service and ensuring your comfort and satisfaction. We specialize in a wide range of services including air conditioning installation, repair, and replacement, as well as heating system installation and repair. Our emergency AC repair services are available 24/7 to address any cooling emergencies promptly. We pride ourselves on fast response times, expert technicians, and comprehensive services designed to meet your specific needs.\n\n###"
    },
    "rediworx-drain-sewer-cleaning": {
      "business name": "RediWorx Drain & Sewer Cleaning",
      "about_us_paragraph": "### About Us\n\nRediWorx Drain & Sewer Cleaning is your trusted partner for all your drain and sewer needs. With a commitment to excellence and customer satisfaction, we offer comprehensive services designed to keep your plumbing systems running smoothly. Our team of expert technicians is equipped with the latest technology and advanced tools to handle everything from minor clogs to major repairs. Whether you're dealing with a leaky drain, a slow-running shower, or a complex sewer issue, RediWorx is here to provide reliable and efficient solutions.\n\n###"
    },
    "terrapin-creek-plumbing-and-septic-service-llc": {
      "business name": "Terrapin Creek Plumbing And Septic Service, LLC",
      "about_us_paragraph": "### About Us\n\nTerrapin Creek Plumbing And Septic Service, LLC is a locally owned and operated business based in Centre, Alabama. With over 14 years of experience in the plumbing and septic industry, our team is dedicated to providing top-notch services to residents and businesses in the area. We specialize in a wide range of plumbing solutions, including drain cleaning, sewer services, and septic system maintenance. Our commitment to quality and customer satisfaction has earned us a reputation as one of the most reliable plumbing companies in Centre.\n\n###"
    },
    "dorsey-plumbing-llc": {
      "business name": "Dorsey Plumbing LLC",
      "about_us_paragraph": "### About Us\n\nDorsey Plumbing LLC is a professional plumbing service provider dedicated to delivering exceptional, trustworthy, and knowledgeable solutions to our clients. With over 30 years of experience in the industry, we have built a reputation for reliability and expertise. Our commitment to quality is evident in our membership with the Plumbing-Heating-Cooling Contractors Association (PHCC), which provides us with the latest plumbing techniques and networking opportunities. As an accredited member of the Better Business Bureau, we maintain the highest business standards and strive to improve our service continuously. Our friendly and dependable technicians take pride in their work, ensuring that every plumbing problem is solved efficiently and effectively.\n\n###"
    },
    "iron-island-home-services": {
      "business name": "Iron Island Home Services",
      "about_us_paragraph": "### About Us\n\nIron Island Home Services, based in Fort Payne, Alabama, is a trusted provider of comprehensive home maintenance and repair solutions. Founded with a commitment to excellence and customer satisfaction, our team of skilled professionals offers a wide range of services designed to enhance the comfort and value of your home. From routine maintenance to major renovations, we pride ourselves on our attention to detail and dedication to quality. Our goal is to provide reliable, efficient, and cost-effective solutions that meet the unique needs of each client.\n\n###"
    },
    "reliable-usa-plumbing": {
      "business name": "Reliable USA Plumbing",
      "about_us_paragraph": "### About Us\n\nReliable USA Plumbing is a trusted and family-owned plumbing service provider in Foley, Alabama. Our team of fully licensed, bonded, and insured plumbers is dedicated to delivering top-notch plumbing solutions with integrity and honesty. We pride ourselves on our commitment to quality workmanship and customer satisfaction, ensuring that every service we provide meets the highest standards. Whether you need emergency repairs, routine maintenance, or comprehensive plumbing solutions, our skilled technicians are equipped to handle any issue with professionalism and reliability.\n\n###"
    },
    "reliable-usa-plumbers": {
      "business name": "Reliable USA Plumbers",
      "about_us_paragraph": "### About Us\n\nReliable USA Plumbers in Mobile, Alabama, is a trusted and family-owned plumbing service dedicated to providing top-notch plumbing solutions for both residential and commercial clients. With years of experience in the industry, our team of expert plumbers is equipped to handle any plumbing issue, from clogged drains and grinder pump repairs to full bathroom remodels and new installations. We pride ourselves on our commitment to customer satisfaction, ensuring that every job is completed with the highest regard for quality and respect for our clients' properties. Our rates are affordable, and our plumbers are licensed and insured, providing peace of mind for our customers.\n\n###"
    },
    "dj-s-handyman-service": {
      "business name": "DJ?s handyman service",
      "about_us_paragraph": "### About Us\n\nDJ's Handyman & Repair Service is dedicated to making your house a home by providing top-notch handyman services. With years of experience in both construction and installation, we specialize in a wide range of tasks from wire tightening to garage organization and leaky faucet repair. Our goal is to save you time and take care of your honey-do list, ensuring that your home remains in excellent condition. Whether you need a free estimate or urgent assistance, we are here to help. Contact us today to schedule your appointment and let us handle all your home maintenance needs.\n\n###"
    },
    "affordable-handyman-services-llc": {
      "business name": "Affordable Handyman Services, LLC",
      "about_us_paragraph": "### About Us\n\nAffordable Handyman Services, LLC is a fully licensed and insured handyman company dedicated to providing professional home repair and maintenance services in Miami-Dade and Broward counties. Our team of skilled professionals is committed to delivering high-quality services that meet your needs and schedule. From furniture assembly to drywall installation, painting, and plumbing repairs, we offer a wide range of services designed to keep your home in top condition. Our guarantee of quality workmanship and timely service ensures that you can trust us to handle any job around your house.\n\n###"
    },
    "bradley-hardware": {
      "business name": "BRADLEY HARDWARE",
      "about_us_paragraph": "### About Us\n\nBradley Hardware, located at 115 E Main St, Samson, AL 36477, is a trusted hardware store dedicated to serving the community with top-quality tools and products. Our store offers a wide range of items, from general hardware to gardening supplies, ensuring that you have everything you need for your projects. Our knowledgeable staff is always ready to provide expert advice to help you complete your tasks efficiently. Whether you're a seasoned DIY enthusiast or a homeowner looking for reliable solutions, Bradley Hardware is your go-to destination in Samson.\n\n###"
    },
    "myers-comfort-specialist": {
      "business name": "Myers Comfort Specialist",
      "about_us_paragraph": "### About Us\n\nMyers Comfort Specialists is a family-owned and operated business dedicated to providing top-notch HVAC services in Daphne, Alabama. With over 10 years of trusted experience, we pride ourselves on delivering reliable service and quality installations. Our team of experts is committed to ensuring that your home remains comfortable and efficient, whether you need routine maintenance, repairs, or a new HVAC system. We offer eco-friendly solutions and emergency services to meet all your heating and cooling needs. Our goal is to provide you with peace of mind knowing that your system will be fixed right the first time.\n\n###"
    },
    "built-in-purpose": {
      "business name": "Built in Purpose",
      "about_us_paragraph": "### About Us\n\nBuilt on Purpose is a specialized executive coaching and consulting firm dedicated to enhancing the leadership and organizational capacity of agencies. Founded on the principle of purpose-driven growth, we offer a range of services including executive coaching, team assessments, and strategic planning. Our mission is to empower agency leaders with the tools and insights needed to achieve sustainable success. With a focus on holistic development, we aim to build strong, resilient organizations that make a lasting impact.\n\n###"
    },
    "hewlett-son-s-remodeling": {
      "business name": "Hewlett & Son's Remodeling",
      "about_us_paragraph": "**About Us:**\nHewlett & Son's Construction is a trusted remodeling contractor based in Huntsville, Alabama, dedicated to delivering top-notch home repair and remodeling services. With a wide range of expertise, from painting and flooring to drywall, roofing, electrical, plumbing, tile installation, kitchen and bathroom renovations, room additions, decks, framing, trim work, and custom projects, we handle all your home improvement needs. Our commitment to quality and customer satisfaction has earned us an average rating of 4.20 on Porch.\n\n**"
    },
    "affordable-backflow-testing-services": {
      "business name": "Affordable Backflow Testing Services",
      "about_us_paragraph": "### About Us\n\nAffordable Backflow Testing Service is a dedicated and reliable provider of backflow testing services in Irondale, Alabama. Founded to ensure the safety and integrity of water supplies, our team is committed to delivering high-quality testing and maintenance services for backflow preventers. With years of experience in the plumbing industry, we specialize in annual required testing, new installations, and device failure repairs. Our certified testers are equipped to handle all aspects of backflow testing, ensuring compliance with the Birmingham Water Works Board's regulations. We pride ourselves on our prompt service, efficient testing processes, and detailed reporting to keep your water supply safe from contamination.\n\n###"
    },
    "wise-plumbing-and-gas-llc": {
      "business name": "Wise Plumbing and Gas LLC",
      "about_us_paragraph": "### About Us\n\nWise Plumbing and Gas LLC has been a trusted name in the plumbing industry since 2011. Based in Malling Tonbridge, we cover the entire Kent area, providing comprehensive plumbing and heating services. Our commitment to the highest standards of workmanship and customer service sets us apart. As a Gas Safe registered company, we ensure that our services provide the safest solutions for all your plumbing needs. Our team is dedicated to delivering exceptional results, from boiler installations to bathroom renovations, ensuring that every job is completed efficiently and to the highest quality.\n\n###"
    },
    "performance-plumbing-inc": {
      "business name": "Performance Plumbing, Inc",
      "about_us_paragraph": "### About Us\n\nPerformance Plumbing Inc is a reputable and locally owned plumbing company dedicated to providing high-quality commercial plumbing services in Norfolk, VA, and surrounding areas. With over 30 years of experience, our team of OSHA-certified technicians specializes in a wide range of services including commercial plumbing, drain cleaning, water heater repairs, video inspections, sewer repairs, and hydro excavation. We pride ourselves on our 24/7 emergency services, ensuring that you can rely on us at any time for prompt and reliable solutions. Our commitment to quality is evident in our state-of-the-art equipment and guaranteed workmanship. Whether you're facing a burst pipe, clogged drain, or sewer problem, our expert technicians are here to help you resolve your plumbing issues efficiently.\n\n###"
    },
    "drs-handyman": {
      "business name": "DRS Handyman",
      "about_us_paragraph": "### About Us\n\nAt DRS Handyman, we pride ourselves on being a locally owned and operated business dedicated to providing top-notch handyman services in Alabaster, Alabama. With over 5 years of experience serving the Birmingham area and its surroundings, our team of skilled professionals is equipped to handle any home project, no matter how big or small. We are committed to delivering exceptional service and ensuring customer satisfaction with every job we undertake. Whether you need help with carpentry, painting, deck repairs, or any other home maintenance task, our experienced handymen are here to help.\n\n###"
    },
    "mclure-services": {
      "business name": "mclure services",
      "about_us_paragraph": "### About Us\n\nMcClure Services, LLC is a wholly owned, single member limited liability subsidiary managed and operated by McClure Park, LLC. Established in 2007 under the Indiana Business Flexibility Act, McClure Services is dedicated to conducting all administrative activities for companies residing in the Purdue Research Park network and external statewide businesses. The purpose of McClure Services is to support the operational needs of these businesses, ensuring a seamless and efficient environment for innovation and growth.\n\n###"
    },
    "campbell-s-painting-and-handyman-services-llc": {
      "business name": "Campbell's painting and handyman services LLC",
      "about_us_paragraph": "### About Us\n\nCampbell's Painting and Handyman Services LLC, located in Cedartown, Georgia, is dedicated to providing top-notch painting and handyman services to homeowners and businesses in the area. Founded in 2024, our team is committed to delivering exceptional quality and customer satisfaction. We pride ourselves on reasonable costs and affordable solutions that meet the diverse needs of our clients. Our mission is to make home improvement projects hassle-free and enjoyable, ensuring that every job is completed professionally and efficiently.\n\n###"
    },
    "4g-plumbing-and-drain-cleaning": {
      "business name": "4G Plumbing and Drain Cleaning",
      "about_us_paragraph": "### About Us\n\n4G Plumbing & Heating, Inc. is a trusted and experienced plumbing, heating, and air conditioning contractor based in Missoula, Montana. Since 2009, we have been dedicated to providing professional quality work for reasonable charges. Our team is committed to delivering educational and informative services that meet the unique needs of our clients. Whether you need residential or commercial work, our experts are equipped to handle a wide range of plumbing, heating, and air conditioning services.\n\n###"
    },
    "g-m-immaculations": {
      "business name": "G & M IMMACULATIONS",
      "about_us_paragraph": "### About Us\n\nG & M Manufacturing Corp. is a custom manufacturer specializing in precision metal stamping services. Established in 1967, the company has been dedicated to delivering high-quality, tailored metal parts for various industries including automotive, electronics, electrical, consumer products, and medical. Our state-of-the-art facility is ISO 9001:2015 certified and equipped with high-speed presses up to 100 tons, each outfitted with in-die sensors and automated camera systems to ensure the highest quality part production. We offer a wide range of services including deep drawing, stamping, busbars, terminals and lugs, fabrication, forming, machining, milling, molding, prototyping, and sinks. Our commitment to innovation and customer satisfaction has made us a trusted partner for medium to high volume production runs.\n\n###"
    },
    "royal-flush-septic-tank-pumping-company": {
      "business name": "Royal Flush Septic Tank Pumping Company",
      "about_us_paragraph": "### About Us\n\nRoyal Flush Septic Tank Pumping Co. in Smiths Station, Alabama, is a highly regarded and professional septic tank pumping service. With a commitment to quality, value, and punctuality, our team ensures that every service is completed efficiently and effectively. Our crew arrives on time and completes the service in a timely manner, often in under an hour. We pride ourselves on providing reasonable prices without compromising on the quality of our work. Our customers have consistently rated us highly for our professionalism, responsiveness, and overall satisfaction.\n\n###"
    },
    "bass-built-homes": {
      "business name": "Bass Built Homes",
      "about_us_paragraph": "### About Us\n\nBass Built Custom Homes is a premier luxury home builder in Coastal North Carolina, dedicated to transforming your vision into a stunning reality. Founded by Bryant Bass, a seasoned construction manager with a passion for excellence, the company has been serving the community since 2000. With a focus on custom luxury homes and meticulous attention to detail, Bass Built ensures that every home is not just built, but artfully crafted. Our team blends design, construction, and customer service to deliver homes that are both beautiful and resilient. Whether you're envisioning a serene retreat with ocean views or a home that seamlessly blends work and personal life, we are here to make it a reality.\n\n###"
    },
    "condo-care": {
      "business name": "Condo Care",
      "about_us_paragraph": "### About Us\n\nCondo Care is a premier home maintenance and repair service dedicated to providing top-notch care for condominiums and homes in the Grand Strand area. With over 30 years of experience, our team is committed to ensuring that every property is well-maintained and safe. We offer a wide range of services including ceiling fan installation, interior painting, dryer vent cleaning, power washing, gutter cleaning, storm door installation, and more. Our goal is to provide professional service on a timely basis that is affordable for all our clients. Whether you're a resident or a second homeowner, we strive to make your living experience as smooth and hassle-free as possible.\n\n###"
    },
    "coffeeville-building-supply": {
      "business name": "Coffeeville Building Supply",
      "about_us_paragraph": "### About Us\n\nCoffeeville Building Supply is a locally owned and operated business dedicated to providing top-quality building materials and services to the community of Coffeeville, Alabama. Our mission is to offer a wide range of products, including lumber, hardware, and construction supplies, to meet the diverse needs of both residential and commercial customers. We pride ourselves on our commitment to excellent customer service and our ability to deliver promptly and efficiently.\n\n###"
    },
    "payton-s-septic-services": {
      "business name": "PAYTON'S SEPTIC SERVICES",
      "about_us_paragraph": "**About Us:**\nAt Payton's Septic Services, we pride ourselves on delivering top-notch septic services to the residents of Saraland, Alabama, and surrounding areas. Our expert team is dedicated to providing exceptional service, ensuring that your septic needs are met with professionalism and reliability. With years of experience in the industry, we specialize in septic tank pumping, cleaning, and inspections. Our commitment to quality and customer satisfaction has earned us a reputation as one of the most trusted septic service providers in the region.\n\n**"
    },
    "keeping-cost-low-llc-handyman-remodeler": {
      "business name": "Keeping Cost-Low LLC Handyman/Remodeler",
      "about_us_paragraph": "### About Us\n\nWelcome to Keeping Cost-Low LLC, your trusted handyman and remodeler for all your home improvement needs. Founded by John Smith, a seasoned professional with over 15 years of experience in the industry, our mission is to provide top-notch services at affordable prices. We specialize in general repairs and maintenance, including painting, flooring, and trim work. Our commitment to quality and customer satisfaction has earned us a reputation as one of the most reliable and cost-effective handyman services in the area.\n\nWe pride ourselves on our attention to detail and our ability to handle a wide range of projects, from small repairs to larger remodels. Our team is dedicated to ensuring that every job is completed efficiently and to the highest standards. Whether you need help with kitchen installations, bathroom renovations, or just some general handyman work, we are here to assist you.\n\nAt Keeping Cost-Low LLC, we believe in transparency and honesty. We provide clear estimates and timelines for all our projects, ensuring that you know exactly what to expect from start to finish. Our goal is not only to meet but exceed your expectations, making us your go-to choice for all your home improvement needs.\n\n###"
    },
    "johnston-electrical": {
      "business name": "Johnston Electrical",
      "about_us_paragraph": "### About Us\n\nJohnston Electrical is a trusted and reliable electrician located in Hueytown, Alabama. With a commitment to excellence and customer satisfaction, we provide top-notch electrical services to residents and businesses in the area. Our team of skilled electricians is dedicated to ensuring that every job is done efficiently and safely. Whether you need residential or commercial electrical work, from simple repairs to complex installations, we have the expertise and equipment to get the job done right.\n\n###"
    },
    "lowe-s-proservices": {
      "business name": "Lowe's ProServices",
      "about_us_paragraph": "### About Us\n\nLowe's ProServices in Mobile, Alabama, is a premier supplier of building materials and hardware, dedicated to serving the needs of professional contractors and DIY enthusiasts alike. Located at 7760 Airport Blvd, Mobile, AL 36608, our store operates from 6:00 AM to 9:00 PM Monday through Friday and 6:00 AM to 9:00 PM on Saturday, with Sunday hours from 8:00 AM to 8:00 PM. We offer a wide range of products including plumbing fixtures, tools, and building materials. Our commitment to customer service is evident in our friendly and knowledgeable staff, who are always ready to assist with your project needs.\n\n###"
    },
    "weiss-lake-septic-pumpers-llc": {
      "business name": "Weiss Lake Septic Pumpers LLC",
      "about_us_paragraph": "### About Us\n\nWeiss Lake Septic Pumpers & Portable Toilets, LLC is a dedicated team of professionals specializing in septic tank cleaning and portable toilet services. Located in Centre, Alabama, we pride ourselves on providing top-notch sewage treatment supplies and septic system maintenance. Whether you need a routine check-up for your septic system or pristine portable toilets for an event, our team is here to help. We understand the importance of keeping your septic systems running smoothly and offer services that are both reliable and efficient. Our commitment to excellent service with a smile has earned us glowing reviews and a reputation as the go-to service in the area.\n\n###"
    },
    "covenant-engineering-cea-llc": {
      "business name": "Covenant Engineering - CEA, LLC",
      "about_us_paragraph": "**About Us:**\nCovenant Engineering - CEA, LLC is a reputable engineering firm based in Northport, Alabama. Founded by Richard Burkhalter, a seasoned professional with over 30 years of experience in project engineering and management, the company specializes in a wide range of engineering services. With a strong background in process and plant design for various industries including lube oil blending, lubricating grease compounding, asphalt blending, vegetable oil processing, and grain handling, Covenant Engineering provides expert solutions to meet the complex needs of its clients. The firm is committed to delivering high-quality projects on time and ensuring compliance with all relevant regulations.\n\n**"
    },
    "wolf-plumbing-services": {
      "business name": "Wolf Plumbing Services",
      "about_us_paragraph": "**About Us:**\nWolf Plumbing Services is a reputable plumbing contractor located at 2146 Chinnabee Rd in Munford, Alabama. Specializing in leaks, commodes, and stools, we offer a wide range of services including commercial and residential plumbing solutions. Our team is licensed, insured, and bonded to ensure top-notch service. We provide 24-hour emergency services and offer senior citizen discounts, military discounts, and church discounts. Our expertise extends to backflow prevention, blocked drain repairs, toilet and tap repairs, and more. At Wolf Plumbing Services, we are committed to being an integral part of both residential and commercial markets with our indispensable plumbing services.\n\n**"
    },
    "terry-s-remodeling": {
      "business name": "Terry's Remodeling",
      "about_us_paragraph": "### About Us\n\nTerry's Remodeling, based in Athens, Alabama, is a trusted and reliable provider of home improvement services. With a focus on delivering exceptional quality and customer satisfaction, our team of skilled professionals offers a range of services including handyman work, interior painting, and holiday lighting installation and removal. We pride ourselves on our attention to detail and commitment to excellence in every project we undertake. Whether you're looking to enhance your home's aesthetic or tackle a specific repair, Terry's Remodeling is here to help.\n\n###"
    },
    "j-a-s-handyman-services-llc": {
      "business name": "J&A's Handyman Services,LLC.",
      "about_us_paragraph": "### About Us\n\nJ&A's Helping Hands Handyman Service, LLC, is a locally owned and operated business in Brewton, Alabama. We pride ourselves on providing top-notch handyman services to ensure your home is well-maintained and safe. Our team of skilled professionals is dedicated to delivering exceptional service with a personal touch. Whether you need assistance with minor repairs, home improvements, or routine maintenance, we are here to help. Our commitment to quality and customer satisfaction has made us a trusted name in the community.\n\n###"
    },
    "dixie-services-llc": {
      "business name": "Dixie Services LLC",
      "about_us_paragraph": "### About Us\n\nDixie Services LLC is a reputable carrier based in Jay, Florida. Founded to provide reliable and efficient transportation solutions, our company operates under the USDOT number 3888397. With a single tractor and one driver, we specialize in Intrastate Non-Hazmat cargo operations. Our commitment to safety and customer satisfaction has earned us a strong reputation in the industry. We pride ourselves on our ability to handle various logistics needs with precision and care.\n\n###"
    },
    "plumbworks-llc": {
      "business name": "PlumbWorks LLC",
      "about_us_paragraph": "### About Us\n\nPlumbWorks LLC is a trusted and veteran-owned plumbing service dedicated to providing exceptional, reliable solutions for both residential and commercial clients. With a strong commitment to quality and customer satisfaction, our team of experienced professionals offers a wide range of services including emergency repairs, installations, and maintenance. Whether you're dealing with burst pipes, clogged drains, or any other plumbing issue, we are here to take the stress out of your plumbing problems. Our 24/7 emergency service ensures that you can count on us at any time.\n\n###"
    },
    "harris-plumbing-electric": {
      "business name": "Harris Plumbing & Electric",
      "about_us_paragraph": "### About Us\n\nHarris Plumbing & Electric in Ashland, Alabama, is a trusted and highly-rated plumbing and electrical service provider. With an average rating of 4.3 stars based on 67 online reviews, our team is dedicated to delivering exceptional service and ensuring your home is comfortable and safe. Our full-service approach includes installing, repairing, and maintaining all plumbing fixtures and features, from backflow preventers to conventional water heaters. We pride ourselves on our same-day emergency service, proactive preventative maintenance strategy, and commitment to honest pricing with satisfaction guaranteed on every job.\n\n###"
    },
    "veteran-s-plumbing": {
      "business name": "Veteran's Plumbing",
      "about_us_paragraph": "### About Us\n\nVeteran's Plumbing LLC is a family-owned and operated business dedicated to serving the Manitowoc, Two Rivers, and lakeshore areas. Founded by Jeff Jackson and Todd Blashka, both with over 40 years of combined plumbing experience, the company prides itself on providing exceptional service and reliability. Since their transition from Hein Plumbing, Inc., Jeff and Todd have established a reputation for honesty and commitment to their community. With a strong focus on customer satisfaction, Veteran's Plumbing LLC is the go-to choice for all your plumbing needs.\n\n###"
    },
    "crowes-trenching-plumbing": {
      "business name": "Crowes trenching & plumbing",
      "about_us_paragraph": "**About Us:**\nCrow's Plumbing Service is a family-owned and operated business proudly serving the Greater Austin Area since 2007. With over 20 years of experience, we have established ourselves as the trusted plumbing professionals for Round Rock and Austin residents. Our team of expert plumbers is dedicated to providing top-quality plumbing solutions, from installing and repairing pipes to ensuring proper drainage and sewer systems. We offer a comprehensive range of services including bathroom plumbing, kitchen plumbing, water leak repair, and water softening and purification. Our commitment to same-day service availability and unbeatable service warranties ensures that our clients receive prompt, reliable, and professional solutions tailored to their needs.\n\n**"
    },
    "marlowe-electric-heating-air-conditioning": {
      "business name": "Marlowe Electric Heating & Air Conditioning",
      "about_us_paragraph": "### About Us\n\nMarlowe Electric Heating & Air Conditioning, located in Linden, Alabama, is a trusted and reliable air conditioning contractor dedicated to providing top-notch services in the Linden area and its surroundings. With over [X] years of experience, our skilled technicians offer a wide range of services including heating and air conditioning installations, air duct cleaning, generator services, water cooler and water heater maintenance, plumbing solutions, and electrical repairs. We pride ourselves on delivering exceptional customer service and ensuring complete satisfaction for every project we undertake. Our commitment to quality workmanship and personalized solutions tailored to your specific needs sets us apart as a leading HVAC service provider in the region.\n\n###"
    },
    "jason-s-handyman-service": {
      "business name": "Jason's handyman service",
      "about_us_paragraph": "### About Us\n\nJason's Handyman Services is a reliable and efficient handyman service based in Brooklyn, New York. Founded by Jason, our team is dedicated to providing top-notch handyman, lighting installation, and furniture assembly services. With a focus on customer satisfaction, we offer fixed-price quotes for jobs and provide free quotes for larger projects to ensure transparency and clarity. Our extensive experience in the field, combined with self-taught skills and hands-on training, allows us to tackle a wide range of tasks from carpentry to drywall installation. We pride ourselves on our professionalism and commitment to delivering high-quality work.\n\n###"
    },
    "handyman-pro-solutions-inc": {
      "business name": "Handyman Pro Solutions Inc.",
      "about_us_paragraph": "### About Us\n\nHandyman Pro Solutions, Inc. is a family-owned and operated company dedicated to delivering top-notch repair and remodeling services in both residential and commercial industries. With over 20 years of experience, we have established ourselves as a beacon of quality and reliability in the home improvement and handyman industry. Our commitment to quality workmanship, customer satisfaction, and ethical business practices has earned us a reputation as a trustworthy partner for countless clients. Whether you need plumbing, electrical work, carpentry, painting, or general home maintenance, our skilled professionals are equipped with the tools and expertise to tackle any project with precision and efficiency.\n\n###"
    },
    "queen-home-improvement-llc": {
      "business name": "Queen Home Improvement LLC",
      "about_us_paragraph": "### About Us\n\nQueen Home Improvement LLC is a professional home remodeling service based in LaFayette, Georgia. We specialize in providing top-notch home improvement solutions for any budget. Our team of skilled professionals is dedicated to delivering exceptional service and quality workmanship. Whether you need repairs, renovations, or full-scale remodeling, we are here to help you achieve your home improvement goals.\n\n###"
    },
    "dns-plumbing-llc": {
      "business name": "DNS Plumbing LLC",
      "about_us_paragraph": "### About Us\n\nDNS Plumbing LLC is a dedicated and reliable plumbing service provider committed to delivering exceptional solutions for both residential and commercial clients. Our team of skilled technicians is equipped to handle a wide range of plumbing issues, from emergency repairs to complex installations. We pride ourselves on quick response times and efficient solutions that ensure your plumbing system runs smoothly. Whether you need help with dripping faucets, clogged drains, or entire home repiping, our experts are here to assist you. We also specialize in kitchen and bathroom remodels, water heater installations and repairs, and custom home plumbing services tailored to your specific needs.\n\n###"
    },
    "harris-appliances": {
      "business name": "Harris Appliances",
      "about_us_paragraph": "### About Us\n\nHarris Appliances is a family-owned and operated business that has been serving the Harrisburg, PA area for over 50 years. Our commitment to quality and customer satisfaction has earned us a loyal customer base. We offer a wide range of electronics and appliances at competitive prices, ensuring that our customers find the best products for their needs.\n\n###"
    },
    "alpha-plumbers-inc": {
      "business name": "Alpha Plumbers Inc",
      "about_us_paragraph": "### About Us\n\nAlpha Plumbing Inc. is a reputable plumbing company based in Lakeland, FL, specializing in providing top-notch plumbing services to both commercial and residential clients. With a strong focus on customer service and quality work, our team of skilled professionals is dedicated to meeting and exceeding customer expectations. Founded in December 2023, we have quickly established ourselves as a trusted name in the industry, known for our prompt response times, competitive pricing, and commitment to integrity.\n\n###"
    },
    "waterworks-plumbing-drain-llc": {
      "business name": "WaterWorks Plumbing & Drain LLC",
      "about_us_paragraph": "### About Us\n\nWaterWorks Plumbing & Drain LLC is a trusted, one-stop shop providing vital repair, maintenance, and installation services for your home's plumbing, drain, and HVAC systems. With a humble beginning as a small drain cleaning company in 1986, we have grown into central Ohio?s leading plumbing, drain, heating, and cooling service provider. Our commitment to honesty, fairness, and dependability has earned us a reputation for exceeding expectations. We offer comprehensive services ranging from indoor leaks and clogs to outdoor pipeline and sewer repair, as well as complete heating and cooling repairs, tune-ups, and full system replacements. Our team of certified, licensed, bonded, and highly skilled technicians ensures superior service with real-time scheduling and around-the-clock availability.\n\n###"
    },
    "professional-plumbing-and-drain": {
      "business name": "Professional Plumbing and Drain",
      "about_us_paragraph": "### About Us\n\nAt Professional Plumbing & Drain, LLC, we are a local family-owned business deeply rooted in our community. Our mission is clear: to be the plumbing solution that ensures utmost convenience in your everyday life. We understand that a well-maintained plumbing system is not just about water flow; it's about creating a seamless experience where you can thrive, whether at home or in your place of business. Our journey begins with understanding your unique plumbing needs, ensuring every service we provide is specifically tailored to deliver the level of reliability you deserve. Our plumbers are genuine masters of the plumbing trade, armed with the knowledge, experience, and skills required to navigate the intricacies of water and drainage systems. From the tiniest detail to the most intricate aspect, we approach every task with an unparalleled dedication to excellence.\n\n###"
    },
    "american-air-solutions-inc": {
      "business name": "American Air Solutions Inc.",
      "about_us_paragraph": "### About Us\n\nAmerican Air Solutions, Inc. is a leading air conditioning and heating contractor based in Elberta, Alabama. With a commitment to excellence and customer satisfaction, we have been serving the community for years. Our team of experienced professionals offers a wide range of services including air conditioning and heating installation, generator and surge protection, and refrigeration solutions. We pride ourselves on providing personalized and reliable HVAC solutions tailored to meet the unique needs of both residential and commercial clients. Our dedication to quality service and staying up-to-date with the latest technologies ensures that your home or business remains comfortable and energy-efficient.\n\n###"
    },
    "agee-electric": {
      "business name": "Agee Electric",
      "about_us_paragraph": "### About Us\n\nAt Agee Electric in Alexander City, Alabama, we pride ourselves on delivering top-quality electrical services to homes and businesses across the area. Founded in 2002, our team of licensed electricians is dedicated to meeting all your electrical needs, from installations and upgrades to repairs and maintenance. With years of experience and a reputation for excellence, we combine expertise, customer service, and top-tier materials to provide tailored solutions for every project. Whether you're building a new property, remodeling an existing space, or upgrading your electrical systems, we ensure the job is done safely and efficiently.\n\n###"
    },
    "pike-s-plumbing-gas": {
      "business name": "Pike's Plumbing & Gas",
      "about_us_paragraph": "### About Us\n\nPike's Plumbing & Gas is a reliable and professional plumbing service provider based in Oneonta, Alabama. With a commitment to excellence, we offer a wide range of services including sewer and drain cleaning, sewer jetting, video inspection, sewer and water line installation, sewer and water line locating, and gas pressure tests. Our team of skilled plumbers is dedicated to providing top-notch service and ensuring customer satisfaction. We pride ourselves on our punctuality, professionalism, and responsiveness, making us the go-to choice for all your plumbing needs.\n\n###"
    },
    "always-give-never-take-inc": {
      "business name": "Always Give-Never Take inc.",
      "about_us_paragraph": "### About Us\n\nAlways Give-Never Take Inc. is a handyman service based in Huntsville, Alabama. Founded with the mission to provide reliable and efficient handyman solutions, the company specializes in a variety of tasks including drain repairs and general handyman services. Despite its efforts, Always Give-Never Take Inc. has received mixed reviews regarding its service quality, with many customers expressing dissatisfaction with the company's customer interaction and repair outcomes.\n\n###"
    },
    "mr-fixer-handyman-services": {
      "business name": "Mr. Fixer Handyman Services",
      "about_us_paragraph": "### About Us\n\nAt Mr. Fixer, we are your one-stop solution for all your residential and commercial repair, restoration, and renovation needs in San Antonio. Our team of well-rounded, knowledgeable, and experienced professionals is dedicated to providing top-notch handyman services. With a commitment to quality, reliability, and affordability, we ensure that every job is completed to the highest standards. From electrical and plumbing services to roofing, carpentry, and interior/exterior door repairs, we cover a wide range of tasks with precision and care. Our licensed and insured team prioritizes your schedule, offering efficient and cost-effective solutions that meet your actual needs. With a 100% work guarantee and no obligation quotes, you can trust Mr. Fixer for all your home improvement projects.\n\n###"
    },
    "old-trusty-handyman": {
      "business name": "Old Trusty Handyman",
      "about_us_paragraph": "### About Us\n\nThe Old Trusty Handyman is a family-owned business dedicated to providing top-notch property maintenance and home improvement services. With over 5 years of experience, we have built a reputation for our craftsmanship, dependability, and customer satisfaction. We started by offering our services to close friends and neighbors, and through referrals and customer support, we have expanded to serve realtors, homeowners, property managers, and homeowners associations. Our commitment to excellence is evident in every project we undertake, from bathroom remodels to kitchen renovations. We pride ourselves on being a problem-solving company for luxury communities, handling all their maintenance needs with precision and care.\n\n###"
    },
    "cats-plumbing": {
      "business name": "Cats Plumbing",
      "about_us_paragraph": "**About Us:**\n\nCats Plumbing is a family-owned and operated business with over 30 years of experience in providing top-quality plumbing and air conditioning services. Our mission is to deliver premium results for all our customers, ensuring their home appliances are always in working order. With over 27 years of experience in heating & cooling units, gas appliance repair, and residential and commercial kitchen appliance maintenance, our expert technician Ian Scott leads a team dedicated to excellence. We specialize in split system air conditioning installation, maintenance, and repair; gas fitting; and commercial kitchen appliance service & repair. Our commitment to professionalism, care for clients, and continuous technical training ensures we meet the highest standards in the industry.\n\n**"
    }
  }
}