{
  "business_3": {
    "businessId": "ChIJnY_TM3J71ocRZtnhY8PNkiE",
    "businessName": "Wyatt Brothers Plumbing & Remodel",
    "reviewLink": "https://search.google.com/local/reviews?placeid=ChIJnY_TM3J71ocRZtnhY8PNkiE&q=plumber,+72412,+Beech+Grove,+AR,+US&authuser=0&hl=en&gl=US",
    "reviews": {
      "r1": {
        "name": "Jewell Elise",
        "text": "Couldn?t get anyone to come out same day to fix a leaky kitchen sink. Richard came out within the hour. He was very knowledgeable and took the time to show me where the leak was coming from. I had a question about my jacuzzi tub. He took a look and found another leak. Both were fixed within an hour. Would use him again."
      },
      "r2": {
        "name": "Tina Kain",
        "text": "Had my water heater replaced this weekend. He was willing to work with my warranty. I didn't have to do anything also worked with my crazy schedule.Very nice and professionalHad issues with water heater, received quick service and excellent recommendations to help resolve the issue! I would recommend Wyatt Bros and will continue to use this service for future!This company is awesome! I had a major plumbing problem. Mr. Wyatt responded an hour after I called him. It took his crew two days to fix, and he was very professional and very affordable. He not only fixed the problem, but came back to check to make sure everything was as it should be! Mr Wyatt will be my go to plumber in the future. I am forever grateful for their professionalism!"
      },
      "r3": {
        "name": "Josh Morss",
        "text": "Great customers service with Richard and his nephew. I called them due to a back flow being stopped up they came out and worked  to get the job done. Thank you both.T. Ray Sufczynski (raysuf)T. Ray Sufczynski (raysuf)I had called a couple of plumbers in the area and no one ever responded except Wyatt Brothers Plumbing. They showed up within the same day to look at my leaking exterior faucets and we?re back within days to complete the repairs. They ended ?More"
      },
      "r4": {
        "name": "Bradner Wood",
        "text": "I called and immediately connected with Richard Wyatt of Wyatt Brothers Plumbing and Remodeling.  My wife and I were concerned about an outside faucet.  He listened, we went over the best resolution, and then he quickly resolved.  Then showed me what to expect upon turning the water off, e.g. water will run a little before line is empty.  Personable, professional, and affordable.  My wife and I are veterans and received a discount.  We recommend highly.Responsiveness, Punctuality, Quality, Professionalism, ValueOutdoor plumbing system repair"
      },
      "r5": {
        "name": "Douglas Maglothin",
        "text": "Richard was fast and professional. He even took the time to work through a warranty issue on a new dishwasher for us and made certain that everything was done well before wrapping-up. Wyatt Bros is definitely the best around!"
      },
      "r6": {
        "name": "Brett Bozone",
        "text": "Wyatt plumbing is fantastic. True professional and has been to my house multiple times to repair things. Also does a great military discount for veterans/military personnel. Will be using them for all my plumbing needs!!"
      },
      "r7": {
        "name": "Demetra Morton",
        "text": "I had David Wyatt to install a new water line from my sink to my new refrigerator, great job on time and a little cheaper than he quoted. I don?t have enough praise for this company, would most definitely recommend Wyatt Bros Plumbing to anyone, a friend of mine recommended him great jobResponsiveness, Punctuality, Quality, Professionalism"
      },
      "r8": {
        "name": "Connie Jordan",
        "text": "Very professional on how he took care of our problem. A price was quoted and that was what it cost. We would highly recommend this company and will call on him again if another plumbing problem arises."
      },
      "r9": {
        "name": "Kay Keller",
        "text": "When I called to place a repair report, Richard Wyatt called, left a text, and also sent an email that same day! He repaired both of my plumbing problems the next day in timely manner. He was so very professional, courteous and honest that I?m using his services to repair damage in the ceiling from a previous leak. The quote was very reasonable. I highly recommend the Wyatt Brothers.Thank you Richard, Elisabeth Keller."
      },
      "r10": {
        "name": "Dale Noe",
        "text": "Richard was amazing. He heard about my need through a mutual friend. Took the time to reach out on a Sunday and showed back up on Monday to complete the work. He was fast, courteous, professional, and affordable. Overall, an excellent experience.Responsiveness, Punctuality, Quality, ProfessionalismPlumbing pipe repair, Faucet repair, Faucet installation, Plumbing leak repair"
      },
      "r11": {
        "name": "Samantha Smith",
        "text": "Very professional and timely. Answered my call even though he was busy and even came to remove and replace our water heater the next day. Will definitely give him a call any time we have issues with plumbing ?MoreGreat guys to work with. We have had 2 water heaters put in with them, sink , dishwasher, commode and faucet. Also fixed main drain line in house. I own my own company they do lots of work for my clients . Trustworthy and do  the job in a timely manner.Responsiveness, Punctuality, Quality, Professionalism, Value"
      },
      "r12": {
        "name": "Kaley Russell",
        "text": "Had a new tub surround installed, shower head, garbage disposal hookup, drier plug in outlet installed,  and a new kitchen faucet within the last month and everything has turned out perfectly! Next a dishwasher installation. Thank you so much, will continue to do business with you for sure!Responsiveness, Punctuality, Quality, Professionalism, Value"
      },
      "r13": {
        "name": "Olivia Mafnas",
        "text": "Highly recommend for any plumbing needs. They were very responsive and easy to work with. Super nice and reasonably priced. They will always be my go-to place from here on out!Responsiveness, Punctuality, Quality, Professionalism, ValueWater heater installation, Water heater repair"
      },
      "r14": {
        "name": "Kier Heyl",
        "text": "Excellent service and communication. Have had two jobs done now. They completely re-plumbed my house, and they've closed in my garage and made it an addition to my house. Both jobs were done quickly, and at or under budget! Would highly recommend them to anyone."
      },
      "r15": {
        "name": "John Posey",
        "text": "Called and came out on a Saturday and took care of me. Gave me a veteran?s discount as well. Ive used him before and always satisfied with his job, and he?ll get my business in the future as well. Thanks Richard!"
      },
      "r16": {
        "name": "Sylvia Hinson",
        "text": "He worked on it just about all day but was determined to fix it before he left . It was one tough clog but they got it...they were very polite.he told me if he didn't fix it he would not charge me except for supplies he had to buy....and they were very reasonable on price...The technician were very friendly and professional. The cost is up there,but that being said good work and experience comes with price, definitely my plumbers if I need any in the future."
      },
      "r17": {
        "name": "Robin Peavler",
        "text": "Richard went above and beyond for me. He and his staff did a great job. Yes, I would highly recommend him. Thank you againResponsiveness, Punctuality, Quality, Professionalism, ValueWater heater installationI have used Wyatt Brothers Plumbing and they are very prompt and knowledgeable. My problem was fixed quickly and the customer service was pretty good too! I would definitely recommend.Very professional and honest, will do what others don?t want to do, and will go out of their way to make sure the customer is pleased with their, work. Very punctual also, talked to him for the first time ever on a Tuesday evening, next morning he was over here replacing it!Responsiveness, Punctuality, Quality, Professionalism, ValueWater heater installation, General repairs"
      },
      "r18": {
        "name": "Lori Holland",
        "text": "This company is awesome!! Had to replace a rotten pipe and even done it on Christmas Eve!  Very professional and fast. Thank you so much for taking care of me!!Responsiveness, Punctuality, Quality, Professionalism, Value"
      },
      "r19": {
        "name": "Jordan Roddenberry",
        "text": "They are always quick to help & do a great job! We?ve had several projects from kitchen to bathroom done by them!"
      },
      "r20": {
        "name": "Greg Lawson",
        "text": "Very nice person Did an extremely good job if I have a plumbing problem, I will use them againPunctuality, Quality, Professionalism"
      },
      "r21": {
        "name": "Sherry Dowless",
        "text": "I called after waiting on roto rooter for 30 hours, he came right over and had the problem fixed in a couple hours. Will be my first call from now on.Responsiveness, Professionalism, Value"
      },
      "r22": {
        "name": "Brandon Powers",
        "text": "These guys fixed our issue quickly and properly. They were also nothing but nice to us. I will use them again in the future. Excellent service."
      }
    },
    "details": {
      "logo": "https://lh3.googleusercontent.com/p/AF1QipPfofqr5L-Vgtwha0K9QdB8kQFvT-257lz_Jn25=s680-w680-h510",
      "hero1": "https://lh3.googleusercontent.com/p/AF1QipMHyOJG4SNfW3SJ8S4tDcuUJBF_3qGDluUZeAGl=s680-w680-h510",
      "hero2": "https://lh3.googleusercontent.com/p/AF1QipM754IGFTjf38V7LIKIfYzJzhF5DaDxWkqljApD=s680-w680-h510",
      "about": "",
      "phone": "+1 870-393-6786",
      "address": "1816 Countryside Ln, Paragould, Arkansas 72450",
      "city": "Paragould",
      "state": "Arkansas",
      "zipCode": 72450,
      "rating": 4.4,
      "reviewsCount": 51,
      "workingHours": "{\"Monday\": \"8AM-5PM\", \"Tuesday\": \"8AM-5PM\", \"Wednesday\": \"8AM-5PM\", \"Thursday\": \"8AM-5PM\", \"Friday\": \"8AM-5PM\", \"Saturday\": \"8AM-5PM\", \"Sunday\": \"8AM-5PM\"}"
    }
  }
}