{
  "siteConfigs": {
    "site1": {
      "businessName": "Elite Plumbing Pros",
      "phone": "555-123-4567",
      "email": "service@eliteplumbing.com",
      "logo": "https://lh5.googleusercontent.com/p/AF1QipNoYs67r9VCIZhQ4NlHVJujn4lfdCnMyMSPencZ=w231-h289-n-k-no-nu",
      "heroImages": [
        {
          "imageUrl": "https://lh3.googleusercontent.com/p/AF1QipNCqUaJRGvLKJ_36zCGjqksEQ9gL9Vwzf-sBlqR=s3840-w3840-h1918-rw",
          "text": "<strong>Elite Plumbing Pros</strong> - Your trusted plumbing experts in <strong>Phoenix</strong>"
        },
        {
          "imageUrl": "https://lh3.googleusercontent.com/p/AF1QipNCqUaJRGvLKJ_36zCGjqksEQ9gL9Vwzf-sBlqR=s3840-w3840-h1918-rw",
          "text": "24/7 Emergency Services by <strong>Elite Plumbing Pros</strong>. Call Now!"
        }
      ],
      "primaryColor": "#1a3c78",
      "accentColor": "#ffd700",
      "reviewLink": "https://g.page/r/elite",
      "rating": "4.9",
      "reviewCount": "203",
      "city": "Phoenix",
      "state": "AZ",
      "street": "2500 N Central Ave",
      "zip": "85004",
      "reviews": [
        {
          "name": "Michael R.",
          "rating": 5,
          "text": "Elite Plumbing Pros saved us during a late-night emergency. Their technician arrived within 30 minutes and fixed our burst pipe."
        },
        {
          "name": "Sarah K.",
          "rating": 5,
          "text": "Best plumbing service in Phoenix! Fair prices and excellent work quality."
        },
        {
          "name": "James T.",
          "rating": 4.8,
          "text": "Very reliable service. Had them fix multiple issues in our older home."
        }
      ]
    },
    "site2": {
      "businessName": "Precision Plumbing Solutions",
      "phone": "555-789-1234",
      "email": "info@precisionplumbing.com",
      "logo": "https://lh5.googleusercontent.com/p/AF1QipOZblUToE57sFpI4pU8ZZktwq9uQSxlTLgAndw=w231-h165-n-k-no-nu",
      "heroImages": [
        {
          "imageUrl": "https://scontent-ssn1-1.xx.fbcdn.net/v/t39.30808-6/307558580_799424977826116_1753210543654218538_n.jpg",
          "text": "Experience excellence with <strong>Precision Plumbing Solutions</strong> in <strong>Denver</strong>"
        }
      ],
      "primaryColor": "#2c5282",
      "accentColor": "#ed8936",
      "reviewLink": "https://g.page/r/precision",
      "rating": "4.8",
      "reviewCount": "187",
      "city": "Denver",
      "state": "CO",
      "street": "789 Elm St",
      "zip": "80202",
      "reviews": [
        {
          "name": "Robert D.",
          "rating": 5,
          "text": "Precision Plumbing Solutions lived up to their name. Quick response and professional service."
        },
        {
          "name": "Emma S.",
          "rating": 4.8,
          "text": "Great experience with their water heater installation. Fair pricing."
        },
        {
          "name": "John P.",
          "rating": 4.7,
          "text": "Professional team and excellent customer service."
        },
        {
          "name": "Mary L.",
          "rating": 5,
          "text": "They fixed our emergency leak at 2 AM. Highly recommend!"
        },
        {
          "name": "David W.",
          "rating": 4.9,
          "text": "Outstanding service! They came quickly and solved our issue efficiently."
        }
      ]
    },
    "site3": {
      "businessName": "Rapid Response Plumbers",
      "phone": "555-456-7890",
      "email": "service@rapidresponse.com",
      "logo": "https://lh5.googleusercontent.com/p/AF1QipP_e6j2Ij426RUJv9yBxgpuOQKBHpRdMkoJtzo=w296-h168-n-k-no",
      "heroImages": [
        {
          "imageUrl": "https://lh3.googleusercontent.com/p/AF1QipNCqUaJRGvLKJ_36zCGjqksEQ9gL9Vwzf-sBlqR=s3840-w3840-h1918-rw",
          "text": "<strong>Rapid Response Plumbers</strong> - Available 24/7 in <strong>Austin</strong>"
        }
      ],
      "primaryColor": "#2F855A",
      "accentColor": "#F6AD55",
      "reviewLink": "https://g.page/r/rapid",
      "rating": "4.7",
      "reviewCount": "156",
      "city": "Austin",
      "state": "TX",
      "street": "1234 South Congress",
      "zip": "78704",
      "reviews": [
        {
          "name": "Thomas K.",
          "rating": 4.8,
          "text": "Fast service, very professional. Had my issue fixed within an hour."
        },
        {
          "name": "Jennifer L.",
          "rating": 5,
          "text": "Best plumbing service I've used in Austin. Reasonable prices too!"
        }
      ]
    },
    "site38": {
      "businessName": "Anything Plumbing",
      "phone": "+1 256-684-9601",
      "street": "3229 Maysville Rd NE",
      "city": "Huntsville",
      "state": "Alabama",
      "zip": 35811,
      "reviewLink": "https://search.google.com/local/reviews?placeid=ChIJq6qqqnoMYogRj1ivk0BVK7M&q=plumber,+35615,+Belle+Mina,+AL,+US&authuser=0&hl=en&gl=US",
      "rating": 4.9,
      "reviewCount": 62,
      "heroImages": [
        {
          "imageUrl": "https://lh5.googleusercontent.com/p/AF1QipM0WmFubjtx22UlsdwSVQd-x-AiuwAbrJ1eADFG=w141-h235-n-k-no-nu",
          "text": "**Anything Plumbing** - Reliable plumbing services for Huntsville and surrounding areas."
        },
        {
          "imageUrl": "https://lh3.googleusercontent.com/p/AF1QipNUh7oTYY92jUUPSEHbryOlbdee5dR4lF2T3biA=s680-w680-h510",
          "text": "Round-the-clock plumbing help from **Anything Plumbing**. Contact us today!"
        }
      ],
      "logo": ""
    },
    "site57": {
      "businessName": "Pickle Septic Tank and Plumbing",
      "reviewLink": "https://search.google.com/local/reviews?placeid=ChIJT5nx4LIGiYgRTU1qzEcrars&q=plumber,+35181,+Watson,+AL,+US&authuser=0&hl=en&gl=US",
      "reviews": []
    },
    "site79": {
      "businessName": "Evans Plumbing and Drain Service, Inc.",
      "phone": "+1 251-645-3810",
      "street": "8850 Broadus Loop Rd",
      "city": "Eight Mile",
      "state": "Alabama",
      "zip": 36613,
      "reviewLink": "https://search.google.com/local/reviews?placeid=ChIJUa3fYmSpm4gRVe10yrKmAtU&q=plumber,+36521,+Chunchula,+AL,+US&authuser=0&hl=en&gl=US",
      "rating": 3.8,
      "reviewCount": 35,
      "heroImages": [
        {
          "imageUrl": "",
          "text": "Evans Plumbing and Drain Service, Inc. - Trusted plumbing in Eight Mile"
        },
        {
          "imageUrl": "",
          "text": "24/7 Emergency Services by Evans Plumbing and Drain Service, Inc.. Call now!"
        }
      ],
      "logo": "",
      "reviews": [
        {
          "name": "Evans Plumbing and Drain Service, Inc.",
          "rating": 5,
          "text": "Russell Hammontree\n3 reviews?5 photos\n2 weeks agoNew\nI posted a request for a local plumber for an RV Leak . Most residential businesses shy away from this because of the aggregation and difference between RV and residential .\n5 minutes after my post I got a call from Evans Plumbing . I was told that they could help me out ? sometime ? after lunch\nI realized that they were busy and already doing other scheduled projects . I was told they would be able to help me sometime after lunch . Well . Got a call at 5:30 pm  , Nick , with Evans Plumbing is at my driveway gate .  ?  What , ??  I used to own my own construction business , by 5:30pm I wanted to be at home with my family ( and beer ) .\nHe started the project and refused to stop and make a return visit the next day ! Extremely a professional attitude ! And much more patience with confined space and aggravating work situations than I have !\nHe took care of the problem and did an excellent job !!\nI highly recommend EVANS PLUMBING !!!\nLike\nRachel Leard\nRachel Leard\n5 reviews\n4 months ago\nSuper, super nice guys. When I called, the gentleman who answered the phone answered all of my (crazy) questions with uncomplicated answers, and was very helpful! Prompt response time and had the job done in less than an hour!\nLike\nRussell Hawes\nRussell Hawes\n6 reviews\n2 months ago\nSuper professionals . Solved a problem that another plumber wouldn?t tackle .  Completed two major jobs for me . Fairly priced for the work involved .\nLike\nLauren Taylor\nLauren Taylor\n5 reviews\n8 months ago\nI?m blown away by the customer service and immediate response time of Evan?s Plumbing!\nAaron, that came out to the house, was not only very helpful and informative, but saved me lots of money compared to previous quotes!\nI recommend this company above all other plumbing companies in Mobile County!!!\n1\nDonnashirleyedmonds\nDonnashirleyedmonds\n2 reviews\n7 months ago\nThe service was good by Aaron and Hunter May 16th 2024 Kitchen leak was repaired and so far it is very stable I appreciate their Kindness and Intelligence doing such a great job\nThanks very much\nFor your service\nDonna Burnham ?\n1\nKyle Neighbors\nKyle Neighbors\n31 reviews?1 photo\na year ago\nWe had a leak, and we needed them right away. I called, and they came in 15 minutes. They were knowledgeable, courteous, and pleasant. The job was done quickly and correctly. They cleaned up and left it better than when they got here. I?d use them again.\nLike\nJ.D. Garris\nJ.D. Garris\n27 reviews?3 photos\n2 years ago\nEvan's has been out to our rural home a few times in the past few years. As a well experienced professional service man myself in another trade, this company has met industry standards with prompt and professional service with reasonable pricing, while still maintaining a personal, local experience.\n1\nKimberly Miller\nKimberly Miller\n9 reviews?4 photos\n3 years ago\nThey came out on a Sunday night during super bowl to help fix our pipe.  Super nice and didn't seem to mind the little ones being nosey.  They will be my new people to call for any plumbing work.  Definitely recommend them.\nPositive\nResponsiveness, Punctuality, Quality, Professionalism, Value\n\nServices\nPlumbing pipe repair\n3\nHeather Colson\nHeather Colson\n3 reviews?3 photos\n11 months ago\nGreat service!! Professional, timely, reasonable and did a great job!! Will definitely be using this company again! Thanks so much for all the help!"
        }
      ]
    },
    "site23": {
      "businessName": "Harris Plumbing & Electric",
      "reviewLink": "https://search.google.com/local/reviews?placeid=ChIJx4dj9E2Ri4gRyDgyHZ67PFI&q=plumber,+36251,+Ashland,+AL,+US&authuser=0&hl=en&gl=US",
      "reviews": [
        {
          "name": "Wendy Wilson",
          "rating": 5,
          "text": "5 reviews 6 months ago I had a terrible leak in my home and it caused the plumber to have to cut holes in the ceiling and walls in order to locate the leak.  The water damaged my upstairs and downstairs flooring.  I called Jay's and not only did they jump right in to help, they completed this complex job in just a week.  They also worked with the Insurance company on my behalf for my claim.  They did a Great Job!!!!  My house looks great.  They even removed the popcorn texture in my Dining room and Kitchen and it looks awesome.  I recommend them to anyone that needs their help in water damage repair or any other repairs or improvements.  They also Really care for their customers.  Thanks to Jay's Home Improvement for making my home livable again! Like Simone Ali Simone Ali 2 years ago I desperately wanted a nice outdoor space to sit out and relax without all the that the south has to offer. And when I tell y?all they did an amazing job. I am sooo happy with their service. I?d hire them again in a heartbeat and recommend them to anyone looking to remodel or better their space. 10/10. The enclosed my space installed a light and fan and worked so proficiently. I mean just look at how beautiful it is!! Positive Responsiveness, Punctuality, Quality, Professionalism, Value"
        },
        {
          "name": "Services",
          "rating": 5,
          "text": "Fan installation, Deck construction, Exterior structural repairs, Foundation pouring, Remodeling, Roof installation, Home addition construction, Concrete pouring, Patio construction 2 Terry Minor Terry Minor 7 reviews a year ago Jay and his crew fully renovated a home for a family member of mine! My wife and I oversaw the project. They were professional, timely, business oriented, receptive to our needs, and did an outstanding job! Jay was very prompt with his replies by email or text. I highly recommend them! 1 Response from the owner9 months ago Than you Janet Janet 1 review 10 months ago Jay did a wonderful job on my floors.  I had a flood in my entire home and he jumped in  and got my job done very quick and it looks beautiful!  Thank you, Jay for a job well done!  I really appreciate you! 1 Response from the owner9 months ago Thank you Miss Janet, and if you need anything else please don't hesitate to give us a call Gloria Foster Gloria Foster 1 review a year ago Jay's Home Improvement renovated my whole house. Walls, floors, completed a bathroom with walk-in tub, tile floors, toilet, cabinets, shelves, all electrical, plumbing, installed heaters, light fixtures, ceiling fans, hardware, ice maker, windows, waterline. They were even nice enough nice enough to install me window blinds. They're very respectful young men and traveled to Florence for Huntsville. Highly recommended"
        }
      ]
    },
    "site25": {
      "businessName": "Williams Air Conditioning & Refrigeration",
      "reviewLink": "https://search.google.com/local/reviews?placeid=ChIJ902lX5IIYogRFWzqhKzGMEU&q=plumber,+35760,+New+Hope,+AL,+US&authuser=0&hl=en&gl=US",
      "reviews": [
        {
          "name": "Heather",
          "rating": 5,
          "text": "5 reviews 9 months ago We have always been able to count on Marty Williams for our hvac needs - from repairing our old system, to installing our new system, and even coming out to our home after the ice storm when our downstairs furnace stopped working in frigid weather.  Marty got us on the schedule lightning fast for spring maintenance. Aaron came out today, thoroughly checked our systems, and answered all my questions. He was very kind. Marty is also a super nice guy and very honest. We're thankful we found Williams Air! Like J M J M 9 months ago Williams Air Conditioning & Refrigeration always does prompt and professional work at fair and reasonable prices.   Marty and his team have done work for me personally at my home and at my rental property. Highly recommend! Like Virginia Smith Virginia Smith Local Guide?401 reviews?113 photos 6 months ago Very professional. On time and delivered excellent service with an outstanding crew.  Cleaned up afterwards,  took precautions to keep my home clean, put up with the dogs and kids. Would recommend! Like Dan Luther Dan Luther 3 reviews 11 months ago Referred by our realtor to Marty and he really helped us out  - couldn't get our gas heat going in older home we purchased that had been sitting vacant for a while.  Saved me a service call by talking me through how to turn on gas at meter - honest guy, will definitely remember him for all future HVAC needs! Like Benjamin Winslett Benjamin Winslett 24 reviews a year ago We use them at my home and at church and they are always prompt, professional, and their prices are very reasonable. Services HVAC system maintenance, HVAC duct & vent repair, Repair HVAC"
        }
      ]
    },
    "site27": {
      "businessName": "Highland Home Hardware",
      "reviewLink": "https://search.google.com/local/reviews?placeid=ChIJ6wr6y8N0jogRvmDbGSxlX5Q&q=plumber,+36041,+Highland+Home,+AL,+US&authuser=0&hl=en&gl=US",
      "reviews": [
        {
          "name": "Mellisa Frison",
          "rating": 5,
          "text": "Local Guide?117 reviews?5 photos a year ago Bought puppy wormer. They were educated on what I needed for my puppies. I did need some all in one shots as well, but they were out of stock at the time. I would Def. Recommend they keep things like this in stock and in date to continue good business. Great service. Reasonable prices. Like George Ingols George Ingols Local Guide?294 reviews 3 years ago Nice friendly couple running the store.  Fixed me up with the parts I needed to finish installing a car battery. While I'm the store I asked about deer corn prices.  They are over $10. cheaper for the six bags l need per feeder refill than what I paid in Montgomery, will help you load it and are open longer hours!  Definitely going back there. Like judy garrett judy garrett Local Guide?193 reviews?17 photos 4 years ago Young gentleman Gary courteous and helpful. Needed 2 bolts for car tag. There were none in stock. He mentioned he had one in his truck he would give me. Offered to pay him, he politely declined. Like Albert M. Albert M. 5 years ago I've been a regular customer since this hardware was first opened and I've always been very satisfied with the owners and their inventory. They have pretty much any and everything u need and if they don't they will try to find what u need and have it for you asap if must. I recommend their business to anyone I come into contact with who wants to know where to find any kind of hardware. Home town people with a home town business is what Highland Home Hardware is and that should be all that's needed to be told here! Doesn't take a genius to figure it out so go visit their store for your home and garden needs people! 2 David Hinds David Hinds 10 reviews 8 months ago They're doing better. They say they got a new owner and they restocking the store"
        }
      ]
    }
  }
}