{
  "siteConfigs": {
    "sellers-services-llc": {
      "business name": "Sellers Services LLC",
      "extra_info": "- **Licenses and Certifications:** Sellers Services LLC holds a license number MP-4353 issued by the State of Alabama Plumbers & Gas Fitters Examining Board, ensuring compliance with local regulations and industry standards[3].\n- **Business Entity:** Sellers Services LLC operates as a Florida Limited Liability Company (LLC), providing protection for personal assets and adding an extra layer of professionalism to the business[5].\n- **Customer Focus:** We emphasize personal connections with our customers, reflecting in our personalized communication and service delivery. This approach helps build trust and loyalty, making every interaction meaningful and memorable."
    },
    "all-american-faucet-parts": {
      "business name": "All American Faucet Parts",
      "extra_info": "- **Business Type**: Hardware and Plumbing and Heating Equipment and Supplies Merchant Wholesalers[1].\n- **Location**: 652 Holcombe Ave, Mobile, AL 36606, US[5].\n- **Family-Owned Business**: A-2-Z Faucet Parts, which includes All American Faucet Parts, is a family-owned business dedicated to serving the community with reliable plumbing solutions[5]."
    },
    "angel-plumbing-company": {
      "business name": "Angel Plumbing Company",
      "extra_info": "**\n- **Location:** Angel Plumbing Company has multiple locations, including North Hollywood, CA, and Fridley, MN. The company in North Hollywood is located at 5414 Cahuenga Blvd, North Hollywood, CA 91601-2917 [1].\n- **Services:** They offer a wide range of plumbing services including remodels, repairs, and new installations. They also carry major brands of plumbing fixtures and water heaters [2].\n- **BBB Accreditation:** The Angel Plumbing Company in Marbury, AL is not BBB accredited, but it is important to note that this does not necessarily reflect the quality of their services [4].\n- **Customer Discounts:** Some locations offer special discounts for veterans and active-duty military personnel [2]."
    },
    "red-bay-ace-hardware": {
      "business name": "Red Bay Ace Hardware",
      "extra_info": "- **Store Hours:** Monday to Thursday: 7:00 AM - 8:00 PM, Friday and Saturday: 7:00 AM - 9:00 PM, Sunday: 11:30 AM - 8:00 PM.\n- **Contact Information:** Phone (256) 356-4406, Email [email protected].\n- **Services:** Free assembly and delivery on grills $399+ for Ace Rewards members at participating locations.\n- **Product Range:** From hand and power tools to home supplies and specialty hardware, we offer a vast selection of products to tackle any project.\n- **Community Involvement:** As part of the Ace Hardware network, we are committed to being a part of our community and providing helpful services to our neighbors."
    },
    "apex-plumbing-llc": {
      "business name": "APEX Plumbing, LLC",
      "extra_info": "**\n- **Services:** We offer a wide range of residential and commercial plumbing services, including water heater replacement, fixture replacement, leak repair, pipe repair and replacement, toilet repair and replacement, and more. Additionally, we specialize in remodeling and new construction projects to meet all your plumbing needs.\n- **Salaries:** The average hourly pay for our team members ranges from approximately $17.76 per hour for Apprentice Plumber to $31.46 per hour for Excavator Operator[4].\n- **Customer Reviews:** Our clients have praised us for our professionalism and reliability, with many expressing their willingness to hire us again in the future[1]."
    },
    "mpe-services": {
      "business name": "MPE Services",
      "extra_info": "**\n\n- **Locations:** MPE Services operates in multiple locations across Alabama, including Florence, Russellville, Madison, Birmingham, and Athens. This extensive coverage allows us to serve a wide range of residential and commercial clients effectively.\n- **Services:** Our services include HVAC repair and maintenance, full-service electrical services, and comprehensive plumbing solutions. This includes air conditioning repair, heating system maintenance, LED lighting retrofits, drain unclogging, leak repair, and installations of new fixtures.\n- **Customer Focus:** We prioritize excellent customer service, attention to detail, and taking care of our clients as if they were part of our own family. Our goal is to ensure that every client feels confident and comfortable operating their systems after our service.\n- **Hiring Opportunities:** MPE Services is actively hiring skilled technicians in the North Alabama area. We offer on-the-job training and over 40 years of experience in the trade, providing a meaningful career path for those interested in building trade skills.\n- **Contact Information:** For service requests or inquiries, you can contact MPE Services at [COMPANY PHONE NUMBER]. Our team is ready to assist you with any of your HVAC, electrical, or plumbing needs."
    },
    "huntsville-plumbing-inc": {
      "business name": "Huntsville Plumbing Inc",
      "extra_info": "- **Accreditation and Experience:** Huntsville Plumbing, Inc. has been BBB accredited since August 27, 2012, and has been serving the community for over two decades.\n- **Service Area:** We primarily serve the Madison, AL area but are known to provide reliable services in parts of Tennessee and Kentucky as well.\n- **Certified Technicians:** Our family-owned and operated business ensures that every job is done right the first time by certified professional technicians.\n- **Customer Satisfaction:** We pride ourselves on our friendly service and 100% satisfaction guarantee, making us a trusted name in the plumbing industry.\n\nFor more information or to schedule a service, you can contact us at 1256-461-4470 or visit our website."
    }
  }
}