{
  "siteConfigs": {
    "sellers-services-llc": {
      "business name": "Sellers Services LLC",
      "extra_info": "- **Licenses and Certifications:** Sellers Services LLC holds a license number MP-4353 issued by the State of Alabama Plumbers & Gas Fitters Examining Board, ensuring compliance with local regulations and industry standards[3].\n- **Business Entity:** Sellers Services LLC operates as a Florida Limited Liability Company (LLC), providing protection for personal assets and adding an extra layer of professionalism to the business[5].\n- **Customer Focus:** We emphasize personal connections with our customers, reflecting in our personalized communication and service delivery. This approach helps build trust and loyalty, making every interaction meaningful and memorable."
    },
    "all-american-faucet-parts": {
      "business name": "All American Faucet Parts",
      "extra_info": "- **Business Type**: Hardware and Plumbing and Heating Equipment and Supplies Merchant Wholesalers[1].\n- **Location**: 652 Holcombe Ave, Mobile, AL 36606, US[5].\n- **Family-Owned Business**: A-2-Z Faucet Parts, which includes All American Faucet Parts, is a family-owned business dedicated to serving the community with reliable plumbing solutions[5]."
    },
    "angel-plumbing-company": {
      "business name": "Angel Plumbing Company",
      "extra_info": "**\n- **Location:** Angel Plumbing Company has multiple locations, including North Hollywood, CA, and Fridley, MN. The company in North Hollywood is located at 5414 Cahuenga Blvd, North Hollywood, CA 91601-2917 [1].\n- **Services:** They offer a wide range of plumbing services including remodels, repairs, and new installations. They also carry major brands of plumbing fixtures and water heaters [2].\n- **BBB Accreditation:** The Angel Plumbing Company in Marbury, AL is not BBB accredited, but it is important to note that this does not necessarily reflect the quality of their services [4].\n- **Customer Discounts:** Some locations offer special discounts for veterans and active-duty military personnel [2]."
    },
    "red-bay-ace-hardware": {
      "business name": "Red Bay Ace Hardware",
      "extra_info": "- **Store Hours:** Monday to Thursday: 7:00 AM - 8:00 PM, Friday and Saturday: 7:00 AM - 9:00 PM, Sunday: 11:30 AM - 8:00 PM.\n- **Contact Information:** Phone (256) 356-4406, Email [email protected].\n- **Services:** Free assembly and delivery on grills $399+ for Ace Rewards members at participating locations.\n- **Product Range:** From hand and power tools to home supplies and specialty hardware, we offer a vast selection of products to tackle any project.\n- **Community Involvement:** As part of the Ace Hardware network, we are committed to being a part of our community and providing helpful services to our neighbors."
    },
    "apex-plumbing-llc": {
      "business name": "APEX Plumbing, LLC",
      "extra_info": "**\n- **Services:** We offer a wide range of residential and commercial plumbing services, including water heater replacement, fixture replacement, leak repair, pipe repair and replacement, toilet repair and replacement, and more. Additionally, we specialize in remodeling and new construction projects to meet all your plumbing needs.\n- **Salaries:** The average hourly pay for our team members ranges from approximately $17.76 per hour for Apprentice Plumber to $31.46 per hour for Excavator Operator[4].\n- **Customer Reviews:** Our clients have praised us for our professionalism and reliability, with many expressing their willingness to hire us again in the future[1]."
    },
    "mpe-services": {
      "business name": "MPE Services",
      "extra_info": "**\n\n- **Locations:** MPE Services operates in multiple locations across Alabama, including Florence, Russellville, Madison, Birmingham, and Athens. This extensive coverage allows us to serve a wide range of residential and commercial clients effectively.\n- **Services:** Our services include HVAC repair and maintenance, full-service electrical services, and comprehensive plumbing solutions. This includes air conditioning repair, heating system maintenance, LED lighting retrofits, drain unclogging, leak repair, and installations of new fixtures.\n- **Customer Focus:** We prioritize excellent customer service, attention to detail, and taking care of our clients as if they were part of our own family. Our goal is to ensure that every client feels confident and comfortable operating their systems after our service.\n- **Hiring Opportunities:** MPE Services is actively hiring skilled technicians in the North Alabama area. We offer on-the-job training and over 40 years of experience in the trade, providing a meaningful career path for those interested in building trade skills.\n- **Contact Information:** For service requests or inquiries, you can contact MPE Services at [COMPANY PHONE NUMBER]. Our team is ready to assist you with any of your HVAC, electrical, or plumbing needs."
    },
    "huntsville-plumbing-inc": {
      "business name": "Huntsville Plumbing Inc",
      "extra_info": "- **Accreditation and Experience:** Huntsville Plumbing, Inc. has been BBB accredited since August 27, 2012, and has been serving the community for over two decades.\n- **Service Area:** We primarily serve the Madison, AL area but are known to provide reliable services in parts of Tennessee and Kentucky as well.\n- **Certified Technicians:** Our family-owned and operated business ensures that every job is done right the first time by certified professional technicians.\n- **Customer Satisfaction:** We pride ourselves on our friendly service and 100% satisfaction guarantee, making us a trusted name in the plumbing industry.\n\nFor more information or to schedule a service, you can contact us at 1256-461-4470 or visit our website."
    },
    "bear-plumbing-llc": {
      "business name": "Bear Plumbing, LLC",
      "extra_info": "- **Areas Served:** Chelsea, Leeds, Meadowbrook, Sterrett, Vandiver, Westover\n- **Contact Information:** (205) 569-1495, Vandiver, AL 35176\n- **Services Provided:** Water Heaters, Plumbing Remodels, Faucet Leak Repairs, Water Service Lines, Sewer Repairs\n- **Customer Satisfaction:** Known for fast turnaround times and reliable warranties.\n- **Community Focus:** We are community builders who strive to deliver quality work day after day.\n\nFor more information or to schedule a service, you can visit our website or contact us directly."
    },
    "baine-services": {
      "business name": "Baine Services",
      "extra_info": "**\n- **Location:** 104 Cascade Drive, Athens, AL 35611-2214\n- **Contact Information:** Phone: +1 (256) 434-6180\n- **Years in Business:** 26 years\n- **BBB Profile:** Baine Services has been listed on the Better Business Bureau since December 12, 2017, reflecting their commitment to ethical business practices and customer satisfaction[5]."
    },
    "boydstun-plumbing-llc": {
      "business name": "Boydstun Plumbing LLC",
      "extra_info": "- **BBB Accreditation**: Boydstun Plumbing LLC is accredited by the Better Business Bureau serving North Alabama, reflecting our commitment to ethical business practices and customer satisfaction.\n- **Certified Professionals**: Our plumbers are certified and licensed to handle a wide range of plumbing services, ensuring that all work meets local codes and standards.\n- **Customer Reviews**: We have received positive reviews from satisfied customers who appreciate our prompt service and transparent pricing. For example, on HomeAdvisor, customers have praised us for our excellent service and competitive prices[4]."
    },
    "barnett-plumbing-llc": {
      "business name": "Barnett Plumbing, LLC",
      "extra_info": "- **Location:** 875 Sweetwater Ave, Florence, AL 35630-2881\n- **Contact Information:** Phone (256) 740-6776, Fax (256) 740-6612\n- **Accreditation:** BBB Accredited since May 17, 2016\n- **Licensing:** Licensed by the Alabama Licensing Board for General Contractors (License Number: S-47612)\n- **Years in Business:** 30 years\n- **Customer Service:** Available for free inspections and consultations to help prevent plumbing problems and save money with access to rebates on certain products."
    },
    "fussell-plumbing": {
      "business name": "Fussell Plumbing",
      "extra_info": "**\n- **Location:** Franklinton, Louisiana\n- **Services:** Water treatment system installation and repair, plumbing services\n- **Contact Information:** Available upon request (Bizapedia search results indicate Ronald Fussell as the Registered Agent, but specific contact details are not provided in the sources)[4]."
    },
    "jason-s-drain-service": {
      "business name": "Jason's Drain Service",
      "extra_info": "- **Location:** 2010 Mountainbrook Dr, Cottondale, AL 35453\n- **Contact Information:** (205) 764-8182\n- **Services:**\n  - Drain Opening\n  - Drain Repair\n  - Emergency Service\n  - Fixing Leaks\n  - Garbage Disposal Installation\n  - Gas Line Installation\n  - Heating & Cooling Services\n  - Hot Water Heater Installation\n  - Industrial Plumbing\n  - Insured and Licensed Services\n  - Sewage Line Repair\n  - Sewer System Maintenance\n  - Slow Drain Fixing\n  - Ventilation System Installation\n- **Customer Reviews:** 94% of customers have given us a 5-star rating, highlighting our professionalism, promptness, and value for money. [1]"
    },
    "ard-s-plumbing-and-electric": {
      "business name": "Ard's Plumbing and Electric",
      "extra_info": "- **Location:** 621 Panther Rd, Newton, AL 36352-8106, United States.\n- **Services:** Plumbing and electrical services for residential and commercial clients.\n- **BBB Accreditation:** Not BBB accredited (source: Better Business Bureau).\n- **Reviews:** Available on the Better Business Bureau website, where customers can read reviews and complaints about the company's services."
    },
    "salser-plumbing-and-septic-service-llc": {
      "business name": "Salser Plumbing and Septic Service, LLC",
      "extra_info": "**\n- **License:** Robert Caiden Salser holds a Plumber license according to the Alabama license board [4].\n- **Services:** Salser Plumbing offers a range of services including plumbing repairs, gas fitting, and septic tank services such as pumping, repairs, replacements, and full system installations [1].\n- **Customer Reviews:** Salser Plumbing has received positive reviews for its prompt and professional service, with customers praising the quick turnaround time and reasonable prices [1].\n- **Location:** The company serves the Vincent area and surrounding communities, including Chelsea, where they offer septic tank pumping services for $350 [5]."
    },
    "morrison-plumbing": {
      "business name": "Morrison Plumbing",
      "extra_info": "- **Service Areas:** We serve Caseyville, IL, and surrounding areas including Mascoutah, Freeburg, Smithton, Shiloh, Lebanon, Troy, Millstadt, New Baden, Pontoon Beach, Collinsville, Columbia, Edwardsville, Fairview Heights, Glen Carbon, Granite City, Maryville, O?Fallon, Swansea, Belleville, Highland, Godfrey, and Wood River.\n- **Services Offered:** Our comprehensive services include drain clearing, rooter service, water line repair, furnace repair, heat pump repair, heating installations, A/C repair, mini-split installations, smart thermostat installations, air quality assessments, electrical repairs, and electrical installations.\n- **Customer Satisfaction:** We guarantee 100% satisfaction with our services. If you are not completely satisfied with any of our services, let us know and we will see what we can do differently.\n- **Financing Options:** We offer financing options to help make our services more accessible.\n- **Emergency Services:** We provide 24-hour emergency plumbing services to ensure that you have access to immediate assistance when you need it most.\n- **Certifications and Experience:** With over 30 years of experience and a commitment to top-quality workmanship, personable customer service, and competitive pricing, Morrison Plumbing is your reliable choice for all your plumbing needs."
    },
    "h2o-worx": {
      "business name": "H2O Worx",
      "extra_info": "- **Available Positions:** \n  - **CDL Driver:** We are seeking qualified applicants for the full-time CDL Driver position. This role is responsible for a variety of activities related to the company?s overall success, including driving vehicles with a Gross Vehicle Weight (GVW) over 26,000 lbs., pulling and moving various trailers, and ensuring contents are properly secured in a truck/flatbed to prevent damage/injury. The salary range for this position is $23.00 - $28.00 per hour.\n  - **Underground Crewman III:** This full-time position involves day-to-day preventive maintenance of tools, equipment, and fleet vehicles. Responsibilities include planning, coordinating, and completing projects based on operational and project needs, instructing and supervising crew members, and maintaining effective working relationships with those contacted in the course of work. The position requires a valid North Carolina Class A driver's license with a satisfactory driving record and OSHA Competent Person certification.\n\nFor more information on available positions and how to apply, please visit our careers page at [Water Worx Inc. Careers](https://www.waterworxinc.com/careers/)."
    },
    "poe-s-services": {
      "business name": "Poe's services",
      "extra_info": "**\n- **Location:** 8088 AL-155, Montevallo, AL 35115\n- **Contact:** Phone: 205-997-1858\n- **Specialties:** Maintenance services\n- **Reviews:** Poe's Services has received 13 reviews, with a strong reputation among locals for their professional and reliable work. [3]"
    },
    "hydrotech-plumbing-llc": {
      "business name": "HydroTech Plumbing LLC",
      "extra_info": "#### Services Provided\n- Bathroom Remodeling\n- Bathtub Installation\n- Bathtub Repair\n- Drain Cleaning\n- Emergency Plumbing\n- Faucet Installation\n- Faucet Repair\n- Frozen Pipe Repair\n- Garbage Disposal Installation\n- Garbage Disposal Repair\n- Plumbing Inspection\n- Plumbing Repair\n- Sauna Installation\n- Sewer Cleaning\n- Sewer Line Repair\n- Sump Pump Installation\n- Sump Pump Repair\n- Tankless Water Heater Installation\n- Tankless Water Heater Repair\n- Toilet Installation\n- Toilet Repair\n- Water Heater Installation\n- Water Heater Repair\n- Water Main Installation\n- Water Main Repair\n- Water Softener Installation\n- Water Softener Repair\n- Water Well Repair\n- Well Pump Installation\n\n#### Areas Served\n- Broken Arrow\n- Jenks\n- Oakhurst\n- Owasso\n- Sand Springs\n- Sapulpa\n- Tulsa\n\n#### Contact Information\n- Phone Number: (918) 740-1916\n- Address: Tulsa, Oklahoma, United States"
    },
    "strickland-plumbing-maintenance": {
      "business name": "Strickland Plumbing & Maintenance",
      "extra_info": "- **History and Growth**: Strickland Plumbing & HVAC, Inc. was established with a customer-focused approach. Over the years, we have invested in training, tools, and technologies to expand our offerings and grow our team of experienced professionals. Our commitment to excellence has led us to become a pillar in the community, contributing positively through exceptional service and local initiatives [4].\n  \n- **Specialized Services**: We offer specialized services in small-scale refrigeration, catering to businesses requiring precise cooling solutions. Our services include comprehensive commercial ice machine maintenance, walk-in cooler maintenance, and retail display case refrigeration [2].\n\n- **Meet the Team**: Our team consists of skilled technicians who are proficient in servicing a wide array of refrigeration equipment and plumbing systems. They are dedicated to providing swift and effective solutions to urgent problems, ensuring that your emergency doesn't turn into a disaster [1] and [5]."
    },
    "cobb-underground-llc": {
      "business name": "Cobb Underground, LLC",
      "extra_info": "- **Location**: 183 Airpark Industrial Rd, Alabaster, AL 35007-9583\n- **Contact Information**: (205) 438-1711\n- **Services**: Directional Drilling, Cable Plowing\n- **Software Services**: Cobb Underground also offers utility construction management software through Sergeant Schedule, which includes features like project mapping, staff scheduling, estimates & proposals, cloud/GPS technology, time tracking, and smartphone integration.\n- **BBB Profile**: Not BBB Accredited. The company has no customer reviews or complaints filed with the Better Business Bureau.\n- **Main Office**: 109 C David Green Road, Birmingham, AL 35244 (for software services)"
    },
    "r-d-heating-and-air-hvac-maintenance-contractor-heating-and-air-conditioning-service-pell-city-al": {
      "business name": "R & D Heating and Air - HVAC Maintenance Contractor, Heating and Air Conditioning Service Pell City AL",
      "extra_info": "**\n- **Specialties:** Residential and commercial HVAC service, repair, replacement, and maintenance.\n- **Location:** Pell City, AL 35125.\n- **Services:** Includes cleaning and replacing filters, inspecting and repairing ductwork, repairing or replacing damaged components, installing new HVAC units, and more.\n- **Contact:** For more information or to schedule an appointment, visit our website or contact us directly."
    },
    "leak-pros-of-al-ga": {
      "business name": "Leak Pros of Al & Ga",
      "extra_info": "**\n- **Services:** Water Damage Restoration, Mold Remediation, Construction\n- **Core Principles:**\n  - **Communication:** Proactive communication with customers and insurance companies.\n  - **Cleanliness:** Unparalleled guarantee of white-glove service.\n  - **Care:** Treating each customer with the utmost care and respect.\n- **Contact Information:** Call 470-494-3333 to request a free estimate.\n- **24/7 Emergency Services:** Available for immediate response to water damage emergencies."
    },
    "lewis-design-handyman-home-service": {
      "business name": "Lewis Design Handyman & Home Service",
      "extra_info": "- **Experience:** Over a decade of experience in whole house remodeling.\n- **Licensing & Insurance:** Fully licensed and insured.\n- **Training:** Dedicated to continued training for the best results.\n- **Services:** Whole house remodeling, kitchen remodels, bathroom renovations, home additions, and room renovations.\n- **Customer Service:** Exceptional customer service with a focus on meeting your specific needs and preferences.\n- **Certifications:** Not specified in the provided sources, but generally aligned with industry standards for home remodeling and design.\n\nFor more information or to discuss your home renovation project, please visit our website or contact us directly."
    },
    "timothy-foster-constrution-company": {
      "business name": "TIMOTHY FOSTER CONSTRUTION COMPANY",
      "extra_info": "- **Services Provided:** General Contracting\n- **Areas Served:** Roanoke, Alabama\n- **Founded:** 1989\n- **Additional Information:** The company has been serving Alabama and Georgia with exceptional remodeling services, ensuring customer satisfaction through its unmatched quality and timely delivery. For more details, visit [Timothy Foster Construction Company](https://www.houzz.com/professionals/general-contractors/timothy-foster-construction-company-pfvwus-pf~1512580646)."
    },
    "harris-county-plumbing": {
      "business name": "Harris County Plumbing",
      "extra_info": "- **Service Areas:** Harris County, including areas like Katy, Fulshear, Sealy, Cinco Ranch, Pine Lakes, Kelliwood, Firethorne, Falcon Point, West Houston, and more. We also serve Waller and Fort Bend Counties.\n- **Expertise:** Our plumbers are licensed, drug-tested, and background-checked. We offer comprehensive warranties on both labor and parts.\n- **Special Services:** We provide water filtration and softener systems to improve the taste, smell, and feel of your tap water.\n- **Customer First Policy:** Customer service, cleanliness, and professionalism are at the heart of our approach. We take extra care to prevent further damage and clean up any mess we make.\n- **Contact Information:** For immediate assistance, call us at 281-599-3336 or visit our website at [MET Plumbing LLC](https://www.met-plumbing.com)."
    },
    "reese-plumbing-llc": {
      "business name": "Reese Plumbing LLC",
      "extra_info": "**\n- **Location:** 231 Deeks Dr, Pineville, SC 29468-3257, United States [1].\n- **Services:** Plumbing services including routine maintenance, repairs, and installations [1].\n- **Customer Reviews:** While specific customer reviews are not available for this particular company, it is essential to note that customer feedback can vary. For instance, another company with a similar name in Newburg, PA, had mixed experiences with part availability and service timing [2].\n- **BBB Listing:** Reese Plumbing, Heating, & Air Conditioning LLC is listed with the Better Business Bureau (BBB) in Staples, MN, but there is no specific information available for the South Carolina location [4]."
    },
    "twin-river-contractors": {
      "business name": "Twin River Contractors",
      "extra_info": "- **Expansion Plans**: Two Rivers Lumber is currently investing $115 million in a new sawmill project in Coosa County, which is expected to start operations in August 2025. This expansion will not only create 130 jobs but also enhance the company's production capacity and contribute to the economic growth of the region [1].\n- **Community Support**: The project has received significant support from local and state authorities, including a donation of 110 acres of land valued at $2.2 million by the Lake Martin Area Industrial Development Authority. AIDT, the state?s primary workforce development agency, is also providing services to the company to ensure a smooth transition and successful operation [1].\n- **Leadership**: Jay McElroy, a member of the founding family, has been instrumental in the company's growth and expansion. He has expressed his commitment to the project and the local community, highlighting the importance of trust and integrity in their partnership with Peak North America, the construction company leading the project [1]."
    },
    "kelly-c-williams-plumbing-inc": {
      "business name": "Kelly C. Williams Plumbing, Inc.",
      "extra_info": "**\n- **Contact Information:** Kelly C. Williams Plumbing, Inc. can be reached at (706) 322-2159 or through their website.\n- **Location:** The company is located at 37 Fortson Rd., Fortson, GA 31808.\n- **Accreditation:** This business is not accredited by the Better Business Bureau (BBB) as of the latest information available. However, customer reviews and ratings can be found on the BBB website for further evaluation.\n\nFor more detailed information or to schedule a service, please visit our website or contact us directly."
    },
    "m-m-pumping-septic-repair": {
      "business name": "M & M Pumping & Septic Repair",
      "extra_info": "- **Services Offered:** \n  - Septic tank maintenance and pump outs\n  - Septic repairs and installations\n  - Septic system replacements\n  - Excavation and hauling services\n\n- **Certifications and Affiliations:**\n  - Licensed with the New Jersey Department of Environmental Protection and the New York Department of Environmental Conservation\n  - Member of the National Environmental Health Association\n  - Certified installers of advanced treatment systems\n\n- **Customer Focus:**\n  - Available 24/7 for emergency services\n  - 5% senior discount on services\n  - Continuous improvement based on customer feedback\n\n- **Additional Services:**\n  - Grease trap maintenance for restaurants and businesses\n  - Septic inspections and system design\n\nM & M Pumping & Septic Repair is your reliable partner for all your septic needs, ensuring that your home or business operates smoothly and efficiently."
    },
    "alabama-water-heater": {
      "business name": "Alabama Water Heater",
      "extra_info": "- **Professional Services**: Our services include installation, maintenance, and repair of traditional and tankless water heaters.\n- **Trusted Brands**: We work with trusted brands like Rinnai to ensure high-quality products.\n- **Transparent Pricing**: We offer all-inclusive pricing with no hidden charges.\n- **Emergency Services**: Available 24/7 for emergency repairs.\n- **Customer Support**: Comprehensive support for all our products after installation.\n- **Locations Served**: Birmingham and surrounding areas in Alabama.\n- **Contact Information**: For more information or to schedule an appointment, call (205) 383-3999."
    },
    "fortner-plumbing": {
      "business name": "Fortner Plumbing",
      "extra_info": "- **Local Presence**: Fortner Plumbing is locally owned and operated in Anderson, SC, making us your neighbors who treat you like family.\n- **BBB Accreditation**: Fortner Plumbing, LLC is accredited by the Better Business Bureau (BBB), reflecting our commitment to ethical business practices and customer satisfaction.\n- **High Ratings**: With a BuildZoom score of 101 and ranking in the top 12% of South Carolina contractors, Fortner Plumbing has earned a reputation for quality work and reliability[4].\n- **Prompt Service**: We understand that plumbing issues can be stressful, which is why we prioritize prompt service and ensure that our specialists are always on time to address your needs[1].\n- **Honest Estimates**: We focus on fixing the problem without padding the bill. Our team provides honest estimates and backs up our work with a guarantee you can trust[1]."
    },
    "north-american-heating-and-air": {
      "business name": "North American Heating and Air",
      "extra_info": "- **Global Reach:** North America HVAC has partnerships in over 50 countries, including Albania, Argentina, Australia, Canada, China, Egypt, France, Germany, India, Japan, Mexico, Russia, South Africa, South Korea, Spain, Sweden, Switzerland, Taiwan, Thailand, Turkey, UK, USA, and many more.\n- **Service Areas:** We serve a wide range of regions including the Hudson Valley in New York (Dutchess, Orange, Putnam, Ulster, Westchester counties) and beyond.\n- **Services Offered:** Our comprehensive services include installation, maintenance, 24-hour service, and design/build consulting for both residential and commercial HVAC systems.\n- **Certifications:** Our technicians are NATE-certified, ensuring they possess extensive training and experience in HVAC installation, repair, and maintenance.\n- **Customer Satisfaction:** We guarantee our labor and repairs for a full year and offer a lifetime guarantee on our work, ensuring customer satisfaction is our top priority."
    },
    "autauga-county-handyman": {
      "business name": "Autauga county handyman",
      "extra_info": "- **Services Offered:** Residential handyman services including minor repairs, home maintenance, and general contracting.\n- **Business Model:** Specializing in providing high-quality work at an affordable price, focusing on customer satisfaction.\n- **Legal Compliance:** Compliant with local handyman laws, ensuring all services are provided within legal limits.\n- **Insurance:** Protected by handyman insurance to safeguard both customers and the business.\n- **Customer Focus:** Emphasizing repeat business and referrals, indicating strong customer satisfaction.\n- **Marketing Strategy:** Utilizing a professional website and online presence to establish credibility and attract new customers.\n- **Community Involvement:** Long-standing presence in Montgomery, Elmore, and Autauga counties, contributing to the local community through reliable handyman services."
    },
    "ramos-handyman-services": {
      "business name": "Ramos Handyman Services",
      "extra_info": "**\n- **Location:** Euless, TX\n- **Services:** Handyman work, interior painting, lawn mowing and trimming, pressure washing\n- **Contact Information:** Available on Thumbtack and HomeAdvisor\n- **Years in Business:** 6 years\n- **Rating:** 100% Recommended on HomeAdvisor[1][4]"
    },
    "joe-reid-dawes-plumbing-service": {
      "business name": "Joe Reid - Dawes Plumbing Service",
      "extra_info": "- **Location:** 9373 Labrador Run S, Mobile, AL 36695\n- **Contact:** (251) 401-0370\n- **BBB Profile:** Not BBB accredited, but available for review on the Better Business Bureau website.\n\nFor more information or to schedule a service, visit our website or contact us directly."
    },
    "brian-harden-plumbing-inc": {
      "business name": "Brian Harden Plumbing Inc.",
      "extra_info": "**\n- **Contact Information:** 7465 Oak Dr W, Theodore, AL 36582-6175, Phone: (251) 973-2234, Fax: (251) 654-0970\n- **Services:** Plumbing maintenance, faucet, sink, toilet, tub, disposal repairs and replacements, water heater installations\n- **Licensing:** Licensed by the State of Alabama Plumbers & Gas Fitters Examining Board (license number MPG-4032)\n- **BBB Accreditation:** Accredited since 2004\n- **Additional Contact:** Mr. Brian O. Harden, President/Owner\n- **Email:** Email this Business (available on BBB profile)"
    },
    "a-c-e-plumbing-solutions": {
      "business name": "A.C.E. Plumbing Solutions",
      "extra_info": "- **Location**: The Lodge, Meadow Lane, Stoke-On-Trent, Staffordshire, England, ST11 9RZ (for the UK-based company) and Baltimore, MD (for the US-based company).\n- **Company Status**: Active.\n- **Company Type**: Private limited company.\n- **Services**: Drain cleaning, leak repair, re-piping, kitchen plumbing services, emergency plumbing, water treatment solutions, and more.\n- **Contact Information**: For the UK-based company, no specific contact details are provided. For the US-based company in Baltimore, you can call (410) 256-7900 or text (410) 207-7837.\n- **Customer Testimonials**: Clients praise A.C.E. Plumbing Solutions for their professionalism, care, and honesty in their work. For example, Jacqueline from Perry Hall, MD, notes that Ace Plumbers is the best in the area with exceptional work and fair pricing."
    },
    "alabama-septic-service": {
      "business name": "Alabama Septic Service",
      "extra_info": "**\n- **BBB Accreditation:** Alabama Septic Services is BBB accredited since October 24, 2022, reflecting our commitment to quality and customer satisfaction [4].\n- **Services Offered:** We provide a wide range of services including new septic system installations, septic tank cleaning, and repairs. Our team is equipped with the latest state-of-the-art equipment to ensure efficient and reliable services [1].\n- **Emergency Services:** We understand that septic emergencies can happen at any time. Our 24/7 emergency services ensure that you receive prompt assistance when you need it most [1]."
    },
    "b-b-torch-regulator-and-repair-service-llc": {
      "business name": "B & B Torch Regulator and Repair Service LLC",
      "extra_info": "- **Location:** 3350 Deaver Walker Road, Cleveland, AL 35049\n- **Contact:** (205) 681-4731\n- **Services:** Hydraulic and pneumatic system repairs, torch regulator maintenance, cutting equipment repair kits, and more.\n- **Specialization:** B & B Torch Regulator and Repair Service LLC focuses on repairing and maintaining cutting equipment used in various industries, including welding and manufacturing."
    },
    "central-fire-protection": {
      "business name": "Central Fire Protection",
      "extra_info": "**\n- **Company Size:** 10 to 50 employees\n- **Average Contract Size:** $100,000 to $1,000,000 (USD)\n- **Contact Information:**\n  - Address: 41 West Park Circle, Birmingham, AL 35211\n  - Phone: (205) 942-0200\n  - Toll-Free: (800) 942-0441\n- **Leadership:**\n  - President: Dan J. Dotson\n  - Vice-President: Jerry L. Rouse\n  - Special Hazards: Allen Buckner\n  - Inspections: Adam Reeves\n  - Fire Alarm & Security: John Sharit\n  - Design Manager: Josh Sellers\n  - Contract Representatives: Mike Land, Mike Sullivan, Ken Wofford\n  - Procurement: Kevin Connolly\n  - Controller: Beth Carroll\n  - Administrative: Norma Ogletree\n\nFor more detailed information, please visit our website at [www.centralfireprotection.com](https://www.centralfireprotection.com)."
    },
    "sims-plumbing-air": {
      "business name": "Sims plumbing & air",
      "extra_info": "- **Address:** 356 Ebenezer St, Madisonville, KY 42431\n- **Phone Number:** (270) 821-2891\n- **Category:** Heating Contractors\n- **Services:** Installation, Repair, Maintenance of Plumbing and Heating Systems\n\nFor more information or to schedule a service, please visit our website or contact us directly."
    },
    "quality-plumbing-co": {
      "business name": "Quality Plumbing Co.",
      "extra_info": "- **Services Offered:**\n  - Faucets and Sinks\n  - Water Heaters\n  - Sump Pumps\n  - Waste and Sewer Lines (including video camera line inspection)\n  - Garbage Disposals\n  - Backflow Prevention Devices\n\n- **Customer-Focused Approach:**\n  - Prompt and flexible scheduling with our \"Call Ahead\" service.\n  - Fully stocked trucks for efficient job completion.\n  \n- **Expertise:**\n  - Master Plumber Doug Cater leads a team of trained technicians.\n  - Continuous training and on-the-job coaching sessions ensure high-quality service.\n\n- **Community Involvement:**\n  - Quality Plumbing Co. is deeply rooted in the Union Grove community, committed to providing reliable plumbing solutions that enhance the quality of life for local residents and businesses.\n\nFor more information or to schedule a service, contact Quality Plumbing Co. today."
    },
    "affordable-airconditing-asap": {
      "business name": "Affordable Airconditing ASAP",
      "extra_info": "- **Service Area:** We serve not only Birmingham but also surrounding areas including Chelsea, Sterrett, Vandiver, Vincent, Harpersville, Childersburg, Sylacauga, Talladega, Westover, Alexander City, Goodwater, Hollins, Sycamore, Alpine, Wilsonville, Munford, Bon Air, Lincoln.\n- **Indoor Air Quality Specialists:** We offer a variety of clean air solutions such as air purifiers, UV lights, and air duct sealing to improve indoor air quality.\n- **Money-Saving HVAC Maintenance Plans:** Our maintenance plans include priority scheduling, discounts on service calls, and other perks to help you save on utility bills and ensure optimal indoor comfort.\n- **Emergency Services:** Our 24/7 same-day emergency heating and cooling services ensure that your system will be back in working order quickly when something goes wrong."
    },
    "tracy-duncan-plumbing": {
      "business name": "Tracy Duncan Plumbing",
      "extra_info": "**\n- **Location:** 894 Old Zion Rd, Nauvoo, AL 35578, US\n- **Services:** Emergency plumbing services, drain cleaning solutions, basement drainage channels installation and repair.\n- **Availability:** Available 24/7 without extra charges for nights or weekends.\n- **History:** Listed in the Blue Book since 2010.\n- **Customer Reviews:** Positive reviews from Angi members and HomeAdvisor users."
    },
    "local-professional-handyman": {
      "business name": "Local Professional Handyman",
      "extra_info": "- **Target Market:** We primarily target local residents in Bloomington, IN, who are homeowners looking for reliable and professional handyman services. We also serve rental property owners and landlords who require consistent and dependable service to maintain their properties. Furthermore, we extend our services to businesses and commercial properties in the area.\n  \n- **Services Offered:** Our services encompass a wide range of home maintenance and improvement solutions, including general repairs, installation services, painting and decorating, carpentry work, as well as plumbing and electrical repairs.\n  \n- **Legal Structure:** Local Professional Handyman is incorporated as an LLC, providing us with the legal protection and financial benefits necessary for a growing business.\n  \n- **Marketing Strategy:** We focus on building a professional website and online presence to establish credibility and attract customers. Our marketing strategy also includes competitive pricing and flexible scheduling to ensure that property owners find our services both accessible and valuable.\n  \n- **Insurance:** We are fully insured to protect ourselves and our business from potential risks, ensuring that our clients receive the best possible service with peace of mind."
    },
    "stephen-seibert-plumbing-llc": {
      "business name": "Stephen Seibert Plumbing, LLC",
      "extra_info": "**\n- **Contact Information:** Phone Number: (256) 247-8660, Address: 414 Bolwes Bridge Road, Hartselle, AL 35640.\n- **Services Offered:** Residential and commercial plumbing, sewer line repairs and replacements, water heater installation and repair, fixture installations and repairs, remodeling projects (kitchens/bathrooms/laundry rooms), gas piping and leak detection, drain cleaning.\n- **Location:** Hartselle, Alabama.\n- **Customer Reviews:** Available upon request; please contact us for more information."
    },
    "lovelace-service-heating-air": {
      "business name": "Lovelace Service Heating & Air",
      "extra_info": ""
    },
    "north-alabama-drain-cleaning-etc-llc": {
      "business name": "North Alabama Drain CLeaning,etc LLC",
      "extra_info": "**\n- **Locations:** We serve five counties in northern Alabama, including Decatur, Hartselle, Moulton, Cullman, and surrounding areas.\n- **Certifications:** Our technicians hold certifications from the Alabama Onsite Wastewater Board (AOWB) and are Alabama Master Plumbers.\n- **Services:** Our comprehensive services include septic tank pumping, septic tank treatment, sewer camera inspections, grease trap cleaning, and high-velocity water jetting drain cleaning.\n- **Contact Information:** Phone: (256) 202-5104, Fax: 256-306-0727, Email: info@drainproal.com. Address: 4504 US Hwy 31 S, Decatur, AL 35603.\n- **Business Hours:** Monday through Friday, 8:00 AM to 4:30 PM. Closed on Saturdays and Sundays. 24-hour emergency service available.\n- **Guarantee:** Conditional guarantee on work performed.\n- **Membership:** Member of the Decatur Chamber of Commerce and the Better Business Bureau (BBB)."
    },
    "d-l-remodeling-and-flooring": {
      "business name": "D&L Remodeling and Flooring",
      "extra_info": "**\n- **Services:** D&L Remodeling and Flooring offers a variety of services including bathroom remodeling, kitchen remodeling, and more.\n- **Location:** Based in Waldorf, MD, serving the local community with professional construction and remodeling services.\n- **Experience:** Specializing in home renovations for over [insert years], our team has developed a keen understanding of the variables involved in successful home remodeling projects."
    },
    "right-a-way-rooter": {
      "business name": "Right-A-Way Rooter",
      "extra_info": "- **Specialization:** Right A Way Rooter specializes in drain cleaning and rooter services, making them a go-to choice for all your plumbing needs.\n- **Location:** 191 Marshall Rd, Dothan, AL 36305\n- **Services:** Comprehensive plumbing services including drain cleaning, rooter services, and more.\n- **Availability:** 24/7 emergency service available for urgent plumbing issues."
    },
    "shaw-s-handyman-services": {
      "business name": "Shaw's Handyman Services",
      "extra_info": "- **Services Offered:** Shaw's Handyman Services specializes in carpentry, deck installation and repair, rot repair, flooring installation and repair, fence installation, window and door installation, and more.\n- **Geographic Coverage:** While specific locations are not detailed in the provided sources, it is implied that they serve local areas with a focus on home maintenance and repair.\n- **Customer Focus:** Regular maintenance is emphasized as a key service to keep homes in top condition. The company offers time and materials rates for smaller jobs and provides estimates for larger projects.\n- **Contact Information:** For more information or to schedule an estimate, you can contact Shaw's Handyman Services directly."
    },
    "stinnett-heating-cooling": {
      "business name": "Stinnett Heating & Cooling",
      "extra_info": "**\n- **Services:** Residential and commercial HVAC services, including sales, installation, and replacement of air conditioning and heating systems.\n- **Certifications:** North American Technician Excellence (NATE) certified technicians.\n- **Customer Care:** Available Monday through Friday from 7 AM to 5 PM CST for product inquiries, warranty information, and dealer concerns.\n- **Emergency Service:** 24/7 emergency service available for urgent heating and cooling issues.\n- **Customer Reviews:** Praised for their professional service and prompt problem-solving, as noted in reviews on Angi[4]."
    },
    "rediworx-drain-sewer-cleaning": {
      "business name": "RediWorx Drain & Sewer Cleaning",
      "extra_info": "**\n- **Location:** Serving Cleveland, Ohio, with a focus on providing local expertise and quick response times.\n- **Services:** Drain cleaning, maintenance, sewer drain repair, preventive care, and 24/7 emergency services.\n- **Customer Reviews:** Over 500+ Google customer reviews with a 4.9-star rating, reflecting our commitment to quality service.\n- **Mission:** To provide honest, transparent, and trustworthy service, doing what we say we?re going to do. Period.\n- **Experience:** With years of industry experience, our team is well-equipped to handle a wide range of plumbing issues, from minor repairs to major sewer line replacements.\n- **Emergency Services:** Open 24/7 for your convenience, ensuring that you can get help whenever you need it."
    },
    "terrapin-creek-plumbing-and-septic-service-llc": {
      "business name": "Terrapin Creek Plumbing And Septic Service, LLC",
      "extra_info": "- **Location**: 785 County Road 473, Centre, AL 35960-7804\n- **Contact Information**:\n  - Phone: (256) 527-0985\n  - Email: terrapincreekplumbing@gmail.com\n  - Additional Contacts:\n    - Wendy McDaniel\n    - Steven McDaniel\n    - Phone: (256) 557-0985, (256) 927-8844, (256) 523-1555, (256) 927-5611\n- **Accreditation**: BBB Accredited since May 4, 2023\n- **Service Area**: Centre, AL and surrounding areas\n- **Status**: Inactive per FMCSA regulations due to non-compliance with biennial update requirements [2]."
    },
    "dorsey-plumbing-llc": {
      "business name": "Dorsey Plumbing LLC",
      "extra_info": "- **Location**: Central Indiana\n- **Services**: Residential Plumbing, Commercial Plumbing, Emergency Plumbing, Water Heater Installation, Water Service, Pump Service, Well Service, Piping, Storm Drainage Solutions\n- **Customer Focus**: Over 70% of business comes from repeat or referral customers.\n- **Value-Rate Service Agreement**: Offers a 12% discount on repairs labor, preferred status for first-in-line appointments, and an annual inspection of plumbing systems to avoid big problems and keep plumbing running smoothly year-round."
    }
  }
}