{
  "siteConfigs": {
    "bear-plumbing-llc": {
      "business name": "Bear Plumbing, LLC",
      "reviews": [
        {
          "reviewer_name": "J Williams",
          "review_text": "Hands down the absolute best experience I’ve ever had with a plumber. Larry and his team have helped us many times over the past few years. He’s been there for repairs and to help us with plumbing updates. Most recently he did the plumbing for our home bar. He was fast, professional and knowledgeable about what needed to be done and how to do it with minimal damage to the drywall. We couldn’t be happier. I’m always telling my friends and family about him and I encourage anyone reading this review to call him for all of your plumbing needs. 10 out of 10!"
        },
        {
          "reviewer_name": "Austin Humber",
          "review_text": "Larry is great reasonably priced always on time"
        },
        {
          "reviewer_name": "Hal Phillips",
          "review_text": "Larry did a great job for us. He came the same day we called. I fully expected to need a complete new water heater but he was able to find parts to put it back in operation by the next day. We will gladly call Bear the next time we need plumbing work done. Highly recommend Larry and Bear Plumbing!"
        },
        {
          "reviewer_name": "A A",
          "review_text": "Larry came through on the plumbing for our remodel. Did a very good job at a reasonable rate. Thanks Larry!"
        },
        {
          "reviewer_name": "Kristen Bailey",
          "review_text": ""
        },
        {
          "reviewer_name": "Paul Taylor",
          "review_text": "Larry Overton of Bear Plumbing responded to my request very quickly. He was able to perform the plumbing work at my home within  a short time after arrival.  The costs of the repairs were extremely reasonable. Larry and his co-worker were very respectful, courteous, and knowledgeable. Larry communicated with me prior to arrival to confirm the appointment date & time.  I have scheduled for Larry to perform additional plumbing work at my home because of the great service provided by Bear Plumbing."
        },
        {
          "reviewer_name": "Tom Milton",
          "review_text": "Larry did a great job in a timely manner and at a reasonable price!"
        },
        {
          "reviewer_name": "Kevin Arrowood",
          "review_text": "Larry did several jobs for me and I couldn't be more pleased! He was very professional and showed up when he said he would. The pricing was great also."
        },
        {
          "reviewer_name": "Jeff Deneen",
          "review_text": "Why do water heaters fail on the weekends?  Larry answered promptly, came on time and did a great job."
        },
        {
          "reviewer_name": "Reba Overton",
          "review_text": "Was on time courteous neat.Job well done."
        }
      ]
    },
    "boydstun-plumbing-llc": {
      "business name": "Boydstun Plumbing LLC",
      "reviews": [
        {
          "reviewer_name": "Cracked_Potato4101",
          "review_text": "Quick, responsive, kind, and knowledgeable. Will always use him for plumbing work, and refer to friends and neighbors!"
        },
        {
          "reviewer_name": "Liah C",
          "review_text": "Great plumbing business. Very knowledgeable, patient and kind. 100 percent guaranteed to get the job done accurately, punctually , the first time! Look no further for a great plumber, you’ve found them here!!!!"
        },
        {
          "reviewer_name": "Larry Beard",
          "review_text": "Best experience I've had with contracting plumbing work. Honest, kind and professional. I will recommend this company to everyone that I know."
        },
        {
          "reviewer_name": "Larry",
          "review_text": ""
        },
        {
          "reviewer_name": "Wes Sharp",
          "review_text": "Great service and very knowledgeable. Highly recommend."
        },
        {
          "reviewer_name": "Camryn Whitlock",
          "review_text": "I would definitely recommend Boystun Plumbing! Great communication to let me know exactly when he would arrive. Showed up super fast and fixed the problem right away. Super friendly and professional. Will definitely call again if we ever have plumbing issues."
        }
      ]
    },
    "barnett-plumbing-llc": {
      "business name": "Barnett Plumbing, LLC",
      "reviews": [
        {
          "reviewer_name": "makenzie franck",
          "review_text": "HIGHLY RECOMMEND!! These guys have been working behind my apartment the last 3 days till morning up until 9 at night these guys most definitely are hard workers! And kind too!"
        },
        {
          "reviewer_name": "Dan Snyder",
          "review_text": "Great service.  Brandon did a fantastic job."
        },
        {
          "reviewer_name": "Guy See",
          "review_text": "Barnett has literally bailed me out of two water leak problems and frozen pipes in the past 6 months and I want to survive without him thanks a lot boys"
        },
        {
          "reviewer_name": "Betsy Wyatt",
          "review_text": "You know, I didn’t even get to use Barnett for what I needed, but I was compelled to do a review because of their professionalism and friendliness. I called before they probably should have been open and was kindly helped by their dispatcher and main office lady queen :-) I was working to get help from a couple of different plumbers based on neighbor’s recommendation, and Barnett was one he recommended.  The other company had already started the steps in our process, and in the meantime Barnett called me back and was ready to send someone out the Same day. Barnett had worked me in, and she gave me an estimate on labor and cost that seemed fair.    If I have needs in the future, I will contact Barnett plumbing. It’s things like this that make me proud to do local business in and around the Florence and Killen area."
        },
        {
          "reviewer_name": "Dana Rogers",
          "review_text": "I will use Barnett plumbing for any plumbing needs.   I had  a somewhat problematic toilet.   They went above and beyond finding the issue and putting in extra work to ensure that my problem was resolved.  Very professional and kind.   GOOD FOLKS."
        },
        {
          "reviewer_name": "Matthew Parrish",
          "review_text": "I don't know who this matt guy is but he must do good work if I need any one please send him out thanks"
        },
        {
          "reviewer_name": "Crystal Thigpen",
          "review_text": "It started with calling Lisa Monday afternoon/evening and explaining the situation.  Lisa was kind, knowledgeable and fantastic to speak with.  Then one of her techs came out Matthew on Tuesday afternoon.  He was right on time, actually listened while I told him what was going on and went right to work.  He was able to pinpoint the issue within about 15 minutes and had it fixed roughly 45 minutes later.  I can't thank Barnett Plumbing enough for the relief of having everything work wonderfully after about 8 years.  Thanks Lisa and Matt you two are the exact reason we will also look to Barnett in the future!!!!!"
        },
        {
          "reviewer_name": "Betty Romans",
          "review_text": "Lisa at Barnett Plumbing was a life saver and my hero today! Hot water heater went bad last night and I called this morning and Lisa did a great job taking care of me! Thank you Barnett Plumbing!"
        },
        {
          "reviewer_name": "Allison Stack Blair",
          "review_text": "They are the best plumbers! Always helpful and competent!"
        },
        {
          "reviewer_name": "Joshua Black",
          "review_text": "Fast and affordable"
        },
        {
          "reviewer_name": "Steve Hanback",
          "review_text": "The technicians were able to locate me and my problem at a great time with a good amount of payment."
        },
        {
          "reviewer_name": "Erica Muck",
          "review_text": "I called them on a Friday at 3pm they came out after hours to snake my lines. Realized it was a bigger issue. They set me up first thing Monday. They found my issue quickly and got all the permits they needed to dig. They showed me everything and explained everything to me. They guys are very friendly, and trustworthy. Working with them was a breeze! They’re the only ones I’ll call for plumbing issues."
        },
        {
          "reviewer_name": "Nirant Patel",
          "review_text": ""
        },
        {
          "reviewer_name": "Chase Goode",
          "review_text": "Had a galvanized water line that was busted under a house. I needed it fixed that same day, as we had an inspection the following day. They got it done same day and for a reasonable price. Both plumbers that showed up were very polite and professional and the office staff was great to work with! Definitely recommend using Barnett!"
        },
        {
          "reviewer_name": "anthony givens",
          "review_text": ""
        },
        {
          "reviewer_name": "Baron kindle",
          "review_text": "Dependable and affordable."
        },
        {
          "reviewer_name": "Miss Peden",
          "review_text": "They really met my needs...ASAP..THANKS GUYS."
        },
        {
          "reviewer_name": "James Fryman",
          "review_text": "These guys are awesome! They will show up quick and give you a good price. Very grateful"
        },
        {
          "reviewer_name": "Catherine Oliver-Weems",
          "review_text": "Matthew is our hero!  He repaired the water pump on our well and saved our vacation.  He was professional, pleasant and prompt.  He had to go get a part, returned, and worked well past quitting time to take care of us.  Thank  you Matthew and Barnett Plumbing!"
        },
        {
          "reviewer_name": "Haley Scott",
          "review_text": ""
        },
        {
          "reviewer_name": "Stephanie Smith",
          "review_text": "Great service!"
        },
        {
          "reviewer_name": "Brian Putnam",
          "review_text": "Great job. Thx."
        },
        {
          "reviewer_name": "Marsha and B",
          "review_text": "Great place"
        },
        {
          "reviewer_name": "James Stout",
          "review_text": "Well they came out and did a great job at fixing my problem and they were professional and used top quality materials for the repair I'm impressed! I'm difficult to impress,if I could complain about something I would ! At first I thought they were a little high by about 40 dollar's, I didn't say anything, after they left is when I really looked  and seen he used stainless steel braided line simply the best money could buy materials! A+"
        },
        {
          "reviewer_name": "Pamela Gilbert",
          "review_text": "By far the best I have used.  Prompt, courteous, respectful of my home and fair price."
        },
        {
          "reviewer_name": "Connie Hanback",
          "review_text": ""
        },
        {
          "reviewer_name": "Dalton Lansdell",
          "review_text": ""
        },
        {
          "reviewer_name": "Amy Glover",
          "review_text": "Carlos and Stephen fixed two leaky faucets and repaired/replaced a diverter and drain stopper in a shower.  I felt very comfortable having them in my home.  I found them to be knowledgeable, and patient about explaining everything to me!  They also were patient with our barking nipping dog and nosey cat!  Thank you guys!"
        },
        {
          "reviewer_name": "Jennifer Kellum",
          "review_text": "They were amazing and would recommend!  They were professional and found a leak that 3 other plumbers could not locate. Will definitely use again and highly recommend!"
        },
        {
          "reviewer_name": "Kay",
          "review_text": "Excellant service! Reasonable prices  installing a hot water heater and very professional. Everything cleaned up after the job was done. I do reccomend 100%."
        },
        {
          "reviewer_name": "david osborn",
          "review_text": "Good Group of Plumbers and office personnel"
        },
        {
          "reviewer_name": "Tara Groth",
          "review_text": ""
        },
        {
          "reviewer_name": "Big Wurm",
          "review_text": ""
        },
        {
          "reviewer_name": "Marilyn Holt Crowell",
          "review_text": "Great service."
        },
        {
          "reviewer_name": "ashley phillips",
          "review_text": ""
        },
        {
          "reviewer_name": "Jeffrey Olive",
          "review_text": ""
        },
        {
          "reviewer_name": "Steve Humphries",
          "review_text": "Trustworthy and dependable.  Good communication.  They plumb it right."
        },
        {
          "reviewer_name": "D H",
          "review_text": "Very satisfied with Barnett Plumbing. Eden was very efficient, friendly and fast to respond to my initial call to the office (on a Saturday afternoon it took less than 5 minutes for callback and he was there fixing the problem within 30 minutes). A great employee and I will be asking specifically for him if the need for more plumbing work should arise. I give Barnett 6/5 stars...easily!"
        },
        {
          "reviewer_name": "Alejandro Islas",
          "review_text": ""
        },
        {
          "reviewer_name": "Jennifer Young",
          "review_text": "We had our plumbing replaced a couple of weeks ago and couldn’t have asked for better service. They came to look at our plumbing, and within two days, they were here to replace it all. They were professional and the price was great! They also did a fantastic job! We’ll definitely be calling them for our future plumbing needs."
        },
        {
          "reviewer_name": "Michael Wright",
          "review_text": "THANK YOU THANK YOU THANK YOU - What a great company!  You guys saved me today (Sunday night....) Toilet and two sinks repaired/replaced.  It't not every day that a company goes above and beyond but BARNETT DOES!"
        },
        {
          "reviewer_name": "Chance Morris",
          "review_text": "Very satisfied customer!!! I had a mystery leak. Mike and Brad came out and took care of business. They were very fast and very professional."
        },
        {
          "reviewer_name": "Regina Gamel",
          "review_text": ""
        },
        {
          "reviewer_name": "Renee Hamm",
          "review_text": "Great plumbers"
        },
        {
          "reviewer_name": "JoAnna Goggans",
          "review_text": "Our faucet broke and I called Barnett Plumbing that morning at they were there by that afternoon.  They did a great job replacing our faucet and were extremely efficient and professional."
        },
        {
          "reviewer_name": "Jacob Robinson",
          "review_text": ""
        },
        {
          "reviewer_name": "Dawn Buttrum",
          "review_text": "Wonderful! They came quickly and fixed the problem"
        },
        {
          "reviewer_name": "Andrew Littleton",
          "review_text": ""
        },
        {
          "reviewer_name": "Mary Watson",
          "review_text": "Dondvan and Rusty did a Great job for Mr White fixed his leak and got his water back on Thanks guys"
        },
        {
          "reviewer_name": "Michael Ryan",
          "review_text": ""
        }
      ]
    },
    "fussell-plumbing": {
      "business name": "Fussell Plumbing",
      "reviews": [
        {
          "reviewer_name": "Anna Blagburn",
          "review_text": "Called Alex out to my duplex for two rentals with two malfunctioning water heaters. He fixed them quickly and for a reasonable price. I will be using him for all the repairs on all of my rental properties!"
        },
        {
          "reviewer_name": "Allie Carter",
          "review_text": "Called Alex Fussell at 9 on a Friday night because there was water coming from the ceiling in my kitchen. He showed up quickly and acted with complete professionalism. He fixed the problem with minimal sheetrock damage. A very neat and timely repair! I am going to recommend him to everyone I know!"
        },
        {
          "reviewer_name": "John Henson",
          "review_text": "My plumbing problem was not an easy one to solve. But, Alex knew what to do and spent a good deal of time making sure everything was right. I don't plan to use any other plumber from now on."
        },
        {
          "reviewer_name": "Julie Brown, Realtor at Southern Elite Realty, LLC",
          "review_text": "I highly recommend Alex Fussell.  He did an outstanding job re-plumbing my house.   If I could give him 10 Stars I would.   If you are in need of any plumbing give him a call!"
        },
        {
          "reviewer_name": "Amanda Jones",
          "review_text": "Fast response and good work!"
        },
        {
          "reviewer_name": "528alex",
          "review_text": "Great work!  Excellent customer service!"
        }
      ]
    },
    "jason-s-drain-service": {
      "business name": "Jason's Drain Service",
      "reviews": [
        {
          "reviewer_name": "Joseph Gutenson",
          "review_text": "Jason and his crew replaced our water heater a few weeks ago. The unit is performing perfectly since it was installed. They came the same day I called and did the work for a very reasonable price."
        },
        {
          "reviewer_name": "Tammy Aldridge",
          "review_text": "I was looking for a good honest plumber and Jason had some really good reviews so we gave him a try and he lived up to those reviews.  He worked us in quickly, communicated when he was running a little behind.  Jason and his crew were very friendly and professional, got the job done and the price was reasonable!"
        },
        {
          "reviewer_name": "Michele Murdock",
          "review_text": "Jason's Drain Service did some work on our older home that included replacing a drain pipe under the house and installing a new pressure control valve. Jason Hunter and his team were friendly, professional and did a great job. If you are looking for a true professional with over 30 years experience who will show up when he promises and get your job done efficiently, give Jason a call. I will definitely call him again when needed."
        },
        {
          "reviewer_name": "Penny Dobson",
          "review_text": "I called Jason Drain service due to a slowly draining kitchen sink. Sadly, it is a major problem that we won't get fixed until we absolutely have no choice but to do so, in the future. This is at a house that we just bought in another neighborhood. Anyway, Jason and his partner were just the best!!!   Unrelated to drains, my husband was trying to pick at a mound of concrete that the former owners poured onto the driveway. They got out their jack hammer like tool and helped him out before they left."
        },
        {
          "reviewer_name": "Barry Durand",
          "review_text": "I recently used Jason’s Drain Service for 2 jobs.   Don’t let the name fool you, they do much more than drains. They replaced a hot water heater (job 1) and replaced the cartridges in both of my bathtub faucets (job 2).  Both faucets are working perfectly now and we have plenty of hot water. Their pricing is reasonable.\n\nHowever, the best thing about them is their willingness to work with your schedule and punctuality. For both jobs, I asked them to come on a specific date. They can on the date requested and were here shortly after 8:00.  This is a drastic change from my previous plumber who was totally unreliable.\n\nJason also did not mind me standing over his shoulder and asking questions. He even stayed a couple of extra minutes to make sure that one faucet stopped dripping.\n\nHis prices are reasonable.  He is *extremely* fair with his pricing.\n\nHe is also very helpful with general information without charging for just a 5 minute conversation.\n\nEDIT: I just used him for a third job.  He again was very punctual which was amazing given we are in the middle of a very hard freeze.  His price for today's job was more than fair.\n\nI highly recommend Jason’s Drain Service."
        },
        {
          "reviewer_name": "Mary Martina",
          "review_text": ""
        },
        {
          "reviewer_name": "Smilez",
          "review_text": "Did great and quick work on a leak I had outside going under the sidewalk. Thanks!"
        },
        {
          "reviewer_name": "Brandi Lovely",
          "review_text": "Honest, quick, and great pricing!"
        },
        {
          "reviewer_name": "Richard Rhone",
          "review_text": "Excellent and trustworthy service. Highly recommend."
        },
        {
          "reviewer_name": "Megan W",
          "review_text": "This is the plumber I've been looking for all these years. For real, Jason's drain was the 6th plumber I tried. Some of the others were bad, some were alright, but Jason was the only one that was great. It is such a relief to finally find a plumber I can trust and rely on. Thank you Jason!"
        },
        {
          "reviewer_name": "sbgreen68",
          "review_text": "He had great communication skills and got to my job in a very prompt manner. Perfect work and very reasonable price. Would not hesitate to use him again. 7 out of 5 stars."
        },
        {
          "reviewer_name": "Linda Canterberry",
          "review_text": "These guys are great. Very professional, reasonable price, on time, quick and clean. If needed will definitely use again!"
        },
        {
          "reviewer_name": "Tuwanda Dunn",
          "review_text": "I was very happy that I called  Jason drain service. A very  professional  service. I am well pleased with the service that was given. Jason is a very nice kind person and I recommend this business. Thanks Jason."
        },
        {
          "reviewer_name": "Dr Adrian Rowe",
          "review_text": ""
        },
        {
          "reviewer_name": "Beverly Callahan",
          "review_text": "Very professional plumbing company.  Very honest and came on time, did a great job, cleaned up afterwards.  I recommend highly."
        },
        {
          "reviewer_name": "Brett Milligan",
          "review_text": "Honest and straightforward. Excellent service and stands by his work."
        },
        {
          "reviewer_name": "roll tide",
          "review_text": "Awesome people!! Hands down will call them for all my plumbing needs! Jason is trust worthy and gets the job done.  The young fellow with him is very respectful and helpful! This is who yall need to go with!! Good job!!"
        },
        {
          "reviewer_name": "Jerry Cook",
          "review_text": "The guys came out short notice, stayed until they got it right, & the price was very reasonable. Highly recommend!"
        },
        {
          "reviewer_name": "Furious Kloud (OG Kloudy)",
          "review_text": "Very straightforward and trustworthy... You can leave them in the house and go. Would recommend to faily and friends. A+"
        },
        {
          "reviewer_name": "Ryan Massengale",
          "review_text": "Great local guy that is honest and reliable.  Will definitely call again for my water issue needs!"
        },
        {
          "reviewer_name": "Rachael Stapp",
          "review_text": "Quality work, great pricing, and friendly service!"
        },
        {
          "reviewer_name": "Holli Mack",
          "review_text": "We have used Jason's Drain Service multiple times over the past few years. He has done plumbing jobs for my husband and I when we needed EMERGENCY work done, AND one job that ended up being more extensive than planned - but was the BEST job yet. He has done work on the interior and exterior of our older house, AND has upgraded fixtures for us. We couldn't be happier. He is honest, efficient, hard working, and the price point was a relief for us. In a day when it's hard to find service workers who possess both skill and integrity, I HIGHLY recommend Jason, who has both!"
        },
        {
          "reviewer_name": "Timberlake Ministries",
          "review_text": ""
        }
      ]
    },
    "ard-s-plumbing-and-electric": {
      "business name": "Ard's Plumbing and Electric",
      "reviews": [
        {
          "reviewer_name": "Kenneth Leach",
          "review_text": "We needed a water heater installed so, I called Ard Plumbing and Electric, the young lady who answered scheduled us for next day. Robert Ard was punctual had this water heater hooked up in timely manner. The price charged was very reasonable. That night I noticed water on the floor and in the catch pan. I called them the next morning and Robert came back and fixed the leaks which required replacing factory parts of the water heater. Robert stood good on his work and we were only charged for the parts for the 2.5 hours he was here.\nRobert if you're reading this, I give you an atta boy!"
        },
        {
          "reviewer_name": "Larry Davis",
          "review_text": "Great bunch of guys. Very happy with the work done and at a fair price. I would recommend them for any projects you may need done."
        },
        {
          "reviewer_name": "Susan Pearson",
          "review_text": "This review is overdue, but Robert and Chris came out to add electricity to my she-shed in fall of 2018. They were very professional and did an outstanding job. The job involved installing a ground wire from my house to the shed, adding multiple outlets, and installing a light fixture. They also provided an additional outlet where we park on the way. The cost was about half what some of the others estimated."
        },
        {
          "reviewer_name": "Pat Benefield",
          "review_text": "I called a week ago, spoke with message person and they haven't called me back.\n\nUpdate.\nI called back, Robert said he didn't get the message and he installed my new water filter system the same day."
        },
        {
          "reviewer_name": "Kaska H",
          "review_text": "Great prices. Fast service"
        },
        {
          "reviewer_name": "Tiera Deese",
          "review_text": "Nice"
        },
        {
          "reviewer_name": "Ignacio Handal",
          "review_text": ""
        },
        {
          "reviewer_name": "Cb Tech",
          "review_text": "Called for a quote, they where kind and professional."
        },
        {
          "reviewer_name": "Pat R",
          "review_text": "Expect the best. Great service."
        },
        {
          "reviewer_name": "Bonnie Christian",
          "review_text": "We are very pleased with the service that ARD Plumbing & Electric has provided. We have used Chris for 2 plumbing jobs now (1 major & one minor) and have been quite satisfied. I highly recommend ARD Plumbing & Electric as they are prompt, courteous, affordable, and provide high quality work."
        },
        {
          "reviewer_name": "Scott Lowe",
          "review_text": "We were affected  by Hurricane Michael. He came out the day we called and was a tremendous help."
        },
        {
          "reviewer_name": "vanessa epperson",
          "review_text": "Awesome go to company. Nathan Flippo is a life saver."
        },
        {
          "reviewer_name": "Kaiden Nicholas",
          "review_text": ""
        }
      ]
    },
    "salser-plumbing-and-septic-service-llc": {
      "business name": "Salser Plumbing and Septic Service, LLC",
      "reviews": [
        {
          "reviewer_name": "Zach DeVore",
          "review_text": "Great company, very responsive came out to fix the issue same day. Quality work at a good price would definitely recommend."
        },
        {
          "reviewer_name": "Melanie Goss",
          "review_text": "Brandon responded to my text quickly on Sunday stating he could be at my house by 9:30 Monday morning. He actually showed up early texting me when he was on his way. My sump pump was not working, he identified the problem quickly. My float had gone bad, he replaced the float with one he had at his shop so there was no ordering parts. Works perfectly now, he even took the time to fix one of my toliets. He was very professional and just a really nice guy. The price was better than I expected especially with the time and effort it took. Will definitely be using his services in the future."
        },
        {
          "reviewer_name": "T Martin",
          "review_text": "Highly recommend! Quality work done efficiently with a great sense of humor!"
        },
        {
          "reviewer_name": "Russell Dulaney",
          "review_text": "My father needed help with his line backing up. Salser plumbing was on time and returned\nMy calls. He pumped the tank and repaired issues at both ends. Very good price and service. I recommend Salser plumbing if your in need of such services."
        },
        {
          "reviewer_name": "Amanda Wilkins",
          "review_text": "Very good at what they do, will recommend them to everyone."
        },
        {
          "reviewer_name": "Andrea Dailey",
          "review_text": "Courteous and knowledgeable people. They did a great job installing filtration system on my house!!!"
        }
      ]
    },
    "morrison-plumbing": {
      "business name": "Morrison Plumbing",
      "reviews": [
        {
          "reviewer_name": "Sonja Taylor",
          "review_text": ""
        },
        {
          "reviewer_name": "Gene Denny",
          "review_text": "What a great service,everything perfect"
        },
        {
          "reviewer_name": "Augownage",
          "review_text": "Great people. Had a water heater installed by them and they did a great job. When the gas valve failed in less than a year (manufacturer defect, not their fault) they worked hard to make sure I didn't have to pay a penny, even though the manufacturer was out of stock on replacement parts due to the shipping and labor crisis. They worked with the supplier to make a warranty claim to replace the entire heater instead. Highly recommended, honest people. Will be calling back in the future."
        },
        {
          "reviewer_name": "Mary Beth Shaddix",
          "review_text": ""
        },
        {
          "reviewer_name": "Burt Klein",
          "review_text": "We have used Morrison plumbing on multiple occasions for work on our homes in Chelsea and Greystone.  The team is very professional, on time, friendly and calls back after the work is complete to make sure we are satisfied.  I highly recommend this team."
        },
        {
          "reviewer_name": "Christin Jones",
          "review_text": ""
        }
      ]
    },
    "poe-s-services": {
      "business name": "Poe's services",
      "reviews": [
        {
          "reviewer_name": "Amber Witcher",
          "review_text": "I would definitely recommend Eric for any job! My lawnmower was leaking oil and wouldn’t start. Eric came to my home around 4:30pm and had my lawnmower fixed and back to me by 7pm. He showed me pictures of where he took everything apart and cleaned it up really nice!  He even sharpened my blade for me!! Looks like a brand new lawnmower!! I will definitely give Eric a call whenever I have any other problem that needs fixing."
        },
        {
          "reviewer_name": "Gina Reynolds",
          "review_text": "Was so kind and very helpful! He'll definitely be my official plumber guy from here on out."
        },
        {
          "reviewer_name": "Erica Castleberry",
          "review_text": "Great work and great prices! 10/10 recommend"
        },
        {
          "reviewer_name": "Codi Whittenberg",
          "review_text": "They go above and beyond. Their work is impeccable I definitely recommend this company. They will be my first call from here on out."
        },
        {
          "reviewer_name": "Tarrah McNeill",
          "review_text": "Worked efficiently on our outdoor lights and doorbell to ensure they worked properly. Friendly, professional, & very resourceful and quick. Would rehire!"
        },
        {
          "reviewer_name": "Katie Nichols",
          "review_text": "Does great work"
        },
        {
          "reviewer_name": "David Henderson",
          "review_text": ""
        },
        {
          "reviewer_name": "Donna McNeal",
          "review_text": "Poe's service provides excellent service and is very reasonable.  Eric really cares about his work and customers.  I highly recommend him.  The best around here."
        },
        {
          "reviewer_name": "David Dobson",
          "review_text": "GREAT LITTLE COMPANY HERE. GLAD I FOUND THEM FOR SURE!!"
        },
        {
          "reviewer_name": "Tony Pugh",
          "review_text": "I think he is the best!"
        },
        {
          "reviewer_name": "Wesley Pugh",
          "review_text": "Does great works"
        },
        {
          "reviewer_name": "Daniel Poe",
          "review_text": "Highly recommended"
        },
        {
          "reviewer_name": "Tony W Miller, Jr.",
          "review_text": "Highly recommend Poe's! Eric and his son came around 7 pm, checked out the problem with our water meter, made a phone call, got the materials he needed and fixed the problem for us. Really glad he came out because we were without water since Friday and we were told that we'd have to wait until about noon tomorrow for America's Rental Managers to get someone out here. Customer service was great. He told me he'd have it fixed for us tonight and he did. After he fixed the water meter he explained what caused it and how he went about fixing it."
        }
      ]
    },
    "hydrotech-plumbing-llc": {
      "business name": "HydroTech Plumbing LLC",
      "reviews": [
        {
          "reviewer_name": "Jacob Phillips",
          "review_text": "Great job as always. He's always ontime and knows his stuff."
        },
        {
          "reviewer_name": "Richard Moses",
          "review_text": "Made the appointment, arrived as promised. Very professional and efficient in his work and great quality repair and install! No mess to clean up and very reasonably priced Highly recommend this company for your plumbing needs."
        },
        {
          "reviewer_name": "Kimball",
          "review_text": ""
        },
        {
          "reviewer_name": "Tyler Keys",
          "review_text": "Hydrotech Plumbing recently did a few projects in our home and we couldn't be more pleased! Michael is first class in his professionalism and in his work. We've found our plumber for any future plumbing needs we may have due to the great work he does.\nWe greatly appreciated his work and we highly recommend Hydrotech Plumbing for any plumbing projects you may have!\n\nThanks again!\n\nKeys Family\nGuntersville Alabama"
        },
        {
          "reviewer_name": "Gary Tuttle",
          "review_text": ""
        },
        {
          "reviewer_name": "Privatestoc2",
          "review_text": "Very Professional, called when he was on his way. Competent, explained the problem, and didn’t waste any time getting it resolved.\nHIGHLY RECOMMEND!"
        },
        {
          "reviewer_name": "Don Minton",
          "review_text": "Michael is awesome"
        },
        {
          "reviewer_name": "Dwaynell Lowe",
          "review_text": ""
        },
        {
          "reviewer_name": "Chris Seymour",
          "review_text": "Michael is great.  Professional.  Knowledge.  Communicates well.  We have used Michael in the past and now again with HydroTech.  Give Michael a call.  You will not be disappointed."
        }
      ]
    },
    "strickland-plumbing-maintenance": {
      "business name": "Strickland Plumbing & Maintenance",
      "reviews": [
        {
          "reviewer_name": "Sharon Snyder",
          "review_text": "Needed some facuet's replaced Colin came out did a remarkable job So professional an fast they look Amazing Such A Great Company to do business with An very reasonable wouldn't have wanted better service!"
        },
        {
          "reviewer_name": "Joey Watson",
          "review_text": "Wow....David and Colin came in and took care of all our faucet and toliet repairs in a flash. Such nice people and really good with our 4 legged guys running around. They were on-time and actually running early and gave me a 30 minutes heads up to see if I was OK with it, which I was glad to hear. I have no problem recommending them or calling them again for plumbing or gas line issues. This is a fantastic small business and very worth your consideration."
        },
        {
          "reviewer_name": "Bailey Zabojnik",
          "review_text": "I cannot speak highly enough of Strickland Plumbing & Maintenance. I called their office one afternoon and within a few hours, they arrived at our house to fix our water leak. They kept us informed throughout the process and explained where the leak was. Do not hesitate to contact Strickland Plumbing & Maintenance!"
        },
        {
          "reviewer_name": "Sabrina Tinsley",
          "review_text": "We have used David Strickland several times for different projects, the latest being the replacement of our hot water heater.  He comes when he says he will be there, he is quick to respond when you call, and he does a great job.  We won't use anyone else."
        },
        {
          "reviewer_name": "Cheryl White",
          "review_text": "This is a fantastic company.  It's owned by an individual, which I like.  But what I like more is that they were on time, did an excellent job on installing a new toilet and a kitchen sink faucet, and it didn't cost the earth.  This is the only company I'll use when I need a plumber."
        },
        {
          "reviewer_name": "Linda Carroll",
          "review_text": "David Strickland installed a gas tankless hot water heater for us this week and, as always, did a fantastic job. David is the only plumber we use & he has helped us for many years. We highly recommend him."
        },
        {
          "reviewer_name": "chris joe",
          "review_text": "We have had Strickland do two home projects for us now. They got it done quickly and professionally. Honest, friendly, locally owned company, and highly recommend."
        },
        {
          "reviewer_name": "Patrick Batey",
          "review_text": ""
        },
        {
          "reviewer_name": "Greg James",
          "review_text": ""
        },
        {
          "reviewer_name": "lc cren",
          "review_text": "David Strickland installed a new sink in our kitchen. He was quick, professional, and very reasonably priced.  Highly recommend him!"
        },
        {
          "reviewer_name": "Joanna Kingery",
          "review_text": ""
        },
        {
          "reviewer_name": "Tracy Mullinax",
          "review_text": "I highly recommend Strickland for all plumbing repairs.  Professional and all around great person!"
        },
        {
          "reviewer_name": "David Price",
          "review_text": "Great service! I've used them twice now for separate issues. Each time they made it out earlier than the appointments and had me fixed within an hour."
        },
        {
          "reviewer_name": "Michael Curtiss",
          "review_text": "If you want a job done right, and to be treated like a customer wants to be treated, then call Strickland Plumbing.  By far the most experienced and professional plumber around. Highly recommended !!"
        }
      ]
    },
    "cobb-underground-llc": {
      "business name": "Cobb Underground, LLC",
      "reviews": [
        {
          "reviewer_name": "Scott Braswell",
          "review_text": "The company and it's workers are very professional and knowledgeable on all things underground..."
        },
        {
          "reviewer_name": "KAH KAH",
          "review_text": ""
        },
        {
          "reviewer_name": "Byron Jones",
          "review_text": "Great"
        },
        {
          "reviewer_name": "Robert Talley",
          "review_text": ""
        },
        {
          "reviewer_name": "SheaShea 1TufAct2Falo “SheaShea” Lawley",
          "review_text": ""
        },
        {
          "reviewer_name": "Stephen Fanning",
          "review_text": "It’s the best"
        },
        {
          "reviewer_name": "Kelley Dunne",
          "review_text": "My company is working with them for some quotes and work in Alabama. Extremely honest, straightforward and truly take a \"Partner\" approach to jobs with other companies."
        },
        {
          "reviewer_name": "Andrea James",
          "review_text": "They get the jobs done!"
        },
        {
          "reviewer_name": "Johnathan Gothard",
          "review_text": ""
        },
        {
          "reviewer_name": "Matthew Lehman",
          "review_text": ""
        },
        {
          "reviewer_name": "Vanassa Roberts",
          "review_text": ""
        },
        {
          "reviewer_name": "El Patron RWise",
          "review_text": "The best group of guys you could ever ask for! They all know the underground world that is for sure!!"
        },
        {
          "reviewer_name": "Barr Plumbing and Bobcat Barr",
          "review_text": "Always gone out of the way to help and done what he was supposed to do"
        },
        {
          "reviewer_name": "steven smith",
          "review_text": ""
        }
      ]
    },
    "r-d-heating-and-air-hvac-maintenance-contractor-heating-and-air-conditioning-service-pell-city-al": {
      "business name": "R & D Heating and Air - HVAC Maintenance Contractor, Heating and Air Conditioning Service Pell City AL",
      "reviews": [
        {
          "reviewer_name": "Allen Rose",
          "review_text": ""
        },
        {
          "reviewer_name": "Eric Perry",
          "review_text": "Have had to use Ron twice now when my AC went out. Last time it was on a holiday weekend, and both times he showed up same day to repair my unit. Funny, professional, personable, and very fairly priced, especially on the holiday visit. I'll use Ron every time fong forward for my AC and HVAC issues! Thanks Ron!"
        },
        {
          "reviewer_name": "David Windsor",
          "review_text": "Ronald did 100% the absolute best job and service we ever had. He was on time, did the job quickly. He was completely polite. With no fowl language. Explained what he was working on, and how it goes the entire way. Also was the best price anywhere. No one could go wrong hiring R&D heating and air. After 2 months our power bill has dropped dramatically. Way to go Ronald and thank you very much."
        },
        {
          "reviewer_name": "Anita Herrington",
          "review_text": "R@D was awesome !! He came out on a Sunday and fixed my air. Very reasonable price  .very pleased"
        },
        {
          "reviewer_name": "Jack Womack",
          "review_text": "These guys are fantastic.   Great service.  Highly recommend."
        },
        {
          "reviewer_name": "Josh Bunt",
          "review_text": "Had a problem with my ac and the owner was nice enough to come after hours and check out what was wrong with it. He was able to get it fixed for a good price."
        },
        {
          "reviewer_name": "Brandon Owens",
          "review_text": "I cannot say enough good things about R & D Heating and Air. If I could I would give this review 10 stars. It’s never easy coming out of pocket for major unexpected purchases but when they happens you want someone you can trust. I’ll tell you now why I trust R & D services\nI needed my 30 year old Hvac unit (R22) and furnaces replaced a few weeks ago and it just  happened to be in the middle of one of the hottest summers in recent memory, and decided to get several quotes from companies in the area. Ron the owner of R &D was extremely knowledgeable and was able to assess my situation and give clear guidance on what we needed. Ron was also able to identify potential roadbumps prior to the install and plan for them which none of the other companies mentioned with my unit being in a very small attic space. Ron and his team worked quickly to get my families air back going and the new unit installed and was able to reconfigure the new unit and add addition safety features to Eliminate the possibility of a leaking into my ceiling which was problem in the past. The workmanship was top notch and I never felt pressured or rushed to pull the trigger. If you are needing HVAC service from a fair, honest, and experienced technician please have a conversation with Ron. I can personally guarantee after that conversation you will be more informed and presented with options around your needs as well as feel confident of your decision afterwards."
        },
        {
          "reviewer_name": "Kristen Walling",
          "review_text": "Mr Ron came to my house on a Saturday night after hours to check my ac unit, so we were very grateful for him to do that. He’s also so nice and friendly, 10/10 recommend.👍"
        },
        {
          "reviewer_name": "Tracy Lee",
          "review_text": "Ron did a fabulous job at installing our new system! We had to go through the insurance process since it was storm related and he was professional and kept up with everything for us that needed to be turned into them for our claim. He showed up when he said he would, he was honest in his diagnosis, and he was more than reasonable in his charges. Sometimes when you have folks out there working on your residence they'll leave trash - not Ron. Minus cold air blowing from my vents, I didn't know he was there! I would recommend Ron over and over again. So long as he is in business, he will be the one I call for all my heating/air needs."
        },
        {
          "reviewer_name": "Chris M",
          "review_text": "R&D installed my A/C, heat pump, heat strips and air handler. My compressor had gone out on our 30yr old Carrier unit. We decided it was a better option to replace the entire unit than to replace the compressor. Ron is super friendly and professional. He explained everything to us in detail and answered any questions we had. He and his crew had our system in and operating in one day. I had quotes from a few different businesses, and R&D beat their prices by thousands. One company had quoted me starting at $7,000 more for an inferior unit. R&D provided us with 10 yr warranties on parts and the compressor and 2yrs on services. I feel like R&D provided us with the most value for our money and we now have a top shelf HVAC system professionally installed by a company that knows their trade inside and out. I would recommend R&D heating and air to anyone that needs any kind of HVAC work done."
        },
        {
          "reviewer_name": "Seth Wells",
          "review_text": "Outstanding services provided by R & D. They came out to service and clean my outdoor unit upon cleaning the unit Ron informed me that my capacitor was bad. They replaced it the same day with ease. Kind, informative, and they treat you like family. They will be my go to."
        },
        {
          "reviewer_name": "Donna Carroll",
          "review_text": "This team is very honest, affordable and efficient. Mr.Dollar was able to fix and replace the part same day and was so kind while doing so. I was very pleased with the service and I plan to use them for all of my heating and air conditioning needs"
        },
        {
          "reviewer_name": "Kim Hall",
          "review_text": "Their HVAC maintenance team arrived on time, fully equipped, and ready to handle any issue I had with my heating and air system. They quickly diagnosed the problem and provided me with several options to fix it. Great job indeed!!!"
        },
        {
          "reviewer_name": "Reece King",
          "review_text": "Heating and Air conditioner fixing service is absolutely brilliant. Use again."
        },
        {
          "reviewer_name": "Cove Calling",
          "review_text": "Outstanding AC work done by Ron and his assistant.  After 37 years, our AC unit finally gave up. On the suggestion of a friend, we called Ron to assess the situation. He came that same night and made a plan to get our unit back up and running.  We are very pleased with his response time and professionalism. Our unit installation wasn't an easy task, but Ron did a quality job. Give this guy a call for your heating and cooling needs. He works hard to make sure things are done right and is a pleasure to work with.  A+++ service!!"
        },
        {
          "reviewer_name": "shannon thomas",
          "review_text": "I was very pleased I will use this company for now on! They took there time and explained everything"
        }
      ]
    },
    "timothy-foster-constrution-company": {
      "business name": "TIMOTHY FOSTER CONSTRUTION COMPANY",
      "reviews": [
        {
          "reviewer_name": "Main Events Lagrange",
          "review_text": "Great company to work with, quality workmanship, would recommend if you need any type of construction work."
        }
      ]
    },
    "harris-county-plumbing": {
      "business name": "Harris County Plumbing",
      "reviews": [
        {
          "reviewer_name": "Deborah Garrette",
          "review_text": ""
        },
        {
          "reviewer_name": "Bridget Kessler",
          "review_text": "I always cringe when I have to call someone I’m not familiar with, but we were very happy our service. He fixed the problem quickly, and we thought the price was reasonable. I’m hoping I don’t need a plumber again anytime soon, but if I do, I would definitely call Harris County Plumbing again."
        },
        {
          "reviewer_name": "Ida Fitzpatrick",
          "review_text": "Parker Tent is respectful and honest.He explained everything he did step by step.He was also on time and very professional.He took his time and did not rush even though it was a Sunday afternoon.He made sure the job was done to my satisfaction.."
        },
        {
          "reviewer_name": "Kit Brown",
          "review_text": "100% JOB PERFECTION... Identified, Assessed and Solved. HCP will be the only one I call for plumbing for now on. NUFF SAID..."
        },
        {
          "reviewer_name": "Danielle B. Scandrick",
          "review_text": "Parker did a great job fixing my kitchen sink. I'd definitely refer him to friends and family. His prices were fair as well."
        },
        {
          "reviewer_name": "Jennifer B",
          "review_text": "The technician was punctual and professional. Answered all questions. We will use for all plumbing needs in the future."
        },
        {
          "reviewer_name": "Captain Money",
          "review_text": "Honest and professional plumber! It feels good when you finally find someone who is good at something and you can rely on them.  For plumbing its Harris County Plumbing for me from now on. Highly recommended. Thanks man."
        },
        {
          "reviewer_name": "Jeffrey Olson",
          "review_text": "Outstanding service!  My water main sprung a leak my side of the meter.  I was desperate to get the problem repaired and water restored to my house.  The gentlemen that runs this business was the only person I could get a hold of in the area that could fix the problem the same day.  While he had to come out later in the evening due to previously scheduled jobs, he had my water main fixed and water restored to my house by  9:00 P.M.  Incredibly helpful and friendly.  I would definitely recommend his work to anyone looking for a great plumber!"
        },
        {
          "reviewer_name": "Steven Catchings",
          "review_text": "Did good work and the work was reasonably priced. He was very punctual and was also willing to give me some advice on other issues I was going to fix. I recommend him to anyone with plumbing issues."
        },
        {
          "reviewer_name": "Monica Hudson",
          "review_text": "Harris County Plumbing is punctual, professional and does top notch work.\n\nWe had a plumbing emergency on Memorial weekend,  and thought we wouldn't be able to find someone to come out.  HCP was at our house within 30 minutes of calling, applied a temporary fix and them resolved the issue first thing Memorial day."
        }
      ]
    },
    "reese-plumbing-llc": {
      "business name": "Reese Plumbing LLC",
      "reviews": [
        {
          "reviewer_name": "Goldie Segredt",
          "review_text": ""
        },
        {
          "reviewer_name": "Anna",
          "review_text": "Great service….Josh was dependable, knowledgeable and offered fair pricing.  I would call again for future service."
        },
        {
          "reviewer_name": "Karen Savage",
          "review_text": "Great service! Josh was quick to return my call and took care of my plumbing issue. Highly recommend you give them a call!!"
        },
        {
          "reviewer_name": "Alexander Shipp",
          "review_text": "Josh did an awesome job. He was responsive to my call/messages, was on time, and repaired our leak quickly. Very professional and reasonably priced."
        },
        {
          "reviewer_name": "Jennifer Hammonds",
          "review_text": "Our second time using Reese and he did an excellent job! Highly recommend!"
        },
        {
          "reviewer_name": "thomas barrett",
          "review_text": "Amazing plumber! Cant say enough about his work! We have used him many times and will with any plumbing problem in the future. Highly recommend!"
        },
        {
          "reviewer_name": "mike Creel",
          "review_text": "Josh did an excellent job on rerouting some water lines for a new shower install. Very courteous and timely . I highly recommend him."
        },
        {
          "reviewer_name": "Corrie Sid",
          "review_text": "Josh has serviced my restaurant several times.  He showed up timely and quickly fixed the issue.  I have recommended him to my friends and family and I will continue to use him for my plumbing needs!"
        },
        {
          "reviewer_name": "Susanna Fillingham",
          "review_text": "Josh was on time and very professional.  His recommendations were practical and he fixed my issue in 30 minutes.  I will be using Josh for all of my future plumbing needs!  Highly recommend!"
        },
        {
          "reviewer_name": "Kenneth Stephens",
          "review_text": "We got a recommendation for Josh from the company who sold us a new kitchen faucet.  We called him after receiving a ridiculous installation quote from our normal plumbers, and Josh did excellent work for a more reasonable price.  He showed up on time.  He was very kind and professional.  He didn’t leave a mess.  I realized that the plumbing he had to connect to was wonky because of a previous bad installation, but he did not complain and he handled the challenge with ease and got everything working in no time.  We will absolutely use Josh from now on for all plumbing work, and we recommend him highly.  It was a stroke of luck to find him."
        },
        {
          "reviewer_name": "Megan Moeshlin",
          "review_text": "My family and I have used Josh twice now. He is such a nice guy. Super professional, got the job done quickly and was very reasonably priced."
        },
        {
          "reviewer_name": "Nancy Jackson",
          "review_text": "Josh did a fantastic job. Very professional, timely and great job. They had to dig up part of our yard but afterwards you could hardly tell. They took great care to make our yard perfect after replacing our pipes. Highly recommend!"
        },
        {
          "reviewer_name": "Haley Cumbie",
          "review_text": "I would definitely recommend Reese Plumbing! I have used Josh’s services twice and was pleased with the results both times. It was easy to make an appointment, Josh showed up on time and was friendly, efficient and professional. He fixed the problems quickly  and I will call him the next time I need a plumber."
        },
        {
          "reviewer_name": "Jessica",
          "review_text": "He has gone above and beyond to fix every problem we have had. Always very nice and polite. And makes sure the job is done right every time!"
        },
        {
          "reviewer_name": "Labé Harris",
          "review_text": "Josh is an excellent plumber who has always shown up, and he has always fixed our issues. He has completed every job with a smile and appreciation. He always answers the phone and is willing to help. If Josh tells you he’s going to be there, he’s there. He keeps the schedule he tells you which really helps on construction jobs. Thanks for the always excellent service, Josh! 5 stars, highly recommend!"
        },
        {
          "reviewer_name": "Mark Pilcher",
          "review_text": "Efficient and courteous plumber."
        },
        {
          "reviewer_name": "Jason Pilcher",
          "review_text": "Awesome service ..Josh did a wonderful job..we use Reese for all our plumbing needs."
        }
      ]
    },
    "twin-river-contractors": {
      "business name": "Twin River Contractors",
      "reviews": [
        {
          "reviewer_name": "Jordan Gates",
          "review_text": "Professional and hassle free! I called and they came out the day after and had everything back to normal in just a couple of hours!"
        }
      ]
    },
    "m-m-pumping-septic-repair": {
      "business name": "M & M Pumping & Septic Repair",
      "reviews": [
        {
          "reviewer_name": "Kristi Howard",
          "review_text": "9/1/23 Mr McGuire came out (Goat Rock area)  due to alarm sounding on my septic. Very quick response time. Super friendly service. Reasonably priced. Highly recommend and will use them in the future."
        },
        {
          "reviewer_name": "James Skater",
          "review_text": "Mr. Ed came out to service my septic tank in Feb 2023.... I had an issue with my septic tank this past weekend,I called Mr. Ed today 05-30-2023 he can came out TODAY and rectified the issue,and told me if I had any other issues not to hesitate to call him.... Not only is  Mr. Ed and his crew professional,Mr.Ed is very personable and friendly....  I  highly recommend M&M for your septic tank needs...."
        },
        {
          "reviewer_name": "Chris Williams",
          "review_text": "Mr Ed I'm assuming the owner, came out this morning 02/03/2023 to Fort Mitchell to service my septic tank, he was very nice,professional and thorough, did a great job.... He wasn't satisfied, until I was satisfied.... Thanks,Mr. Ed GREAT JOB,l definitely will be recommending to my friends and family..."
        },
        {
          "reviewer_name": "Brenda Hooton",
          "review_text": "They were very quick and done a great job."
        },
        {
          "reviewer_name": "Kenneth Gray",
          "review_text": "They are fast, personable and professional. They also, recommended and installed Tank Risers for easy maintenance in the future."
        },
        {
          "reviewer_name": "Kelly T",
          "review_text": "5 Star they always find the source of the problem. Over 10 years I have had 2 issues with my septic pump. The first problem everyone told me I needed a new pump and It couldn't  be repaired. M & M came out and repaired the pump because it just had something wrapped up in the pump saving me hundreds. The next issue, others said we needed a new pump and I called M & M they came out and found my breaker went bad. I will never call another when I have an issue again. They are the most honest, always professional and polite, get to the root of the problem, and find the best solution saving home owners money."
        },
        {
          "reviewer_name": "Sammy Morris",
          "review_text": "Good customer service.  Fast and dependable!!"
        }
      ]
    },
    "kelly-c-williams-plumbing-inc": {
      "business name": "Kelly C. Williams Plumbing, Inc.",
      "reviews": [
        {
          "reviewer_name": "Brandon Langley",
          "review_text": "Great company. Took care of my problem."
        },
        {
          "reviewer_name": "Ian Staley",
          "review_text": ""
        },
        {
          "reviewer_name": "Jamica Broderick",
          "review_text": "Great people to work with. Reasonably priced. I will be using them again if I should ever need a plumber."
        },
        {
          "reviewer_name": "Steven Shellhouse",
          "review_text": ""
        },
        {
          "reviewer_name": "Michael Frazier",
          "review_text": "Nice famly run business. I can't brag enough on the friendliness of them!!!"
        },
        {
          "reviewer_name": "Brandy Mccray",
          "review_text": "Very nice people and did a great job in a efficient time!"
        },
        {
          "reviewer_name": "Mark Simmons",
          "review_text": "Quick and efficient. Nice fella."
        },
        {
          "reviewer_name": "Kimberly Mitchell",
          "review_text": ""
        },
        {
          "reviewer_name": "Rip Pyburn",
          "review_text": "Did a great job at a reasonable price and same day too."
        },
        {
          "reviewer_name": "Rufus Jones",
          "review_text": ""
        },
        {
          "reviewer_name": "Charles Harris",
          "review_text": "I was very pleased with the overall work and putting customers first. They were able to give me a time that the tech would be at my residence and he showed up early I will be using them if any more plumbing issues"
        },
        {
          "reviewer_name": "Kim Martinolich",
          "review_text": "Very friendly,  fare priced."
        },
        {
          "reviewer_name": "Stephen Cannon",
          "review_text": "When its worth doing right! Call my buddy Kelly Williams"
        },
        {
          "reviewer_name": "Cyndi Avera",
          "review_text": "This is one of the few people left in this town with integrity and truly takes care of his customers."
        }
      ]
    },
    "alabama-water-heater": {
      "business name": "Alabama Water Heater",
      "reviews": [
        {
          "reviewer_name": "Lilhotrod",
          "review_text": "So my hot water heater decided to call it kaput two days before Thanksgiving. I called a couple places but they were super busy, and couldn’t get out. I got referred to these guys and they came out the same day. My water heater was shot, and had to be replaced. Jarrett did a great job and cleaned up when he was done. Efficient and on time. I was so glad to have my hot water heater replaced right before the holiday- it would be horrible to have been without hot water on a major cooking holiday!"
        }
      ]
    },
    "fortner-plumbing": {
      "business name": "Fortner Plumbing",
      "reviews": [
        {
          "reviewer_name": "Tiffany Carpenter",
          "review_text": "Worked is in quick to replace our hot water heater and fix two outside faucets that busted. Very knowledgeable and did great work!"
        }
      ]
    },
    "leak-pros-of-al-ga": {
      "business name": "Leak Pros of Al & Ga",
      "reviews": [
        {
          "reviewer_name": "Jimmy 2204 2204",
          "review_text": "Jared was very thorough with explanation of what he was doing and how he was doing it. Very professional and also friendly, easy to talk too. Highly recommended."
        },
        {
          "reviewer_name": "Scott Payne",
          "review_text": "On time, knowledgeable,, experienced, and thorough.\nJust a few words to describe what you’ll experience with the Jared and wife team at Leak Pros.\nAnd did I say trustworthy? That nails it, too.\nWe wouldn’t hesitate to call them again. We are lucky to have found them."
        },
        {
          "reviewer_name": "Jared English",
          "review_text": ""
        }
      ]
    },
    "north-american-heating-and-air": {
      "business name": "North American Heating and Air",
      "reviews": [
        {
          "reviewer_name": "Taylor DuPre",
          "review_text": "Very professional and helpful! Technician showed up on time, was knowledgeable, and answered all of the questions I had. Fixed all of the issues in a timely manner. Would highly recommend!"
        },
        {
          "reviewer_name": "Kathy Weaver",
          "review_text": "Prompt service with a knowledgeable repairman. The technician arrived when scheduled, with a text when he was on his way. Having had a warranty company in the past that had done substandard work including not insulating the coolant pipes where they were dripping in my attic. It was refreshing to have someone explain the issues and be able to fix them quickly, instead of months of waiting with a warranty company only to have it go down again. I am done with warranty companies. North American Heating and Air is who I will be calling."
        }
      ]
    },
    "h2o-worx": {
      "business name": "H2O Worx",
      "reviews": [
        {
          "reviewer_name": "dev booth",
          "review_text": ""
        },
        {
          "reviewer_name": "Nicole Maddox",
          "review_text": ""
        }
      ]
    },
    "autauga-county-handyman": {
      "business name": "Autauga county handyman",
      "reviews": [
        {
          "reviewer_name": "Beckman Caver",
          "review_text": "very well mannered young man. and a very hard worker!!! he was up at the crack of dawn working on my house and turned a 3 day job into a one and a half!!!!"
        },
        {
          "reviewer_name": "Abby Kirkland",
          "review_text": ""
        },
        {
          "reviewer_name": "Gerry Wagner",
          "review_text": "Very fast and great communication.  On time. Awesome work 👍"
        },
        {
          "reviewer_name": "Trinity Wagner",
          "review_text": ""
        },
        {
          "reviewer_name": "kendal maddox",
          "review_text": "very communative!"
        }
      ]
    },
    "brian-harden-plumbing-inc": {
      "business name": "Brian Harden Plumbing Inc.",
      "reviews": [
        {
          "reviewer_name": "Tina Little",
          "review_text": ""
        },
        {
          "reviewer_name": "Dewey Koger",
          "review_text": "Good"
        }
      ]
    },
    "alabama-septic-service": {
      "business name": "Alabama Septic Service",
      "reviews": [
        {
          "reviewer_name": "Renald Ramson",
          "review_text": "We are incredibly grateful for the septic tank cleaning service we received. The team was professional, efficient and ensured our system is running smoothly again. Their work has made all the difference to us! Highly recommended for anyone needing a reliable and trustworthy maintenance partner!"
        }
      ]
    },
    "b-b-torch-regulator-and-repair-service-llc": {
      "business name": "B & B Torch Regulator and Repair Service LLC",
      "reviews": [
        {
          "reviewer_name": "Steven Estrada",
          "review_text": "This a great place.  He has repaired my welding equipment efficiently and he knows what he is doing."
        },
        {
          "reviewer_name": "Kenneth Williamson",
          "review_text": ""
        },
        {
          "reviewer_name": "Etta Beatty",
          "review_text": ""
        }
      ]
    },
    "sims-plumbing-air": {
      "business name": "Sims plumbing & air",
      "reviews": [
        {
          "reviewer_name": "Allyson Oakley-Dobbins",
          "review_text": "Anthony came quickly, was highly efficient, friendly and resolved the issue. He even showed my very curious toddler the tools he was working with.\n\nI called him after another plumber gave us a bogus quote and let him know the situation. He said he’d be right over. Anthony resolved the issue and did not charge us an arm and a leg."
        },
        {
          "reviewer_name": "Kristie Hayes",
          "review_text": "Mr. Awesome (Anthony) is friendly, honest, fast but excellent at his work, & cleans up after himself. Fair & affordable. Highly recommended.we will definitely keep doing business with him."
        },
        {
          "reviewer_name": "Shannon Good",
          "review_text": "Best service around. Came out quick and took care of all of our issues at an affordable price. Will definitely use them again!"
        },
        {
          "reviewer_name": "Rachel Pohl",
          "review_text": "Anthony was fantastic -- I by accidentally dropped a ring down the toilet, and Anthony came within an hour on a Sunday and found the ring. Great service - professional and on time. Would highly recommend!"
        },
        {
          "reviewer_name": "jennifer catlett",
          "review_text": "Anthony has repeatedly helped my family as well as many real estate clients for me. He always provides repairs with quality workmanship and professionalism. He is honest and will never try to take advantage of you!"
        },
        {
          "reviewer_name": "Stephanie Heinrich",
          "review_text": ""
        },
        {
          "reviewer_name": "Ali Fugatt",
          "review_text": ""
        },
        {
          "reviewer_name": "Victoria",
          "review_text": "I will never have enough good things to say about Anthony. We have used him many times for various plumbing repairs in a hotel setting. He is friendly, communicative, competitively priced, and incredibly knowledgeable and efficient. I’d give him 12 stars if I could!"
        },
        {
          "reviewer_name": "Garrett Leggett [Student]",
          "review_text": "Anthony came to fix my water heater. I was expecting to pay for a brand new heater, but he made sure to avoid that at all costs if possible. He fixed my TPR valve in a matter of 15 minutes. His expertise and integrity will only continue to bring him far!"
        },
        {
          "reviewer_name": "Annette V",
          "review_text": "We will only use this company for our home and business needs. Very professional, quick to respond, honest, affordable and courteous!!  Top notch competency and knowledge!!  Highly recommend!!"
        },
        {
          "reviewer_name": "Shane Mathis",
          "review_text": "After having a plumbing emergency over the weekend and calling several local plumbers who was only interested in seeing how much money they could charge me..I finally got a hold of Anthony with Sims Plumbing and Air. Anthony was straight up with me from the very first phone call and his honesty literally saved me thousands. HIGHLY RECOMMEND!"
        },
        {
          "reviewer_name": "scottie brown",
          "review_text": "Anthony never answers the phone never calls back! He did a small job for me I tried calling him back to do more work and it’s like he feel off the face of the earth! A plumber is hard to find a good one for sure!"
        },
        {
          "reviewer_name": "Charlotte Ellington",
          "review_text": "Anthony was highly recommended to me and his work is 100%!  He is professional yet friendly, works quickly and efficiently.  It is obvious he knows his craft.  I had a clogged drain that proved to be a bit of a challenge.  But Anthony knew exactly what to do and BAM!  Drain cleared.  Also, he is very neat and cleaned up any drips.  I highly recommend his services and will use again!!"
        },
        {
          "reviewer_name": "Abby Murphy",
          "review_text": "Great plumber, able to fix our shower when roto-rooter couldn't. Thank you!"
        },
        {
          "reviewer_name": "Robert Devlin",
          "review_text": "Very honest man."
        },
        {
          "reviewer_name": "Kelcey Windatt",
          "review_text": "Very knowledgeable and went above and beyond to make sure we understood everything that was done. Also went out of his way to make recommendations that will help us in the future."
        },
        {
          "reviewer_name": "Theresa Howell",
          "review_text": ""
        },
        {
          "reviewer_name": "Whitney Stalans",
          "review_text": "Wonderful service."
        },
        {
          "reviewer_name": "will sands",
          "review_text": "great job. honest. fair price"
        },
        {
          "reviewer_name": "Jesse Rademacher",
          "review_text": "We returned from vacation only to find a broken air conditioner and a sweltering house. Sims Plumbing and air showed up on short notice and worked quickly even though it was raining. They fixed the issue quickly and it's already starting to feel cooler in the house. Thanks, Chris and Anthony for being friendly and fast!"
        },
        {
          "reviewer_name": "Randy Saunders",
          "review_text": "Needed 6 cut off valves and they did a great job and the cost was a fair price. Also gave me good advice about replacing my corroded waterline nipples. Will use Sims Plumbing again."
        },
        {
          "reviewer_name": "Mark Waldrop",
          "review_text": ""
        },
        {
          "reviewer_name": "mike hughes",
          "review_text": "Super fast and helpful, only fixed what was nessisary and was affordable."
        },
        {
          "reviewer_name": "Taylor Ferguson",
          "review_text": "Myself and my business partner hired them to come out and reroute plumbing and install new shampoo bowls for our salon. We are so pleased with the results! Anthony and Liz were prompt and professional. They went above and beyond for us. We would recommend them for any plumbing needs!"
        },
        {
          "reviewer_name": "Mindy June Kelly",
          "review_text": "Referred by a friend. Service was quick, efficient, and professional. I cannot recommend Sims enough when you need work done in plumbing or HVAC!"
        },
        {
          "reviewer_name": "Rob Smith",
          "review_text": "A Master plumber.  Fixed a leaky shower with body sprays better than when it was new.  Watched the whole operation and was amazed at his attention to detail and knowledge. I will gladly recommend him to friends and family."
        },
        {
          "reviewer_name": "jacob Updike",
          "review_text": "He came out late at night and on a short notice and did a great job we whold hire him again"
        }
      ]
    },
    "a-c-e-plumbing-solutions": {
      "business name": "A.C.E. Plumbing Solutions",
      "reviews": [
        {
          "reviewer_name": "Bob and Debbie Stretch Silverleaf Realty Group",
          "review_text": "They showed up on time. Communication was excellent.\nI will definitely will use you again.\nThank you Austin!"
        },
        {
          "reviewer_name": "B Wil",
          "review_text": "Service was easy to schedule, employee was early and was able to complete all task as explained. Absolutely recommended"
        },
        {
          "reviewer_name": "Robin Garriga",
          "review_text": "Arrived on time, clearly explained items needing attention, and reviewed work to be sure I was satisfied. Exceptional service."
        },
        {
          "reviewer_name": "Cana O'Brien",
          "review_text": "Austin was polite, professional and tidy. It took less than 45 mins to do the job and check for leaks. Thank you."
        },
        {
          "reviewer_name": "Wayne Jones",
          "review_text": "Perfect work, very satisfied"
        },
        {
          "reviewer_name": "Nicola Pounders",
          "review_text": "Used A.C.E for a job at one of my rentals and safe to say, we have found our new go-to guy. Arrived when he said he would (actually early), communicated effectively, did the job right the first time. Really refreshing to finally find a reliable contractor around here."
        },
        {
          "reviewer_name": "Judy Blakely",
          "review_text": "Excellent service and super responsive! I would highly recommend Austin!"
        },
        {
          "reviewer_name": "Kyle Hauser",
          "review_text": "I just used ACE plumbing today 26 Nov 2024 and he was great. He showed up earlier than anticipated, was easy to communicate with and did an awesome job fixing the mess I made. Highly recommend his services and will use again."
        },
        {
          "reviewer_name": "Shaun Arntz",
          "review_text": "Austin was very responsive, professional, and precise. He installed a garbage disposal for us."
        },
        {
          "reviewer_name": "Jennifer Kotowske",
          "review_text": "Fast and courteous service with reasonable cost! Will be using A.C.E. for all of my plumbing needs."
        },
        {
          "reviewer_name": "S Nunes",
          "review_text": "Quick and easy fix.  Austin was super nice too!"
        },
        {
          "reviewer_name": "Karen Hamilton",
          "review_text": "Great service!"
        },
        {
          "reviewer_name": "Brittni Aycock",
          "review_text": "Professional and efficient plumbing service!"
        },
        {
          "reviewer_name": "Dawn Crum",
          "review_text": "A.C.E. Plumbing Solutions is owned and operated by Austin Elliott.  Austin has helped my Family with several plumbing issues. He shows up in a very timely manner and gets the job done!   If you need a plumber Austin is your guy!"
        },
        {
          "reviewer_name": "Collins & Company",
          "review_text": "great quality service!"
        },
        {
          "reviewer_name": "Matt Hutchison",
          "review_text": ""
        },
        {
          "reviewer_name": "Wrenn Colliatie",
          "review_text": "Highly highly recommend Austin with ACE!\nHe was extremely prompt and professional updating the plumbing on my business."
        },
        {
          "reviewer_name": "Martha Alexander",
          "review_text": "Very professional.  I highly recommend A.C.E."
        },
        {
          "reviewer_name": "Lakin DeVaux",
          "review_text": "Thank you for your hard work and dedication to getting my job done so fast."
        },
        {
          "reviewer_name": "Courtney Thornton Smith",
          "review_text": "He showed up when he said he would, and worked in a timely manner. Austin communicated with us and always answered his phone. Recommend him and his services!"
        },
        {
          "reviewer_name": "Jessica Olson",
          "review_text": "Austin is amazing, very responsive to calls and easy to schedule. Did the work fast and professional\nHighly recommend!!!"
        },
        {
          "reviewer_name": "Jennifer Vo",
          "review_text": ""
        },
        {
          "reviewer_name": "Lauri Cook",
          "review_text": "Highly recommend! Prompt response, knowledgeable and efficient work. Reasonable pricing. Call for all plumbing needs. Showed up when he said he would and didn’t waste my time."
        },
        {
          "reviewer_name": "kcking565",
          "review_text": "Thank you so much for coming on such short notice! Austin was so professional and quick to complete the job! Everything was spotless after he left! I would highly recommend Austin with ACE plumbling solutions to all of my friends and family!"
        },
        {
          "reviewer_name": "Michael Dutton",
          "review_text": "Austin at ACE Plumbing is the best! He’s down-to-earth, trustworthy, and always gets the job done right. No shortcuts or half-done work—he takes pride in doing things properly. Whenever I have a plumbing issue, I know exactly who to call. If you want reliable, top-quality service, go with ACE Plumbing!"
        }
      ]
    },
    "central-fire-protection": {
      "business name": "Central Fire Protection",
      "reviews": [
        {
          "reviewer_name": "Scotty Martin",
          "review_text": ""
        },
        {
          "reviewer_name": "Sylvia Bell",
          "review_text": "I had a wonderful experience there were\nTwo tech that were hilarious and professional.They make you feel apart of the inspection.But they test and test again to make sure you're gonna be safe and I'm telling everybody to choose Central station for all your fire protection needs"
        },
        {
          "reviewer_name": "Tray",
          "review_text": ""
        },
        {
          "reviewer_name": "Stephanie Agee",
          "review_text": "Everything was okay"
        },
        {
          "reviewer_name": "Hilario Rodriguez",
          "review_text": "Chingó es mi trabajo"
        },
        {
          "reviewer_name": "Josh Hillman",
          "review_text": "Central Fire Protection handles all our fire sprinkler and alarm needs.  Great company to do business with!!"
        },
        {
          "reviewer_name": "Hilario Rodríguez",
          "review_text": ""
        },
        {
          "reviewer_name": "Alex Dotson",
          "review_text": ""
        }
      ]
    },
    "tracy-duncan-plumbing": {
      "business name": "Tracy Duncan Plumbing",
      "reviews": [
        {
          "reviewer_name": "Gran Luella",
          "review_text": "Very nice and efficient.\nReasonable prices too!\nIf we ever have another emergency we will definitely call them again."
        },
        {
          "reviewer_name": "Gail Goldberg - Naylor",
          "review_text": "Excellent company. Very reasonable. Friendly and knowledgeable. Got here sooner then later. Didn't Gouge\nme as far as cost. Sure beats Roto-Rooter"
        },
        {
          "reviewer_name": "Ernesto Ramirez",
          "review_text": "I got an estimate from Tracy and even though I ended up not using him for the repair I needed I still applaud his service and friendliness."
        }
      ]
    },
    "ramos-handyman-services": {
      "business name": "Ramos Handyman Services",
      "reviews": [
        {
          "reviewer_name": "Jon Medley",
          "review_text": "We've had him come out on two seperate occasions for screen porch work, refinishing a half bath, painting concrete, flooring a kitchen.  Shows up when he says, finishes when he says, and does great work.  10 out of 10 recommend."
        },
        {
          "reviewer_name": "Buck n Doe",
          "review_text": "We live in Florida and have a place in Greenville Al. Searched the local area and reviews and found Mr. Ramos.  He was always here when he said he would be. He was easy to work with. He installed our flooring and it turned out so good! We love it and recommend him for all of your handyman needs."
        },
        {
          "reviewer_name": "Shana Keeney",
          "review_text": "We recently had Ramos Handyman Services to the house for some home repairs/remodels/touchups. I can't say enough good about them. They did an excellent job down to the letter. They were extremely efficient and on time every day. They also cleaned up after themselves extremely well after the end of everyday, which I really appreciated. Sherman and all of the guys working with him were extremely nice and my husband and I were very comfortable having them in our home when we couldn't be there. We plan to have more remodel work done after the first of the year and are only interested in getting this company back to do it. Thank you again and we are extremely happy with how fantastic everything looks!"
        },
        {
          "reviewer_name": "Alyson Adams",
          "review_text": ""
        },
        {
          "reviewer_name": "Jeff Roman Clayton IV",
          "review_text": "He can make it happen!"
        },
        {
          "reviewer_name": "Case Coker",
          "review_text": "Best handyman in the business!! Highly recommend!!"
        },
        {
          "reviewer_name": "Taylor Clayton",
          "review_text": "Has done excellent renovation work on our church! Highly recommend!"
        },
        {
          "reviewer_name": "Brittany Clark",
          "review_text": ""
        },
        {
          "reviewer_name": "Daryl Bonner",
          "review_text": "Fantastic company! I would highly recommend them for any carpentry work you may need to have done. They were very flexible to our needs. The installers are prompt, professional, and do great work. Not only did they do a beautiful job installing our laminate flooring and replacing the drywall, but artfully worked around other trades (electricians, painters, plumbers) to meet our deadline. I have no reservations recommending Ramos Handyman Services for any job....big or small, residential or commercial....they are simply the best!"
        }
      ]
    },
    "quality-plumbing-co": {
      "business name": "Quality Plumbing Co.",
      "reviews": [
        {
          "reviewer_name": "Alexanne Bobo",
          "review_text": ""
        }
      ]
    },
    "lovelace-service-heating-air": {
      "business name": "Lovelace Service Heating & Air",
      "reviews": [
        {
          "reviewer_name": "Ben Young",
          "review_text": "I've used this company several times through a warranty company.  Every time they come, they do the job and more.  Very clean and very professional."
        },
        {
          "reviewer_name": "Craig Story",
          "review_text": "Jeremy is an awesome technical, fixed all appliances, greatly appreciated his service"
        },
        {
          "reviewer_name": "Gary Duncan",
          "review_text": "We were assigned Lovelace Service Heating & Air through our home warranty company.  We were having issues with our GE Refrigerator. What a great experience!  From Summer in the office who took my call to Jeremy the service tech that came to repair the refrigerator everyone was great.  Jeremy was very knowledgeable, professional and patient when answering our questions. 5 Stars for Jeremy.  Based on our experience with this service call, we highly recommend Lovlace Service Heating & Air."
        },
        {
          "reviewer_name": "Kavena Davis",
          "review_text": "Lynn the guy that fixed our a/c unit is the best I recommend this company to anyone that's having any a/c or heating problems!!!great customer service , quality work and just all around great people!!!!"
        },
        {
          "reviewer_name": "Daniel Buckingham",
          "review_text": "Unbelievable customer service, Jeremy installed an LP conversion kit to our gas dryer, after multiple other companies passed on the job due to inexperience or job was too much work.  Due to it being a newer model dryer, he had to open up the entire dryer and even remove the tumbler to access the jets to be replaced, and then put the entire dryer back together.  I highly recommend Lovelace Service Heating and Air.   I will be using them in the future for all my other jobs."
        },
        {
          "reviewer_name": "Daris Borden",
          "review_text": "Great service from Jeremy! Very professional, courtesy, and knowledgeable on the washing machine repair. Thanks, Jeremy, for doing a great job! Much appreciated!"
        },
        {
          "reviewer_name": "FARRELL MOULTRY",
          "review_text": "The TECHNICIAN from LOVELACE APPLIANCE REPAIR was AWESOME, AWESOME very PROFESSIONAL, COURTEOUS,the SERVICE was very EXPEDIENT, after 3 different TECHNICIANS from SEARS APPLIANCE REPAIR and waiting on them for 3 WEEKS, I was told by FIRST AMERICAN HOME WARRANT to call an APPLIANCE REPAIR SERVICE and I called LOVELACE APPLIANCE REPAIR, the EXCELLENT TECHNICIAN REPAIR the DRYER the same day, where the 3 SEARS REPAIR TECHS failed on 3 attempt to REPAIR the DRYER, I reccomend to all VETERANS as iam,if you need an APPLIANCE REPAIRED definitely call LOVELACE APPLIANCE REPAIR, I will definitely urge FIRST AMERICAN HOME WARRANT to terminate, whatever CONTRACT they may have with SEARS, if you want COMPETENT, EFFICIENT ,PROMPT APPLIANCE REPAIR SERVICE call LOVELACE APPLIANCE REPAIR, they are definitely the VERY BEST  ,THANKS for the EXCELLENT SERVICE, LOVELACE APPLIANCE SERVICES are most definitely a 5 STAR TECHNICAL APPLIANCE SERVICES"
        },
        {
          "reviewer_name": "Konstance Chambliss",
          "review_text": "Quickly diagnosed the problem with my dryer and resolved it. I will definitely recommend them and use their services if I have any appliance issues."
        },
        {
          "reviewer_name": "Teresa Carter",
          "review_text": "Jeremy was professional and informative.  This is the second time Jeremy has been in to repair an appliance.  He called and came as scheduled and cleaned his work area. I highly recommend Lovelace Repair and Jeremy as well!!"
        },
        {
          "reviewer_name": "Investments Nickie",
          "review_text": "Jeremy was Great 👍 at what He did,  nice personality and very Professional and Clean work ethic."
        },
        {
          "reviewer_name": "Steve Henderson",
          "review_text": "Friendly and knowledgeable techs. Had part on truck and was finished quickly."
        },
        {
          "reviewer_name": "B L",
          "review_text": "Lovelace never gave up on us! Warranty company kept giving us the run around and they easily could of said screw it but didn’t! They communicated with my husband and I very well on everything and Chris was our technician he was professional, honest, dependable etc. with our entire experience definitely recommend them for any ac/heating issues you have forget the warranty companies just call Lovelace directly. You definitely won’t be disappointed!\nThanks so much for getting our unit back up and running we appreciate each of you!"
        },
        {
          "reviewer_name": "mitchell m",
          "review_text": "Our warranty company scheduled an appointment with Lovelace Services for tomorrow (8/24/2023).  Chris called today (8/23/2023) stating that he was in the area and could work on our system when he finished with the call he was currently working.  As promised, he called to give us a heads up that he was on his way.  He was courteous and professional.  Got right to work and found that 2 capacitors had blown.  He hooked everything up to monitor the system and noted that the fan wasn't moving as fast as it should have been.  He found that the fan motor was burnt out and this is what caused the capacitors to blow.  He quickly replaced the fan motor and ensured that everything was working properly before he left."
        },
        {
          "reviewer_name": "Danny G",
          "review_text": "I absolutely adore Lovelace services, they have got to be the best place to get your AC fixed. The technician that worked on my unit his name was Lynn he was incredibly helpful and very professional."
        },
        {
          "reviewer_name": "Tracey Gipson",
          "review_text": "They did a great job fixing my dryer."
        },
        {
          "reviewer_name": "The Bartlett Home Team",
          "review_text": "Jeremy Cowan is our super-hero!!🙌 He was communicative, timely, professional and friendly. After an extremely negative experience with a different repair technician, we were leery to have anyone else try to help.\n\nI am so glad we kept our appointment with Jeremy! We have been without a dishwasher for about a month and a half due to our last experience with the previous dishwasher repair person. The original repair person told us our dishwasher was not leaking. He stated he was unwilling to pull the dishwasher out from under the counter and we would need to completely remodel our kitchen in order to get the dishwasher out. He also stated he was going to order a part to repair the damage our dishwasher was causing when it leaked. This technician never returned and we never heard from him again. (Thankfully he did not return, due to his complete incompetence, lack of knowledge, and absence of any pride in his workmanship.)\n\nJeremy was easily able to not only repair our dishwasher, he simply pulled it out from under the counter, connected the hose that was disconnected and causing the leak, and stayed to test the dishwasher more than once to be sure there were no remaining leaks or anything he may have missed.\n\nThe dishwasher is fully functional and we are incredibly grateful! We highly, highly recommend Jeremy for any service issues!!\n\nJeremy is highly-skilled at his craft and takes pride in his workmanship. In today's world, this is a rarity. We wish we could give him more than 5 stars!! 🌟 🌟🌟🌟🌟🌟🌟🌟🌟🌟"
        },
        {
          "reviewer_name": "Doris Lawler",
          "review_text": "Linn Hollis is a great HVAC technician. He was efficient but took the time to tell us what the problem was and even showed us the part that was replaced. We are very happy with the service given with this company."
        },
        {
          "reviewer_name": "Patricia Thomas",
          "review_text": "Jeremy was awesome! Our refrigerator was leaking and he had it fixed in no time at all! Will recommend Loveless to my friends and family for their appliance repair needs! Jeremy gets a 5 star rating from us."
        },
        {
          "reviewer_name": "Reginald Surles",
          "review_text": "The technician arrived to my home and immediately asked me if I had done some work crucial to understanding my issue. Once he got the response he swiftly solved my problem and I am customer for life if I ever need their services again. Top rate professional. Thank you thank you thank you."
        },
        {
          "reviewer_name": "Michael Stacy",
          "review_text": "Jeremy is without an equal in his customer service.   Talented, professional, knowledgeable and skilled.  He knew exactly what he was doing. I would recommend him without hesitation."
        },
        {
          "reviewer_name": "J. Travis Doyle",
          "review_text": "Lovelace was able to come out and diagnose the problem quickly. After the parts came in, they promptly called to setup an appointment and have the service repair done. Washing machine isn't leaking anymore and runs great. Fixed the outer seal and LCD screen that was bubbling. Thank you."
        },
        {
          "reviewer_name": "Elbert Smith",
          "review_text": "Repair done to our kitchen aide refrigerator.  Jeremy was our repair technician. He was very professional/  knowledgeable and was very careful/took extra effort to ensure that no damage occurred to our wood floors when he moved the refrigerator into a position where he could work on it.  Also Lovelace was responsive to our questions and worked with our home warranty company to get parts ordered.  We will definitely use Lovelace again and will request Jeremy for any of  our appliance repair needs!"
        },
        {
          "reviewer_name": "Ann Marie Crosswhite",
          "review_text": "My refrigerator was leaking. They sent Jeremy to do the repair. He was on time, courteous and professional.  He diagnosed the problem. Had to go get a part and returned to fix the unit that afternoon. He was very thorough.  My fridge has been repaired.  I would definitely recommend Lovelace Services for appliance repair. Very satisfied with the service."
        },
        {
          "reviewer_name": "Danisha Toney",
          "review_text": "Jeremy was very professional and honest. He repaired my refrigerator. If you need any appliances repaired, he is your guy!! Thanks Jeremy!"
        },
        {
          "reviewer_name": "Debbie Hill",
          "review_text": "I’ve had major plumbing issues that killed my washing machine.\nMr. Jeremy Cowan came over at a time that worked best for me and he knew exactly what to do to fix our issue! He was a pro and I’m truly thankful for his expertise! Great company to do business with for sure!"
        },
        {
          "reviewer_name": "Jessie Engle",
          "review_text": "Jeremy C. With Lovelace Services was great!\nHe represents the company with great pride and integrity. I love that I didn’t have to sit around the house waiting on him. He give me an hours notice so i could continue with my day! Thanks again Jeremy ⭐️⭐️⭐️⭐️⭐️⭐️"
        },
        {
          "reviewer_name": "Veronica Leftridge",
          "review_text": "Our washing machine broke down on Monday, and Jeremy quickly arrived at our house on Tuesday. I appreciated his text message informing me that he was on his way to our house. He explained the issue and made recommendations. Despite the inclement weather, he purchased the parts the same day and repaired the appliance. I recommend Jeremy to anyone who is experiencing issues with their home appliances."
        },
        {
          "reviewer_name": "Teresa Sharp",
          "review_text": "Jeremy was wonderful! Both our washer and dryer broke down and he worked long and hard to bring them back to life! Highly recommend him!"
        },
        {
          "reviewer_name": "B J",
          "review_text": "Outstanding service from Lovelace Services. They arrive on time and always make sure my Air Conditioner is working. I strongly recommend Lovelace Services."
        },
        {
          "reviewer_name": "Sherry Cantrell",
          "review_text": "Jeremy, the service tech for Lovelace, was pleasant, professional, and willing to explain the work he was doing. He diagnosed the problem and completed the job to my satisfaction."
        },
        {
          "reviewer_name": "Brandy Olander",
          "review_text": "They are amazing! Great to work with and really care about customers."
        },
        {
          "reviewer_name": "Green Eyes",
          "review_text": ""
        },
        {
          "reviewer_name": "Lainee67",
          "review_text": "I called for possible maintenance of my mom’s a/c window unit. The service guy (can’t remember name) gave an honest assessment and advised on a new unit. We knew the one we had was very old. He also assessed some home repairs needed due to water damage from the a/c unit. My mom did purchase a new window unit from Lowe’s and two days later he returned as promised to install it. Very friendly and professional. We would use them again."
        },
        {
          "reviewer_name": "Angela Vasquez",
          "review_text": "We have had AC issues for a bit. Our home warranty company assigned us to a different company first and they did repairs that only lasted a day or two. When we had another issue we were assigned to Lovelace. They came out within the week. We have two units so within the week was fine for us.  The technician was very professional and seemed to know his trade. He pointed out what the other company had done wrong. He figured out we needed a new part and had someone bring it to the house that day and stayed until the repair was made. We really appreciate him going that extra mile after being taken for a ride by the other company."
        },
        {
          "reviewer_name": "Max Eddy",
          "review_text": "Honest and very competent. Great team of professionals."
        },
        {
          "reviewer_name": "Emma Whatley",
          "review_text": "Great service, great workers!"
        },
        {
          "reviewer_name": "Malcolm Davis",
          "review_text": ""
        },
        {
          "reviewer_name": "Jarell Smith",
          "review_text": "Chris has been to my house on two different occasions. He recently just fixed my AC and it’s working like new. Thank you Lovelace Services!"
        },
        {
          "reviewer_name": "Jefferson Varner III",
          "review_text": "I have come to realize since retiring from the military there are still good service and great people in this world.  For all of the BS we experience and see on TV this is another example of Southern Hospitality that is seldom spoke of.  My Tech  was and is Mr. Pope.  The young man is very professional and knows his business.  Office folks are personable as well.  You can't go wrong!!! Thank you again.\nJefferson Varner III"
        },
        {
          "reviewer_name": "Cindy Bates",
          "review_text": "They were very professional!"
        },
        {
          "reviewer_name": "TIGER",
          "review_text": "Great company. Honest and trustworthy and price was much less than the others."
        },
        {
          "reviewer_name": "Ariel Barnett",
          "review_text": "They did an Amazing job replacing our unit. Thanks"
        },
        {
          "reviewer_name": "Chris Tucker",
          "review_text": "We found Lovelace through our home warranty company. Called for an AC unit not working correctly. Chris called us within just a few hours of our claim (they technically have several days). Came out right away - diagnosed the problem, got parts lined up, and got the claim approved with the warranty company within an hour. He went out of his way to have the parts expedited because they were not in stock. Our unit was repaired the next day - all within 24 hours of making the claim. We are very happy with our experience and would recommend to anyone."
        },
        {
          "reviewer_name": "The Bonsai Boi (JCO)",
          "review_text": "I didn't actually have Lovelace perform any work for me.  He (Chris the Owner) purchased a piece of equipment from me actually.  You can get a good take on someone's character when dealing with them on a major purchase. Clear, concise, extremely friendly and actually fun to work with.  If Lovelace runs their service anything like they carried themselves through this transaction look no further for your heating & air needs.  Quality people in turn do quality work.  Best wishes Chris and crew. It was my pleasure."
        },
        {
          "reviewer_name": "Thomas",
          "review_text": "Great service. Fixed my AC within 30 minutes. Great price. Would recommend to anyone."
        },
        {
          "reviewer_name": "Heath Sockwell",
          "review_text": "HVAC (heat pump) messed up. Called this place. Awesome serviceman came by and diagnosed & repaired in a snap. Plus helped with wiring issue I didn't even know about. Plus: pretended not to notice my messy house when we had to look inside. Super nice & respectful! Did not talk down to me like others have in the past (for my obvious lack of HVAC knowledge). Thanks Mr Houston!  All of our toes are toasty now!"
        },
        {
          "reviewer_name": "Douglas Kobobel",
          "review_text": "The other guys tried to string arm me into replacement but Lovelace was honest and fair.  Repaired my A.C. at a more than reasonable rate with quick and efficient service...top notch and highly recommended!"
        },
        {
          "reviewer_name": "JARELL SMITH",
          "review_text": "I called my home warranty (CHW) to get my oven checked out and they sent Lovelace Services based in Decatur, AL. These guys were fantastic.\nHouston really took care of all my needs!\nI asked for his business card to make sure these guys would be the ones to take care of any future inquiries!"
        },
        {
          "reviewer_name": "Carol Foster",
          "review_text": "Simply the Best of the Best of appliance repair companies.  They do the job completely and thoroughly the first time!  We have even had them come out and fix other companies mistakes that have been sent by our home warranty company.  I wouldn't trust anyone else with my appliances and HVAC!  Simply a great, honest company which is more rare than diamonds these days!"
        },
        {
          "reviewer_name": "Karin Treski",
          "review_text": "Awesome company! These guys really care and are very pleasant to work with!"
        },
        {
          "reviewer_name": "Steve Garner",
          "review_text": "I highly recommend them"
        },
        {
          "reviewer_name": "Rachel H",
          "review_text": ""
        },
        {
          "reviewer_name": "Teshika Holmes",
          "review_text": "Great HVAC company and the techs were excellent. I'm now in favor of this company as they came out quickly after I filled a claim with my home warranty company."
        },
        {
          "reviewer_name": "Angela Laughlin",
          "review_text": "Our warranty company put us in touch with Lovelace a couple of years ago and we are so grateful. They have been so good to us and have worked on our gas oven, our central unit (both AC and heat) and even looked at our refrigerator (it was beyond any help). We couldn't ask for a nicer or more honest group of people with whom to do business. I am hard to please and it takes a lot to earn my trust, but they have done both. We will continue to use them as long as they are around. You cannot go wrong with Lovelace!"
        }
      ]
    },
    "right-a-way-rooter": {
      "business name": "Right-A-Way Rooter",
      "reviews": [
        {
          "reviewer_name": "Don Hughes",
          "review_text": "Field line service performed three years ago, no problems since. Very good."
        }
      ]
    },
    "stinnett-heating-cooling": {
      "business name": "Stinnett Heating & Cooling",
      "reviews": [
        {
          "reviewer_name": "Eric Espinoza",
          "review_text": "Was having problems with the ac called on a Saturday they came and replaced the unit the same day quick  efficient work guys did a great job"
        },
        {
          "reviewer_name": "Paige Johnson",
          "review_text": "Very professional and walked us through our options. Would highly recommend them!"
        },
        {
          "reviewer_name": "Cindy Lee",
          "review_text": "They came out quickly, found my issues and fixed it.."
        },
        {
          "reviewer_name": "Leda Croley",
          "review_text": "My experience with Stinnett Heating & Cooling has been awesome!!!  I can't say enough good about my experience.  They truly understand the meaning of customer service and practice it."
        },
        {
          "reviewer_name": "Saul Dagnino",
          "review_text": "They call me back within 30 min to come out and check my unit. Top notch service."
        },
        {
          "reviewer_name": "Lehn Lambert",
          "review_text": "Another great service. Called early this morning and they were here by noon and fixed the problem. Waylon is a very knowledgeable, friendly young man. Office staff is great, also."
        },
        {
          "reviewer_name": "John Morse",
          "review_text": "The tech was very knowledgeable and friendly. He cleaned our indoor unit and used a pan to collect the runoff to minimized the mess!"
        },
        {
          "reviewer_name": "Joseph Scott",
          "review_text": "Super helpful!"
        },
        {
          "reviewer_name": "Charles uh60m",
          "review_text": "We just purchased a new HVAC system through Stinnett and couldn't be happier! From the first phone call to the final touches, they were extremely professional! I had numerous HVAC companies come by for estimates and Stinnett blew all of them out of the water. I will definitely be using Stinnett for all my heating and cooling needs from here on out!"
        },
        {
          "reviewer_name": "Miss Von",
          "review_text": "Had a little issue installing my smart thermometer myself which i shouldn't have touched in the first place. So long story short I ended up with no a/c for the night. Lol everyone was upset oops sorry. So of course I had to fix that mistake I called Stinnett and guess what they came out the same day to fix the problem. Awesome service fast and reliable. Will use them again if something goes wrong. Which I hope doesn't happen anytime soon.. This DIY should be left alone. 🤣 oh paying was a breeze I went in person and the young lady was so nice love it! Thank you again."
        },
        {
          "reviewer_name": "Mark Caldwell",
          "review_text": "Quick, knowledgeable, trustworthy and friendly. Have been a customer of theirs for almost 10 years and they haven't failed me yet. The best in the Enterprise area!"
        },
        {
          "reviewer_name": "Meghan Dickerson",
          "review_text": "My system started having issues Tuesday June 7th… i called the same day and someone was out the next day.. They fixed the problem quickly and efficiently.. Professional and friendly whenever I call and the technician is working on my unit..  I’ve been using them for a few years now and highly recommend!!!"
        },
        {
          "reviewer_name": "Charles Finch",
          "review_text": ""
        },
        {
          "reviewer_name": "Gary Lambert",
          "review_text": "System went out around noon. Called and they came out the next morning and fixed the problem. Fast, friendly, efficient. They also installed the unit a couple years ago."
        },
        {
          "reviewer_name": "ray milligan",
          "review_text": ""
        },
        {
          "reviewer_name": "Donnie Grissett",
          "review_text": "I have been using Stinnett Heating and Cooling for over 10 years. These are the best people to work with. And Shannon is an Angel  kind caring just a sweetheart.\nI had a wire break on my thermostat that runs outside to the unit. When I got there bill it was 30 dollars. I called them they told me we only found that wire was there less than tem minutes so we just charged you for gas and time who else would do this no one in my town. Because I am no weight bearing on right leg due to broken ankle they moved me to the top of service calls was here in less than an hour.\nALL AROUND THE BEST PLACE TO DO BUSINESS"
        },
        {
          "reviewer_name": "td embry",
          "review_text": "My coil froze up so I called a different company to come fix it because of their ratings on Google. I waited hours and never got a call from their technician. So I called Stinnett and their tech called us to give us an ETA within the hour. He came out and had us going again all before we ever even heard from the other guy."
        },
        {
          "reviewer_name": "William Gainey",
          "review_text": ""
        },
        {
          "reviewer_name": "Jeffery Jordan",
          "review_text": "Best service you can ask for. I had lightening take out my 2yr old unit and they had me back in cool are in 1 day!! I refuse to use anyone else!!"
        },
        {
          "reviewer_name": "Dana Roberts",
          "review_text": "Good prices, fast quotes, quick response time.to a call out, and great people"
        },
        {
          "reviewer_name": "Ashley Simmons",
          "review_text": "Very professional and competitive prices. I bought a complete setup with 10 years parts and labor warranty. Just recently had a small issue that made the air conditioning inoperative and it was resolved the same day. I live 40 miles from their office and that's impressive to me."
        },
        {
          "reviewer_name": "Jeremy Simmons",
          "review_text": "Where I work."
        },
        {
          "reviewer_name": "Gabe Martin",
          "review_text": "Stinnett's always goes the extra mile to keep my family cool in this Alabama heat!"
        },
        {
          "reviewer_name": "Susan Farr",
          "review_text": "Reliable service."
        },
        {
          "reviewer_name": "Daniel Chicarello",
          "review_text": "Great people"
        },
        {
          "reviewer_name": "Taylor Geib",
          "review_text": "This is a great company with fantastic employees! Our AC has broken twice this year and each time we've called Stinnett Heating & Cooling.\nThey've never left without ensuring the AC works properly and never leave a mess in the house, which I greatly appreciate!\nHighly recommended!!"
        },
        {
          "reviewer_name": "David Cooper",
          "review_text": "Pillar business of a great community"
        },
        {
          "reviewer_name": "Bob Raichle",
          "review_text": "In this last 15 years, we've called Stinnett on 3 or 4 occasions, usually for an air conditioning problem. They always send someone out the same day and often fix the problem on the spot. I called at 4 this afternoon, and our a/c was fixed by 7."
        },
        {
          "reviewer_name": "John Kelly",
          "review_text": "Came out the day I called. Joe ( the technician) was quick and polite. Definitely recommend to anyone in need of ac work"
        }
      ]
    },
    "terrapin-creek-plumbing-and-septic-service-llc": {
      "business name": "Terrapin Creek Plumbing And Septic Service, LLC",
      "reviews": [
        {
          "reviewer_name": "Matthew Mitlyng",
          "review_text": "Quickly repaired a couple problems and had a great solution for another issue."
        },
        {
          "reviewer_name": "Kelly",
          "review_text": "Have came out for two emergency situations super fast. Can't thank y'all enough!!"
        },
        {
          "reviewer_name": "William Watson",
          "review_text": "The crew was great got right to it an was done"
        },
        {
          "reviewer_name": "Junior McElroy",
          "review_text": "Out standing work very satisfied with work"
        },
        {
          "reviewer_name": "Olga Higginbotham",
          "review_text": "I cant say enough good things about this company. This is the 2nd time I have used this company. Both times they have come to my house and taken the time to explain what they will be doing  to find the problem. they came yesterday and I have been having clogs consistently in 1 bathroom and they took the time to try various techniques and getting the drain unclogged. They made sure it was completely unclogged before they left. I wont use any other company for septic or plumbing unless they cant do it!"
        },
        {
          "reviewer_name": "Shon Woods",
          "review_text": "These guys did an amazing job cleaning our septic system and fixing the issue we had. I would recommend them for other jobs if needed. These guys drove 2hrs away from my house cause nobody else would pump it out. Thank you guys again"
        },
        {
          "reviewer_name": "Cathy Griffeth",
          "review_text": "Responsive and professional!  I would recommend Terrapin Creek Plumbing."
        },
        {
          "reviewer_name": "Alley Hall",
          "review_text": ""
        },
        {
          "reviewer_name": "Susan S",
          "review_text": "Two very professional & very kind gentlemen pumped my RV black tank today & I couldn't be more pleased with their service & fast response. Very reasonable price. You won't go wrong with this company. Just look at the rest of their reviews..⭐⭐⭐⭐⭐!  I HIGHLY recommend this company."
        },
        {
          "reviewer_name": "Anthony Starks",
          "review_text": "Quick service and got it done, Dalton was great and gave me some advice, thanks for return call and quick next day service Will recommend, thanks terriapian"
        },
        {
          "reviewer_name": "Merry Herdt",
          "review_text": "Terrapin Plumbing was AMAZING! They were able to fix my under the sink leak, the diverter in my shower AND fix a new shower head install (a different guy) that has never worked properly. The fantastic part was the tenacity of the workers to troubleshoot the shower head. German made head was just installed backwards, but it was a tough job under the house to fix it. They just worked a miracle! I will be having them install a tankless water heater ASAP! Extremely reasonable prices for such quality work! Highly recommended!"
        },
        {
          "reviewer_name": "Betsy Phillips",
          "review_text": "They came the same day I called and made sure the problem was fixed even after hours.   I will be using them again."
        },
        {
          "reviewer_name": "Christina Handle",
          "review_text": ""
        },
        {
          "reviewer_name": "Nathan Taylor",
          "review_text": "Professional and fast! Always shows up and keeps word!"
        },
        {
          "reviewer_name": "Jane Pope",
          "review_text": "Great service. Always kept us upon arrival time. Very professional. We would highly recommend this company"
        },
        {
          "reviewer_name": "Sarah Hutt",
          "review_text": ""
        },
        {
          "reviewer_name": "Janice Ray",
          "review_text": "Would highly recommend this Company. They did exactly what they told me they were going to do. Was reasonably priced and told me to give them a call if the work they performed didn’t solve my problem. They were very professional and knowledgeable ."
        },
        {
          "reviewer_name": "S.R. Roper",
          "review_text": "The guys came out  unloaded equipment and started rite away repairing my problem . Professional work , reasonable price without complication . I recommend them to anyone. Good job terrapin creek plumbing"
        },
        {
          "reviewer_name": "Melanie Jones",
          "review_text": "Called late morning about clogged sewer line. They were here in the afternoon and fixed the issue!!!!!! So happy with the professionalism and quick response. Thanks so much"
        },
        {
          "reviewer_name": "Haley Cosby",
          "review_text": "Called yesterday & they were out today to fix our issue! :) highly recommend."
        },
        {
          "reviewer_name": "Katelyn Deerman",
          "review_text": "This is a top notch septic and plumbing business. This team installed a field line for our washing machine and a new shower in our master bath. They were on time, great to work with, and very reasonably priced. I would  highly recommend their services to anyone"
        },
        {
          "reviewer_name": "Heather Gregg",
          "review_text": "Fantastic. Returned phone call and arrived pretty fast. They were super friendly and solved the problem quickly, as well doing an excellent job explaining the issues. I would definitely do business with them again!"
        },
        {
          "reviewer_name": "Sheila Stewart",
          "review_text": "Crew got all my plumbing problems solved."
        },
        {
          "reviewer_name": "Steven White",
          "review_text": ""
        },
        {
          "reviewer_name": "Dalton Cosby",
          "review_text": ""
        },
        {
          "reviewer_name": "Wesley Stephens",
          "review_text": "These guys went above and beyond while they were at our home. They cleaned the work area very well once they were done. I had plenty of questions and they were able to answer all of them!! I will be using this company personally for now on! And I will highly recommend them to anyone else that has any issues"
        },
        {
          "reviewer_name": "Scot Brothers",
          "review_text": "Came to my house at 10 pm and emptied my septic tank..great guys and great job..I highly recommend for any plumbing or septic issues..can't say enough good things"
        },
        {
          "reviewer_name": "H Tapp",
          "review_text": ""
        },
        {
          "reviewer_name": "Sandra Gideon",
          "review_text": "These guys are great! We had sewage flowing in our tubs an toilets. I just had heart surgery an was up most of night crying. I ran into these guys an they came to my rescue. I had called a list of plumbers an no return calls. I will always call them 1st. The Best."
        },
        {
          "reviewer_name": "Rhonda Blanchard",
          "review_text": "They came out the day we called, had to stay way after 5, made an extra trip for a part they didn't have and still priced the work reasonably.  I will call them every time."
        }
      ]
    },
    "rediworx-drain-sewer-cleaning": {
      "business name": "RediWorx Drain & Sewer Cleaning",
      "reviews": [
        {
          "reviewer_name": "J B",
          "review_text": "Outstanding service and Lance was very professional and helpful! He made sure our issues were fixed. I would recommend this business because he really cares about the Customers and walks the walk!!! Thanks!"
        },
        {
          "reviewer_name": "Jill Fore",
          "review_text": "Lance done a great job and I will definitely use Rediworx in the future. I highly recommend you give them a call if you need your drains cleaned."
        },
        {
          "reviewer_name": "Gerard McShea",
          "review_text": "I had an emergency job and REDIWORX came through on short notice and squared me away. I highly recommend their services."
        }
      ]
    },
    "stephen-seibert-plumbing-llc": {
      "business name": "Stephen Seibert Plumbing, LLC",
      "reviews": [
        {
          "reviewer_name": "Michael Self",
          "review_text": "Stephen and Maria installed our new dishwasher today. Excellent service and extremely nice and professional. Highly recommend them!"
        },
        {
          "reviewer_name": "Chasey Curbow",
          "review_text": "Great service! Stephen came last minute to fix a toilet issue so my family didn't have to go the weekend without one."
        },
        {
          "reviewer_name": "Charles Wright",
          "review_text": "Stephen was the installer for the dishwasher I bought at Lowes. He did a great job and was very professional.  I would not hesitate to use him for any future plumbing concerns that I might have."
        },
        {
          "reviewer_name": "K Zehr",
          "review_text": "This gentleman was a repairman angel. He helped us out when our faucet handle broke, leaving the hot water spewing into the tub and installed our dishwasher.  I can't say enough good things about his service. Professional,  helpful, knowledgeable,  hard working and more, more , more"
        },
        {
          "reviewer_name": "Ashley Moody",
          "review_text": "The best and most knowledgeable plumber I have ever talked to. Highly recommend him!"
        }
      ]
    },
    "joe-reid-dawes-plumbing-service": {
      "business name": "Joe Reid - Dawes Plumbing Service",
      "reviews": [
        {
          "reviewer_name": "K W",
          "review_text": "Joe is my first call on plumbing issues.  Fair priced, professional work."
        },
        {
          "reviewer_name": "Brian O",
          "review_text": "Joe Reid did a great job repairing my shower.  I tried for a month to find a plumber but could not even get anyone to respond to  requests for repair for my shower issue.  Finally came upon Joe Reid, he responded promptly, said he could help with my issue and we scheduled an appointment.  I've used him twice and both times he was on-time and completed the repair as requested!  His prices are reasonable and I would definitely call him again if needed."
        },
        {
          "reviewer_name": "Rick Martin",
          "review_text": "Great service. Stayed in touch leading up to his service call. I’d highly recommend and will use him again when needed."
        },
        {
          "reviewer_name": "Cassandra Moultrie",
          "review_text": ""
        },
        {
          "reviewer_name": "Rodney Mosley",
          "review_text": "Would highly recommend."
        },
        {
          "reviewer_name": "Mark Thomas",
          "review_text": "Expert plumber very reasonable and friendly guy."
        },
        {
          "reviewer_name": "Tammy Martin",
          "review_text": "Joe is amazing. I called for a leaking pipe and he came out quickly and efficiently handled the job. He was very reasonable and I can assure you I will always use him and recommend him to everyone I know!!!"
        },
        {
          "reviewer_name": "brent carson",
          "review_text": "Very professional and gives you an honest opinion. I definitely recommend and will use for any future plumbing. Very reasonable on pricing."
        },
        {
          "reviewer_name": "Edie Adams",
          "review_text": "He was very professional and worked in a timely manner. Very reasonable 👌"
        },
        {
          "reviewer_name": "JM Rough",
          "review_text": "Had a outside water line break after 5pm.Called Joe and he was here to repair line in less than a hour. Price was very reasonable for an after hour repair."
        },
        {
          "reviewer_name": "kathy moss",
          "review_text": "Very pleased with response time.  Very detailed in trying and finding the leak.  Would highly recommend him."
        },
        {
          "reviewer_name": "Deborah Davison",
          "review_text": "Mr.Ried was very kind and professional in taking care of the issues I had. He gave a lower price than anyone else I had called for the work and had it done very quickly. I would definitely recommend him and I plan on calling him for any of my future plumbing needs."
        },
        {
          "reviewer_name": "teelissa9",
          "review_text": "Requested Mr. Reid at the last minute. He didnt hesitate he came and fixed my pipes immediately. His service is second to none. I recommend his service and will definitely call again if in need of a plumber."
        },
        {
          "reviewer_name": "C Norwood",
          "review_text": "Joe Reid came highly recommended and lived up to all that everyone said. Estimate was lower than others I called. Did a great job replacing 4 faucets and is a really sweet guy. I am happy to find someone I can call on if I have any plumbing issues. Thanks Joe."
        },
        {
          "reviewer_name": "Johnny Boi",
          "review_text": "Stand up plumbing company !"
        },
        {
          "reviewer_name": "Patrick E",
          "review_text": "Fantastic service at a great price.  Mr Joe is a great plumber and an even better man.  I would never use anyone else."
        },
        {
          "reviewer_name": "Oksana Alabama USA",
          "review_text": "Professional. Thank you. Will recommend to my friends."
        }
      ]
    },
    "dorsey-plumbing-llc": {
      "business name": "Dorsey Plumbing LLC",
      "reviews": [
        {
          "reviewer_name": "Elton Curtis",
          "review_text": "I’ve always had a good experience with Dorsey plumbing. He’s done several jobs at my house and I had no problems with the work. I would have no problems  referring him to family and friends."
        },
        {
          "reviewer_name": "Margaret Williams",
          "review_text": "I am very satisfied with the work by Dorsey Plumbing. I've already recommended him to a family member. I give his business 5 stars."
        }
      ]
    },
    "shaw-s-handyman-services": {
      "business name": "Shaw's Handyman Services",
      "reviews": [
        {
          "reviewer_name": "Mark Hardin",
          "review_text": "Punctual, Professional and polite. Darius did a great job repairing my walls after a plumbing repair.\nHe was good enough to show up shortly after I first contacted him, while others took 2 days to get back to me after saying they would call right back. Great guy!"
        }
      ]
    }
  }
}