{
  "siteConfigs": {
    "all-american-faucet-parts": {
      "business name": "All American Faucet Parts",
      "reviews": [
        {
          "reviewer_name": "Kathy Hall",
          "review_text": "I am so pleased to have found them.  I am a widow on a fixed income trying to repair a leaking shower valve.  My brother was helping me and we wound up having to cut the retaining ring for the cartridge.  Went several places no luck finding.  Went to Lowes and was told I would be unable to buy just the ring I would have to replace the entire valve which meant calling a plumber.  I went to Wigmans since they are a hardware store and normally carry odd ball things.  The gentleman in plumbing very nice they did not have and suggested I try All American faucet parts.  I traveled there went in and explained what I needed they had it, you made an old lady very happy.  2 Very kind gentlemen.  I purchased the part and thank them so much.  I called Wigmans and thanked the gentleman who helped me and told me to try them.  Great Customer Service."
        },
        {
          "reviewer_name": "Robertgweaver Jr",
          "review_text": "Great customer service I’m happy to give a 5 star  review"
        },
        {
          "reviewer_name": "carl watson",
          "review_text": ""
        },
        {
          "reviewer_name": "Oneal Jordan",
          "review_text": "I’d been all over town looking for cap washers to repair my aged shower facet.   No luck.\nYesterday I walked into All American and was greeted very welcoming.   Both gentlemen were informative and helped me with not only the parts I needed but with advise on how to ensure I was successful on making the repairs.\nI was able to fix my leaking facet last night with their parts and advise.  Spent less than $50 for three parts.   Plumber online quoted $300 plus parts.\nStrongly recommend you taking the time to search them out."
        },
        {
          "reviewer_name": "Bigtimez 90",
          "review_text": "Best service around mobile, jasper is very knowledgeable and kind."
        },
        {
          "reviewer_name": "Troy Pierce",
          "review_text": ""
        },
        {
          "reviewer_name": "Nolan Mclean",
          "review_text": "Excellent customer service!  Very professional."
        },
        {
          "reviewer_name": "David Keeler",
          "review_text": "Excellent service, good prices, and they can apparently order any faucet part known to man!"
        },
        {
          "reviewer_name": "Clifton Sons",
          "review_text": "Outstanding customer service"
        },
        {
          "reviewer_name": "Brian Williams",
          "review_text": "Great service and prices are good and very helpful with ordering if they don't have the part"
        },
        {
          "reviewer_name": "Rene Laizer",
          "review_text": "They have everything you need....."
        },
        {
          "reviewer_name": "Angela Fulton",
          "review_text": ""
        },
        {
          "reviewer_name": "Justin Golemon",
          "review_text": ""
        },
        {
          "reviewer_name": "Daniel Fulton",
          "review_text": ""
        },
        {
          "reviewer_name": "j higdon",
          "review_text": "Very knowledgeable Gentleman and a tremendous inventory of hard to find parts."
        },
        {
          "reviewer_name": "William Sansom",
          "review_text": "If you need anything to do with faucet parts this place should be your first stop. I am a service plumber since January 2000, plumbed in 4 different states, and I've not seen any supplier more knowledgeable than these guys. Faucet parts and valves are their specialty."
        },
        {
          "reviewer_name": "Kaitlyn M",
          "review_text": ""
        },
        {
          "reviewer_name": "Joshua Carter",
          "review_text": "This is the 3rd time I have been there.  They have always had everything I need and are very helpful.  I highly recommend this place!"
        },
        {
          "reviewer_name": "Joe Enzor",
          "review_text": "I have a 70s model home with an old set of Kohler hardware that noone else had. He had the parts I needed and answered all questions. He is short on chit chat but knows his stuff. In the business for 50+ years."
        },
        {
          "reviewer_name": "Custom Concepts",
          "review_text": "He knows everything and is short to the point"
        },
        {
          "reviewer_name": "Mike Matthews",
          "review_text": "Very helpful...and great selection of hard to find parts."
        }
      ]
    },
    "angel-plumbing-company": {
      "business name": "Angel Plumbing Company",
      "reviews": [
        {
          "reviewer_name": "Beth Earnest",
          "review_text": "Jeff was so nice and very efficient! Fixed our upstairs toilet quickly. I will definitely call again for other plumbing issues."
        },
        {
          "reviewer_name": "Patrick Elliott",
          "review_text": "Jeff was friendly, easy to work with, cost effective, and detailed everything he was going to do before he did the work. Not to mention he was fast. Completed the entire job in 2 days. He’s a lifesaver!"
        },
        {
          "reviewer_name": "Shaina Allen",
          "review_text": "Excellent service, arrived quickly, good prices as well."
        },
        {
          "reviewer_name": "Ben Barnett",
          "review_text": "Mr. Jeff was great to work with.  I needed several plumbing issues in my house fixed. He showed up on time, made his recommendations, and even taught me a thing or two. He turned an estimate around in about a day, and got to work that same week. My wife is very happy with our new garbage disposal, I love that he fixed my water heaters plumbing. I am even more impressed with the trench drain that he placed against my garage. I can’t recommend Angel Plumbing enough."
        },
        {
          "reviewer_name": "Josh Cowan",
          "review_text": "Came out after hours and did an awesome job fixing our water leak at the meter."
        },
        {
          "reviewer_name": "Tammy Mullins",
          "review_text": "He does great work and very reasonable on prices. Thank you Angel's plumbing you are a life saver."
        },
        {
          "reviewer_name": "Bobby Rhodes",
          "review_text": ""
        },
        {
          "reviewer_name": "Gage Wilkes",
          "review_text": "Very good service Jeff-was punctual well mannered friendly and and fixed our problems when other plumbers could not"
        },
        {
          "reviewer_name": "Bryan Anderson",
          "review_text": ""
        }
      ]
    },
    "red-bay-ace-hardware": {
      "business name": "Red Bay Ace Hardware",
      "reviews": [
        {
          "reviewer_name": "Vitalino Chinchilla",
          "review_text": ""
        },
        {
          "reviewer_name": "Martje Bicker",
          "review_text": ""
        },
        {
          "reviewer_name": "Aleacia Bursaw",
          "review_text": "We were from out of town and needed a part for my parent’s dryer. They didn’t have the part, but could get it in by the next day and did everything they could to try to help us when we spoke to them."
        },
        {
          "reviewer_name": "John Kais",
          "review_text": "Had what I needed and at a good price. Nice store and helpful people"
        },
        {
          "reviewer_name": "Jaysen Eisengrein",
          "review_text": "The Red Bay Ace is lucky to have Alex as a staff member. Also, store managers are to be congratulated for knowing its customer base and needs. We visit this fine city for our Tiffin RV needs. We needed a 30 amp to 110 volt adapter. They did not have one...THEY HAD TWO TYPES! Alex was patient and helpful in also locating an esoteric propane connection we needed. Finally, aldo.found a rare (today) incandescent light bulb to keep our water bay warm. Thank you."
        },
        {
          "reviewer_name": "Sheila Traylor",
          "review_text": "Very clean & staff was very polite & helpful"
        },
        {
          "reviewer_name": "Ken Warren Umfress",
          "review_text": ""
        },
        {
          "reviewer_name": "Oliver Herrera",
          "review_text": ""
        },
        {
          "reviewer_name": "Jeff McKinney",
          "review_text": "Certainly a welcome addition to a small town"
        },
        {
          "reviewer_name": "Fun Dad",
          "review_text": ""
        }
      ]
    },
    "sellers-services-llc": {
      "business name": "Sellers Services LLC",
      "reviews": [
        {
          "reviewer_name": "Jessy P",
          "review_text": "Outstanding work, quick and affordable. My problem was addressed within 24 hours of calling them. They were courteous and professional and will be my first call for future needs!"
        },
        {
          "reviewer_name": "Kristen Dunning",
          "review_text": "Super fast and friendly response. I had a water leak on a Sunday. Jake drove over immediately after I called. He is very professional, knowledgeable, trustworthy, and reasonably priced. He will be my new go-to!"
        },
        {
          "reviewer_name": "Keith Richardson",
          "review_text": "Great work , very professional"
        },
        {
          "reviewer_name": "Z M",
          "review_text": "Knowledgeable and passionate about his work, you can rely on Jacob and his team to get the job done quickly and properly. He has personally come out and shown his expertise and commitment on several calls at my house and is now my go-to plumber!"
        },
        {
          "reviewer_name": "Summar Roberts",
          "review_text": "I highly recommend Seller Services! They have fixed numerous plumbing issues for my family in a very timely manner. The owner, Jake, is very personable and knowledgeable in his trade!"
        },
        {
          "reviewer_name": "Alex Vanche",
          "review_text": "I have done a lot of work with Jake, the owner. He’s a reliable, professional, family man who has a passion for the trade. Would highly recommend Sellers Services, they take pride in producing quality work, and providing great customer service."
        },
        {
          "reviewer_name": "Candace Wible",
          "review_text": "I was having various plumbing issues and contacted Sellers Services, he was able to fit me into his schedule and took care of everything and gave me some pointers on routine maintenance needed. Will definitely use this company for any and all future plumbing needs!"
        },
        {
          "reviewer_name": "Tiffany Duncan",
          "review_text": "Very knowledgeable, dependable and trustworthy! Sellers Services is definitely who I call when I am in need of plumbing help!"
        },
        {
          "reviewer_name": "Meghan Johnson",
          "review_text": "Sellers Services is someone I know I can depend on any time I have plumbing issues. They’re dependable, friendly and great to work with. Definitely recommend to anyone that is looking for a great plumber!"
        },
        {
          "reviewer_name": "Kerrisa Vickers",
          "review_text": "Great guy! Knows how to fix any problems we have had!"
        }
      ]
    }
  }
}