{
  "siteConfigs": {
    "3rd-generation-septic": {
      "business name": "3rd Generation Septic",
      "reviews": [
        {
          "reviewer_name": "Tracy Boswell",
          "review_text": "3rd Generation Septic has done an amazing job for us time after time. They will always be our first call because they are quick to respond, very professional, reasonably priced, and excellent at what they do. You will be so glad you made them your first call !\n\nTracy B."
        },
        {
          "reviewer_name": "Eli Holcombe",
          "review_text": "They did a great job. They were on time. Finished the job ahead of schedule and their prices can't be beat. Highly recommend!"
        },
        {
          "reviewer_name": "Jamie Elliott",
          "review_text": "They came out and pumped my septic tank they are very friendly reasonable prices will use again"
        },
        {
          "reviewer_name": "james",
          "review_text": "very knowledgeable company very good price"
        },
        {
          "reviewer_name": "Jeremy Kelly",
          "review_text": "Very knowledgeable and cheap services"
        },
        {
          "reviewer_name": "Derrick Greene",
          "review_text": "Very professional work and very knowledgeable about there work ."
        },
        {
          "reviewer_name": "Cory Thomas",
          "review_text": "Top notch work ethic and very good pricing for the job .Shawn and the boys didn't try to break the bank to get my septic drain feild operating correctly again."
        },
        {
          "reviewer_name": "Sharon Singletary Jacobs",
          "review_text": "3rd Generation Septic came and pumped our septic tank today - they were Awesome!\nThey came very quickly when we call and treated us very well, going the extra mile.\nI highly recommend this company."
        },
        {
          "reviewer_name": "Amber Smith",
          "review_text": ""
        },
        {
          "reviewer_name": "BerryGreatConstruction",
          "review_text": "Came out the next day got the camper pumped out. Very respectful and professional. Can't beat the great price. In Alexandria area I'm going to be having the back in a few months to do it again"
        },
        {
          "reviewer_name": "Amanda Myer",
          "review_text": "Professional and prompt. Fair pricing and knowledgeable."
        },
        {
          "reviewer_name": "Glenn Gilbert",
          "review_text": "Shawn and his help are outstanding, very professional and courteous, this is the 2nd time I’ve used him, I wouldn’t use anyone else, he’s got my business for now on.."
        },
        {
          "reviewer_name": "Keith",
          "review_text": "Simply awesome. When 3rd generation showed up for what should have been a simple job that turned into a hassle they just pivoted. The continued until all the issues were resolved and didn’t slow even once. They’re great and you won’t be disappointed!"
        },
        {
          "reviewer_name": "Jane Cook",
          "review_text": "Just want to give a great big thank you to 3rd Generation Septic ✔️. I called him yesterday. They came out the very next morning. Got me all set up pumped out and the nicest guy you’ll ever meet. Thank you so much. I will always use your service."
        },
        {
          "reviewer_name": "Melissa Cobb",
          "review_text": "Shawn and his crew definitely know their stuff! They do awesome work for amazing prices!"
        },
        {
          "reviewer_name": "Sanityze Deep Cleaning Solutions",
          "review_text": "Great company to do business with.  We were able to attend a presentation where the CEO educated us on best practices for septic care.  They are passionate about doing things the right way and great customer care."
        },
        {
          "reviewer_name": "Michael McDermott",
          "review_text": ""
        },
        {
          "reviewer_name": "Wendy Smith",
          "review_text": ""
        },
        {
          "reviewer_name": "Crystal N Clark",
          "review_text": "3rd Generation Septic is professional, affordable, and knowledgeable. They are my first call if there is a backup or drainage issue. Highly recommend!"
        },
        {
          "reviewer_name": "Dan Kostecke",
          "review_text": "Great job. I will call 3rd Gen again when I have a need."
        },
        {
          "reviewer_name": "Cheri Rampey",
          "review_text": "Can’t say enough about these folks.   Very professional, good people.  I highly recommend 3rd Generation Septic."
        },
        {
          "reviewer_name": "William Williams",
          "review_text": "Great service and very professional. I recommend 3rd generation septic service very highly. They did an excellent job and timely."
        },
        {
          "reviewer_name": "Chad Crockett",
          "review_text": "Definitely recommend, they were at my house the same day I called, very friendly, helpful and they did a good job."
        },
        {
          "reviewer_name": "Jana Jewell",
          "review_text": "Great service and very helpful!!"
        },
        {
          "reviewer_name": "Tim Wallace",
          "review_text": "Was not having any problems but thought it would be a good idea to have my septic tank pumped out, good thing they showed me the there is a clean out screen in there that I should clean out every year to keep prevent problems that I could do myself and save money, l thanked them for taking time to show me and will use them again, I did learn that it's best to  text them I thing they stay pretty busy and I will recomend them job done well"
        },
        {
          "reviewer_name": "Brandy Brenneman",
          "review_text": "I highly recommend Shawn and 3rd Generation Septic. They did an excellent job for my clients and were fast, affordable, and friendly."
        },
        {
          "reviewer_name": "Madison Moore",
          "review_text": "Shawn and his crew were amazing today. They came out to the house (Oxford area) on short notice and were able to quickly assess the situation. Once they were able to get all the materials needed to do the job, it took them no time to get the job done. When they finished, they cleaned up the yard nicely and made sure all trash was taken care of. Their customer service was awesome and made sure to explain everything that they were doing and how it was going to affect the septic and the yard. Strongly recommend this team of awesome individuals to anyone."
        },
        {
          "reviewer_name": "Hannah Keith",
          "review_text": "Shawn does excellent work!"
        },
        {
          "reviewer_name": "Eulises De Leon Salas",
          "review_text": ""
        },
        {
          "reviewer_name": "Jay",
          "review_text": "Sent a web message onSunday, thinking they would be closed.   The owner called me back and had a crew out by 10am Monday morning. They got my septic dug up and fixed same day. Excellent service and awesome people to work with! Highly recommend!!"
        },
        {
          "reviewer_name": "Amy Stone",
          "review_text": "Excellent service and an affordable price!  Very kind service team. They explained everything along the way and gave pointers on how to keep my system working effectively as well as a maintenance schedule.   Definitely give them a call if you need any septic servicing done.  Will be using them from now on!  Thank you!"
        },
        {
          "reviewer_name": "Judy Ward",
          "review_text": "Great service, very prompt I got next day service very reasonable price,the guys were very helpful and knowledgeable.judy Holt Ranburne Al."
        },
        {
          "reviewer_name": "Cassandra Wallace",
          "review_text": "Thank you Shawn and your crew for an outstanding service on our septic issue. Your company will definitely keep us as a customer for any septic issues or problems. This needs to be the first company everyone should call for great services.Thank you guys for a job well done"
        },
        {
          "reviewer_name": "Leslie Anderson",
          "review_text": ""
        },
        {
          "reviewer_name": "Marie Greeson",
          "review_text": "Fast service on short notice, courteous and professional!! Highly recommend."
        },
        {
          "reviewer_name": "Vanesha Johnson",
          "review_text": "Very very great customer service! Fast and efficient job! Explained everything in a detailed manner!!! Highly recommended!"
        },
        {
          "reviewer_name": "Jonathan Jones",
          "review_text": "Great company ran by even better people!"
        },
        {
          "reviewer_name": "Pam",
          "review_text": "Shawn and his crew were on time and very efficient.  Affordable and gave me advice and recommendations concerning keeping my septic system in good working order.  They were recommended to me and I would recommend them too."
        },
        {
          "reviewer_name": "Shane Morgan",
          "review_text": "These guys worked hard and did a great job."
        },
        {
          "reviewer_name": "B. Kelly",
          "review_text": "Came right out and fixed the septic field lines.  Was upfront with the process and for future maintenance."
        },
        {
          "reviewer_name": "Trenton Quackenbush",
          "review_text": "Very good service very professional and good price"
        },
        {
          "reviewer_name": "miaria_ gaming",
          "review_text": "I will very highly recommend them for your septic services they are very dependable they will get my business from now on."
        },
        {
          "reviewer_name": "Lana Dilleshaw",
          "review_text": ""
        },
        {
          "reviewer_name": "Christina Putman",
          "review_text": "We used 3rd Generation for the replacement of a septic lid in order to facilitate proper function and clean out. Shawn was upfront & clear about the work we needed done and the reasons why. All equipment was professional and in good order. When  there was a snag due to an apparent custom cover that was installed in the past, Shawn devised a timely and cost effective solution that did not alter the quality of the work performed. The crew was well-staffed, polite and diligent. The charge for the work performed was highly affordable, a definite plus! We will definitely use 3rd Generation Septic for any future work we may need. I  recommend you consider them as well."
        },
        {
          "reviewer_name": "Patti Tharrington",
          "review_text": "I HIGHLY recommend 3rd Generation! I called very early this morning and the job was completed by lunchtime. Shaun is very knowledgeable, personable and explains things in great detail. I will definitely refer him to others needing an honest service!"
        },
        {
          "reviewer_name": "Sandy Evans",
          "review_text": "Theses guy are great my septic tank  was hard to get to but they got it done  and in the rain thanks so much"
        },
        {
          "reviewer_name": "Amanda Jimenez",
          "review_text": ""
        },
        {
          "reviewer_name": "Mike McComb",
          "review_text": "Friendly and very knowledgeable. Would recommend and definitely use them  again."
        },
        {
          "reviewer_name": "Margie Morgan",
          "review_text": "If I could give 10 stars on this review I would.  I called last night and they were at my house at 7:00 AM this morning and had the problem fixed in less than an hour.  I can't say enough good about them, they are reasonably priced, very professional, and do amazing work!  Will absolutely use them again and highly recommend them!"
        },
        {
          "reviewer_name": "Mountain View Apartments",
          "review_text": "Does a great job. Reasonable prices"
        },
        {
          "reviewer_name": "Wendy Johnson",
          "review_text": ""
        },
        {
          "reviewer_name": "Amy Nail",
          "review_text": "Great family business and prices. Had our septic tank cleaned within few hours after initial call. Highly recommend. Thank you for taking care of our problem."
        },
        {
          "reviewer_name": "Anthony Oliver",
          "review_text": "Pumped my septic tank did a great job and was very prompt. I had a clogged line which they took care of."
        },
        {
          "reviewer_name": "Tawanda Bellamy",
          "review_text": "This was my first time using this company. I was very pleased and impressed with the great service they provided. I will be using this company for now on. I will refer this company to anybody. Great price for the quality of work. Thanks so much forHelping me this morning with my sewage problem."
        },
        {
          "reviewer_name": "Ken Turner",
          "review_text": "Professional and reasonably priced. Definetly call them first for septic/plumbing issues!!"
        },
        {
          "reviewer_name": "Jacob Silva",
          "review_text": ""
        },
        {
          "reviewer_name": "Tyler Young",
          "review_text": "They were very timely. I was able to get them out ti pump my septic tank same day, and they were very polite and professional. Excellent work!"
        },
        {
          "reviewer_name": "Kevin Hogan",
          "review_text": "I read all the great reviews and decided to try them. I'm glade we did the did a great job. Very friendly and knowledgable."
        },
        {
          "reviewer_name": "Tonja W",
          "review_text": "I really respect someone who will be straightforward and honest about a situation and really resolve the issue. The owner of the company was very professional and he knows what he’s doing . This company is very affordable and I will use them again And I will recommend them to my friends and family so if you have an issue they will take care of you."
        },
        {
          "reviewer_name": "Jesikah Rae",
          "review_text": "Absolutely the best septic service available in this area! Used him for the first time about a year ago, and now I recommend him to everyone! Very professional, knows what he is doing and gets it done correctly. You couldn’t pay me to use anyone else!! :)"
        },
        {
          "reviewer_name": "Melanie Winkler",
          "review_text": ""
        },
        {
          "reviewer_name": "Julie Ellis",
          "review_text": "I called these guys on Saturday and they were out here early Sunday morning. Very affordable and professional! Highly recommend!"
        },
        {
          "reviewer_name": "kayla Dausch",
          "review_text": "Shawn came out two days in a row to fix my septic and instal a new lid. He was exceptionally informative and made sure to tell me everything that was going on. I was very happy with the service they provided and will continue to use them. If you want a job done right give them a call."
        },
        {
          "reviewer_name": "kameshia peters",
          "review_text": "Very professional, and detailed oriented about the service of inspection and pumping of the septic tank. I recommend 3rd Generation  if you are in need of septic inspection and pumping. Will definitely use 3rd Generation for all septic services."
        },
        {
          "reviewer_name": "Tina Smoot",
          "review_text": "If I could give a TEN star review, I would!!!  First of all, this company was the only one that STATED they were open before eight o’clock. I called, Shawn (owner and operator) picked up on the first ring!!  Diagnosed my problem on the phone. Specifically told me he had one appointment ahead of me and that he would be at my house around lunchtime!!  It was BEFORE lunchtime when he was sitting in my driveway ready to roll!!!  Shawn and Kyle pulled up already ready to get to work!!  Love this guy and his attitude and willingness to help and get the job done!!!  This is my guy right here from now on!!! My neighbors saw the truck in my yard and I have already slid them his number!!!  This is my guy right here!!!!"
        },
        {
          "reviewer_name": "Bella C",
          "review_text": "Shawn and his crew were amazing. My son talk to him yesterday the 13th and he came out this morning.  He showed me what the problem was and he fixed it. I highly recommend this young man and his crew. Thank you Shawn!"
        },
        {
          "reviewer_name": "Nicole Fluker",
          "review_text": "They were so great. I love their  services . Very professional and respectful. On time. Thank for getting my septic tank done."
        },
        {
          "reviewer_name": "Tiffany Hoffman",
          "review_text": "This company is fantastic. Great service. Great price. Very professional.  Explained and showed me everything that he did.  Showed me that the septic tank was completely empty when he was finished.  Explained me future problems that can arise and how to fix them. Marked out my whole septic tank for me.  He moved a bunch of stuff out of the way that should have already been moved I just didnt think about it because it was raining and said he didnt want me to get wet. Definitely recommend this company!!!!!"
        },
        {
          "reviewer_name": "Whitney Mosley",
          "review_text": "Mr. Shawn was so professional; from the initial contact to finishing the job. He made sure to inform me when he was arriving and arrived right at that time. While working he made sure to inform me of the issues he ran into and what he had to do to repair the issue. Mr. Shawn and his team went above and beyond when they were working to fix the issue with my septic system. They were the first company I ever did business with that did not leave a mess when they finished the job. Mr. Shawn noticed I was a veteran and gave me a discount without even asking. If you are looking for the perfect company to hire for your septic needs, 3rd Generation Septic is the way to go."
        },
        {
          "reviewer_name": "Dawnielle Leibfred",
          "review_text": "Shawn is so friendly and easy to work with.  I needed a septic inspection done and he got me fit in right away and went above and beyond to get the job done even with a downed tree in the way.  I can’t thank him enough.  Report sent right away and easy payment process. All around a great family owned company.  Will certainly use again if I need help in the future"
        },
        {
          "reviewer_name": "Torrie Woosley",
          "review_text": "Highly recommended very good at what they do! Best price  in town"
        },
        {
          "reviewer_name": "Mae Garrett",
          "review_text": "3rd Generation Septic came out and pumped my septic system. Shawn and another person that was with him, called the morning of the appointment, was on time, and took care of it with no problems. After they finished, they asked me to go inside and flush the commodes to be sure the problem with the sluggish flushes were gone. They were! This company is EXCELLENT! My yard was completely the same as before they came. They made sure to cover the ground up just as it was before. There were no marks left in yard, which is great! The guys even gave me advice to do every few months to help aid the break down of the waste in the septic. They were both very professional and respectful! This will be my go to company and I will recommend them at any given chance! Awesome customer service and a fair price for my job needed. Just a great experience from start to finish!  Thank you, 3rd Generation Septic!!"
        },
        {
          "reviewer_name": "Dylan Wood",
          "review_text": "This is a great septic company!  Awesome customer service and a great value! They are very good at their trade! Give them a call today, you will be glad you did."
        },
        {
          "reviewer_name": "Chris Morgan",
          "review_text": ""
        },
        {
          "reviewer_name": "Larry Sanford",
          "review_text": "Great work called in the morning an was here in 2 hours! An did a amazing job! Will use them every time! Thanks so much"
        },
        {
          "reviewer_name": "Bethany Roberts",
          "review_text": "They are super nice guys and very helpful.  Very knowledgeable and helped us out tremendously!!! Thank you so very much!!"
        },
        {
          "reviewer_name": "Elizabeth Kirk",
          "review_text": "Shawn and his helper came to pump our septic tank.  Great service.  Super friendly and informative.  He will be our go-to tank \"pumper\"."
        },
        {
          "reviewer_name": "Jessica Brewer",
          "review_text": ""
        },
        {
          "reviewer_name": "Amy Shuler",
          "review_text": "3rd Generation Septic is the one to call. They did an awesome job. Couldn't ask for better service.  Went above and beyond and offered great advice and explanation."
        },
        {
          "reviewer_name": "Jenna S",
          "review_text": ""
        },
        {
          "reviewer_name": "Clint Brand",
          "review_text": "Shawn and his guy were amazing. Replaced a septic lid and pumped my system. Great job. Pleasure to do business with. Arrived on time and took care of the issues quickly."
        },
        {
          "reviewer_name": "Shard Williams",
          "review_text": ""
        },
        {
          "reviewer_name": "Babybro1991 Simone",
          "review_text": "Great bussines 10/10 work will definitely recomend and use from now on !!!!🐾"
        },
        {
          "reviewer_name": "Beth Cody",
          "review_text": ""
        },
        {
          "reviewer_name": "Fredricka Hunter",
          "review_text": "Shawn was very helpful  it was very last minute when I reached out to him I told him my situation he made time to come out to get the job did .He was a  Very friendly  person walked me through each steps letting me know what was being did before he proceeded which I liked the communication he had I would def call him again or refer him to anyone he got the job did quick and fast the way I like things less then hour ."
        },
        {
          "reviewer_name": "Nikaa Wombacher",
          "review_text": "They came to pump out my septic tank same day I called.  They were able to  figure out the problem we were having and repair it.  This company is NOW my septic tank and plumbing people.  I will never trust anyone but them.  Very professional and fair price."
        },
        {
          "reviewer_name": "carol head",
          "review_text": "They showed up when they said they would. They got the job done pretty quick and were very professional! I would you them again and recommend them everytime!!"
        },
        {
          "reviewer_name": "Devon Berry",
          "review_text": "The owner was very courteous, fair, and kind. I would recommend them to anyone needing septic work done."
        },
        {
          "reviewer_name": "Vickie Burrows",
          "review_text": "Reliable and Professional, Cleaned and pumped septic tank very well, made suggestions on how to prevent septic problems. Very good workers."
        },
        {
          "reviewer_name": "Nicole Mitchell",
          "review_text": ""
        },
        {
          "reviewer_name": "Rita Hale",
          "review_text": ""
        }
      ]
    },
    "a-b-septic-tank-services": {
      "business name": "A & B Septic Tank Services",
      "reviews": [
        {
          "reviewer_name": "Timothy DeLoach",
          "review_text": "I had a toilet plugged up  for 28 days due to backed up septic tank during covid and they readily came out and pumped the tank and cleared the mountain of poo!"
        },
        {
          "reviewer_name": "Dianne Scott Johnson",
          "review_text": "Great service. Showed up on time. Reasonable price"
        },
        {
          "reviewer_name": "Rj B",
          "review_text": "They are really good and nice people. They are easy  to contact and respond right away with your issue. They do their job properly and professionally. They even take good care of your lawn putting it back as they were used to be. I highly recommend their service."
        },
        {
          "reviewer_name": "LaRue Caraway",
          "review_text": "Boy Howdy!  I was astonished at the service, professionalism, knowledge, timely, accurate, and most of all......  I'm a new home owner with no experience/knowledge of Septic tanks.  He took the time to educate me in every area of how the Septic tank works, preventive measurements, & long term care from external angles.  Just a great experience and will always use A&B Svcs.   I'd advise you to try him & see for yourself. Mr Caraway"
        },
        {
          "reviewer_name": "Jenny Langenback",
          "review_text": "Very pleasant man. Thankfully it was resolved"
        },
        {
          "reviewer_name": "Laura Morrison",
          "review_text": "Very friendly, helpful, and professional. Have used them twice now to pump my septic tank. Great local business!"
        },
        {
          "reviewer_name": "Marchita McDole",
          "review_text": "Very honest and dependable."
        },
        {
          "reviewer_name": "josh brooks",
          "review_text": "Honest and dependable people with great prices. Definitely people you can count on."
        },
        {
          "reviewer_name": "Lanette Jones",
          "review_text": "Pleased with the service!"
        },
        {
          "reviewer_name": "Laura Robinson",
          "review_text": "Best experience! You won't regret giving them a call! The only local plumbing service I'll be using! Thanks again! 😊"
        },
        {
          "reviewer_name": "Roger Reyes",
          "review_text": "It was a crappy job. Exactly what I needed. Give them a call."
        },
        {
          "reviewer_name": "Leah Volz",
          "review_text": "Reliable, knowlagable and quality service. This will be the only company we in the future."
        }
      ]
    },
    "a-j-s-septic-services-llc": {
      "business name": "A J's Septic Services LLC",
      "reviews": [
        {
          "reviewer_name": "Cherise Charris",
          "review_text": "This was our first interaction with this company and it was definitely the right call!!  From scheduling the appointment to finalizing payment, the whole process was quick & easy.  We only had to wait a few days for a routine appointment and Jeremy, the tech who responded to our home, was very friendly & professional.  He completed the work in a fraction of the time we expected, updated me on the status of the septic system & answered all my questions.  For their professionalism & courteous customer service, I absolutely recommend AJ’s!!"
        },
        {
          "reviewer_name": "David Deck",
          "review_text": ""
        },
        {
          "reviewer_name": "joey watters",
          "review_text": "AJ’s Septic Service is a very professional business! If we could give a higher rating than 5 stars we would. We had heard great things about their work and professionalism and after reading such high reviews we did not even get a second bid. With reviews like that we knew they had to be doing a great job at what they do. Our job was dirt work over existing field lines and laying drainage pipe from our gutters to divert water from our house. Drew was the young man sent to do our work and all I can say is WOW, what a nice person he is. He is a perfectionist at his job and strives to do his best work for you and wants you to be pleased with the work you are paying for. When we called about the job they were very prompt in getting back with us.  Customer service is a high priority in their business. Highly recommend them to anyone."
        },
        {
          "reviewer_name": "Gary Schuette",
          "review_text": "So glad we called AJ's to come help us out. Very courteous, friendly, and knowledgeable.. Thank you!"
        },
        {
          "reviewer_name": "Susan",
          "review_text": "They were quick to respond.  We set a date but they were not sure what time they would be able to get to me. I work 30 minutes away so ( I believe it was Jeremy) contacted me by phone telling me he was heading to my house and understood that I worked 30 minutes away. We discussed what needed to completed. He stated he would call me back when he was finishing up to give me time to drive home.  I was contacted as told.  When I arrived we discussed everything, all my questions were answered and I was extremely pleased with the job and the information. I would highly recommend AJ's septic to anyone especially at a time when it is very difficult to get anyone to call you back or to actually show up to do the work.  Jeremy did a wonderful job."
        },
        {
          "reviewer_name": "M Love",
          "review_text": "Super nice folks that did a great job. We're moving into a new home and they were quick with scheduling, they call back when they miss your call and they show up on time and ready to help. We had some confusion with the sellers on the exact location of the tank and they were kind enough to work with our real estate agent and came back out shortly to get everything taken care of. Highly recommended."
        },
        {
          "reviewer_name": "Alicia Carrillo",
          "review_text": "They did a great job. I am so happy with their job"
        },
        {
          "reviewer_name": "mystie mcglone",
          "review_text": "When we noticed some stinky water at the edge of our yard we called another service first who quoted us astronomical amounts to cut up our concrete and replace field lines. AJ's came & pumped our septic tank, told us our field lines were working great and that a possible leaky toilet was most likely the culprit. These guys were so nice, on time, professional, and so helpful. They were quick to offer alternative solutions to help fix the issue rather than just charging us money to fix something that didn't need it. Thank you guys so much for all the help and the smiling faces while doing such a dirty job and in this awful heat!"
        },
        {
          "reviewer_name": "Doug Page",
          "review_text": "Good folks, good work & fair price."
        },
        {
          "reviewer_name": "Lee Strahan",
          "review_text": "AJ's has always done an excellent job for us. Would definitely recommend them to anyone needing septic services."
        },
        {
          "reviewer_name": "Christopher Vest",
          "review_text": ""
        },
        {
          "reviewer_name": "Sam Claybrook",
          "review_text": "Great guys came out on Friday afternoon before a holiday so I could make it through the weekend,, then came back next week and fixed the septic tank.  Thank you"
        },
        {
          "reviewer_name": "Steved Yarbrough",
          "review_text": "I’ve known and used AJs for over 15 years never been disappointed"
        },
        {
          "reviewer_name": "J",
          "review_text": ""
        },
        {
          "reviewer_name": "Thomas Hartline",
          "review_text": ""
        },
        {
          "reviewer_name": "susiew0905",
          "review_text": "I called  AJ's late one afternoon after finding black dirt like substance in my basement toliet and shower,  thinking it was the septic tank.  Tommy and Jason came out the very next day, checked out everything and told me it wasn't the septic tank at all and referred me to a fabulous plumber that came out later that afternoon and fixed the problem.  All of this to say how wonderful these 2 guys were to me.  They could have charged me a service call but didn’t and I just wanted to let their boss know that because of their kindness and willingness to help me I will not only use your company again but am telling everyone know just how fabulous your company is!! 😊"
        },
        {
          "reviewer_name": "B Campbell",
          "review_text": "Very friendly, honest, and reliable! Used them 3 times and will not use any other services. Their employee, Jeremy, was very polite and courteous. He got the job done rather fast and answered any questions I had."
        },
        {
          "reviewer_name": "Greg Ford",
          "review_text": "Drew treated  us great.  Took care of everything  and educated us."
        },
        {
          "reviewer_name": "Ashley Bowen",
          "review_text": "They came out promptly, fixed everything that was wrong, and were very reasonably priced. Highly recommend."
        },
        {
          "reviewer_name": "Marina Tucker",
          "review_text": ""
        },
        {
          "reviewer_name": "Ross 1984",
          "review_text": ""
        },
        {
          "reviewer_name": "Shirley Briggs",
          "review_text": ""
        },
        {
          "reviewer_name": "Jimmy Duncan",
          "review_text": "Supper nice and friendly peep. They went above and beyond to help me today I would highly recommend them"
        },
        {
          "reviewer_name": "Barry Alan Cherry",
          "review_text": "Awesome Job! Was very prompt and on time for the pump service that we required here. They have been doing our work for years and always perform the job with customer satisfaction in mind."
        },
        {
          "reviewer_name": "charles edwards",
          "review_text": ""
        },
        {
          "reviewer_name": "Jennifer Bridgewater",
          "review_text": ""
        },
        {
          "reviewer_name": "Dewey Jacobs",
          "review_text": "Very responsive and professional. They have always given me great service."
        },
        {
          "reviewer_name": "Joseph Patterson",
          "review_text": ""
        },
        {
          "reviewer_name": "Mark Cassidy",
          "review_text": ""
        },
        {
          "reviewer_name": "Beth Lane",
          "review_text": "Drained/Cleaned out Septic System.  Highly Professional, honest, trustworthy.\nExcellent customer service.  Explained in simple terms what they did and what was needed.  I would use this company again - no question."
        },
        {
          "reviewer_name": "Sherry Cox",
          "review_text": ""
        },
        {
          "reviewer_name": "Deanna Reeves",
          "review_text": "Cleaned out our septic tank. They were professional,  responsive & reasonable priced. I will definitely call this company again when the need arises and recommend them to friends."
        },
        {
          "reviewer_name": "L Miller",
          "review_text": "I had an aerobic septic system installed a couple of years ago. Andrew did a great job and was very reliable. He also repaired a water line pipe for me a year later. 😊"
        },
        {
          "reviewer_name": "Michael Hines",
          "review_text": ""
        },
        {
          "reviewer_name": "Charles Nichols",
          "review_text": "Great service.  I've used them 2 or 3 times."
        },
        {
          "reviewer_name": "Tim Ross",
          "review_text": "They did a great job!"
        },
        {
          "reviewer_name": "Erin Savage Glenn",
          "review_text": "They pumped our septic tank. Fantastic customer service, the guys were very knowledgeable and friendly."
        },
        {
          "reviewer_name": "Cindy Horton",
          "review_text": "They were on time, worked fast, cleaned up the area. Great service."
        },
        {
          "reviewer_name": "Mike Morris",
          "review_text": ""
        },
        {
          "reviewer_name": "Andrew Clements",
          "review_text": ""
        },
        {
          "reviewer_name": "darrells diagnostics",
          "review_text": "A J's septic service is top notch they went over and above expectations to fix my problem  Corey did and excellent job and very professional work and Josh and A.J. are super people to work with."
        },
        {
          "reviewer_name": "Liza McRae Bishop",
          "review_text": "The technicians were very quick and efficient. They arrived when they said they would and left absolutely no mess behind. Thank you AJ's septic for coming to our rescue."
        },
        {
          "reviewer_name": "Tommie J Goggans III",
          "review_text": "I can not say enough good things about AJ's Septic Services. We have used them over the years at three different homes and the work is always done properly and professionally. They are a trustworthy, reliable, and fair family business that still believes that their word is their bond. They always treat my home as if it were their own."
        },
        {
          "reviewer_name": "George-Edward Goggans",
          "review_text": "Very professional company! They will take care of your needs in a timely and professional manner!"
        },
        {
          "reviewer_name": "Delores Watts",
          "review_text": "I’m 79 years old . And AJs septic treats me like family . Makes me feel Secure. And is willing  to help old lady’s like me out with a smile on there face . You can tell they actually love there jobs."
        },
        {
          "reviewer_name": "September Fielding",
          "review_text": "Professional, great group of people, very honest, they stay super busy all the time, and I know why. They do a fabulous job, and keep their customers informed."
        },
        {
          "reviewer_name": "Brian Hall",
          "review_text": ""
        },
        {
          "reviewer_name": "Kim Talton",
          "review_text": "Great People with a Wonderful work group!!!! There to help Fast as they can with a Great Price!!!!"
        },
        {
          "reviewer_name": "David Whyte",
          "review_text": "I have used AJ's multiple times in the past and have always been pleased. They have competent people who care about their work.  Recently, I had scheduled with them to install a small septic tank and to reset a buried propane tank.   The job was timing sensitive and I really appreciated the way Tommie Goggins communicated with me about arrival times and then for the professional way he handled the unexpected underground conflicts that were encountered.  I was well pleased. I highly recommend AJ's Septic Services."
        },
        {
          "reviewer_name": "Clay",
          "review_text": "Jeremy pumped our tank, he was very knowledgeable about systems and field lines. He filled me in on all the ins and outs\nof how to take care of our septic system for the future"
        },
        {
          "reviewer_name": "Andrew Hanson",
          "review_text": "Aj’s is awesome and Jeremy is super nice and does a fantastic job!!"
        },
        {
          "reviewer_name": "Joseph Hutchins",
          "review_text": "Great company and amazing owner! This company came forward and truly blessed my wife and I during a difficult time when they did not have to. If you want a company that puts faith and customer satisfaction first, AJ’s is the company to use. Thank you again for your blessing! God knows and we pray y’all will be blessed the same!"
        },
        {
          "reviewer_name": "Kati H",
          "review_text": ""
        },
        {
          "reviewer_name": "Amanda Phillips",
          "review_text": "Best service around friendly and so knowledgeable will recommend and use them again"
        },
        {
          "reviewer_name": "Cody Hall",
          "review_text": "Literally one of  the best family owned business in etowah county,  very fast response and absolutely the nicest people I've had the  pleasure of doing business with , will use them again and  will recommend them to all my family and friends"
        },
        {
          "reviewer_name": "Justin Wilson",
          "review_text": "Cory and tommy went the extra mile to take care of us. We’ll never use anybody else."
        },
        {
          "reviewer_name": "Terry Watkins",
          "review_text": "Called them and they came out with in an hour. Very professional and friendly. Will gladly recommend them to everyone"
        },
        {
          "reviewer_name": "K_ Parr",
          "review_text": "Very professional and came out the same day I called. I would recommend this Company to anyone needing service."
        },
        {
          "reviewer_name": "Fiona Nelson",
          "review_text": "I cannot recommend this service highly enough. They were so nice and explained everything to me and explained what I needed to get. I feel bad I didn’t ask their names but he would not take payment for pumping my tank, saying they were in the area. In my 15 years in Alabama I think this is the most helpful company I have dealt with. I am going to order the pump with 100% confidence, knowing how knowledgeable and reliable the people installing it will be!"
        },
        {
          "reviewer_name": "Arleen Myers",
          "review_text": ""
        },
        {
          "reviewer_name": "Adelia Barnwell",
          "review_text": "Showed up when they said, did what they said, didn't tell me I needed something I didn't (actually, the opposite), charged what they said, agreeable staff."
        },
        {
          "reviewer_name": "Tommie Goggans",
          "review_text": ""
        },
        {
          "reviewer_name": "Southside Pet Clinic SPC",
          "review_text": "AJ and Josh are great people and do excellent, professional work.  We use them every time an issue arises.  Call them FIRST!"
        },
        {
          "reviewer_name": "Jenn Frederick",
          "review_text": "We just moved to RBC and needed our septic checked out.  We called AJ’s on recommendation from a plumbing company.  They were profession and knowledgeable.  Would definitely recommend them and use their services again."
        }
      ]
    },
    "a-c-e-plumbing-solutions": {
      "business name": "A.C.E. Plumbing Solutions",
      "reviews": [
        {
          "reviewer_name": "Bob and Debbie Stretch Silverleaf Realty Group",
          "review_text": "They showed up on time. Communication was excellent.\nI will definitely will use you again.\nThank you Austin!"
        },
        {
          "reviewer_name": "B Wil",
          "review_text": "Service was easy to schedule, employee was early and was able to complete all task as explained. Absolutely recommended"
        },
        {
          "reviewer_name": "Robin Garriga",
          "review_text": "Arrived on time, clearly explained items needing attention, and reviewed work to be sure I was satisfied. Exceptional service."
        },
        {
          "reviewer_name": "Cana O'Brien",
          "review_text": "Austin was polite, professional and tidy. It took less than 45 mins to do the job and check for leaks. Thank you."
        },
        {
          "reviewer_name": "Wayne Jones",
          "review_text": "Perfect work, very satisfied"
        },
        {
          "reviewer_name": "Nicola Pounders",
          "review_text": "Used A.C.E for a job at one of my rentals and safe to say, we have found our new go-to guy. Arrived when he said he would (actually early), communicated effectively, did the job right the first time. Really refreshing to finally find a reliable contractor around here."
        },
        {
          "reviewer_name": "Judy Blakely",
          "review_text": "Excellent service and super responsive! I would highly recommend Austin!"
        },
        {
          "reviewer_name": "Kyle Hauser",
          "review_text": "I just used ACE plumbing today 26 Nov 2024 and he was great. He showed up earlier than anticipated, was easy to communicate with and did an awesome job fixing the mess I made. Highly recommend his services and will use again."
        },
        {
          "reviewer_name": "Shaun Arntz",
          "review_text": "Austin was very responsive, professional, and precise. He installed a garbage disposal for us."
        },
        {
          "reviewer_name": "Jennifer Kotowske",
          "review_text": "Fast and courteous service with reasonable cost! Will be using A.C.E. for all of my plumbing needs."
        },
        {
          "reviewer_name": "S Nunes",
          "review_text": "Quick and easy fix.  Austin was super nice too!"
        },
        {
          "reviewer_name": "Karen Hamilton",
          "review_text": "Great service!"
        },
        {
          "reviewer_name": "Brittni Aycock",
          "review_text": "Professional and efficient plumbing service!"
        },
        {
          "reviewer_name": "Dawn Crum",
          "review_text": "A.C.E. Plumbing Solutions is owned and operated by Austin Elliott.  Austin has helped my Family with several plumbing issues. He shows up in a very timely manner and gets the job done!   If you need a plumber Austin is your guy!"
        },
        {
          "reviewer_name": "Collins & Company",
          "review_text": "great quality service!"
        },
        {
          "reviewer_name": "Matt Hutchison",
          "review_text": ""
        },
        {
          "reviewer_name": "Wrenn Colliatie",
          "review_text": "Highly highly recommend Austin with ACE!\nHe was extremely prompt and professional updating the plumbing on my business."
        },
        {
          "reviewer_name": "Martha Alexander",
          "review_text": "Very professional.  I highly recommend A.C.E."
        },
        {
          "reviewer_name": "Lakin DeVaux",
          "review_text": "Thank you for your hard work and dedication to getting my job done so fast."
        },
        {
          "reviewer_name": "Courtney Thornton Smith",
          "review_text": "He showed up when he said he would, and worked in a timely manner. Austin communicated with us and always answered his phone. Recommend him and his services!"
        },
        {
          "reviewer_name": "Jessica Olson",
          "review_text": "Austin is amazing, very responsive to calls and easy to schedule. Did the work fast and professional\nHighly recommend!!!"
        },
        {
          "reviewer_name": "Jennifer Vo",
          "review_text": ""
        },
        {
          "reviewer_name": "Lauri Cook",
          "review_text": "Highly recommend! Prompt response, knowledgeable and efficient work. Reasonable pricing. Call for all plumbing needs. Showed up when he said he would and didn’t waste my time."
        },
        {
          "reviewer_name": "kcking565",
          "review_text": "Thank you so much for coming on such short notice! Austin was so professional and quick to complete the job! Everything was spotless after he left! I would highly recommend Austin with ACE plumbling solutions to all of my friends and family!"
        },
        {
          "reviewer_name": "Michael Dutton",
          "review_text": "Austin at ACE Plumbing is the best! He’s down-to-earth, trustworthy, and always gets the job done right. No shortcuts or half-done work—he takes pride in doing things properly. Whenever I have a plumbing issue, I know exactly who to call. If you want reliable, top-quality service, go with ACE Plumbing!"
        }
      ]
    },
    "1drain-doctor-plumbing-drain-cleaning": {
      "business name": "1Drain Doctor plumbing/drain cleaning",
      "reviews": [
        {
          "reviewer_name": "Roberta Moore",
          "review_text": ""
        },
        {
          "reviewer_name": "Tacarra Burton",
          "review_text": ""
        },
        {
          "reviewer_name": "tammy bluitt",
          "review_text": ""
        },
        {
          "reviewer_name": "Jennifer Flynn",
          "review_text": ""
        },
        {
          "reviewer_name": "Walter Leon",
          "review_text": "Excellent communication and service. The Drain Dr is a true professional.  He worked around my schedule and got my issue resolved within the same day."
        },
        {
          "reviewer_name": "Edith Tate",
          "review_text": ""
        },
        {
          "reviewer_name": "Kyle",
          "review_text": "Drain Doctor came the same day I called and unclogged my sink in 10 minutes. Fair prices and good work."
        }
      ]
    },
    "aaa-septic-tank-service-of-cullman-llc": {
      "business name": "AAA Septic Tank Service of Cullman, LLC",
      "reviews": [
        {
          "reviewer_name": "tim alldredge",
          "review_text": "They are awesome and amazing very friendly and curiously and on time I will recommend them to anyone we just had our done today"
        },
        {
          "reviewer_name": "Charlene Stephens",
          "review_text": "Jay and Cody came very quick and got my job done. Very nice respectful boys. Would highly recommend them"
        },
        {
          "reviewer_name": "Greg Boyles",
          "review_text": "What a great group of guys!  Very responsive and prompt!  Everyone needs to use these men!  Fair prices and great service!  Keep up the good work!!!!!!"
        },
        {
          "reviewer_name": "GARRET TAYLOR",
          "review_text": ""
        },
        {
          "reviewer_name": "Larry Hyde II",
          "review_text": "Very good work from Jayden and Cody I will be using them again!!!!"
        },
        {
          "reviewer_name": "Amber Phillips",
          "review_text": "Great service! The guys were very informative and professional."
        },
        {
          "reviewer_name": "Jennifer Davis",
          "review_text": ""
        },
        {
          "reviewer_name": "9 Bachelors",
          "review_text": "Will absolutely use again! Very responsive, timely and polite. Explained everything including recommendations, even for services they don’t do. They pumped our septic tank after digging and cutting thru massive tree roots💪🏻"
        },
        {
          "reviewer_name": "Paul Cox",
          "review_text": "Cody and Jay arrived promptly to clean out our septic tank.  They were very professional and explained everything.  Their boss Terry definitely has two good employees in both Cody and Jay.  Thank you so much AAA.  May God continue to bless you guys.\nPaul and Linda"
        },
        {
          "reviewer_name": "Beth Allred",
          "review_text": "Jay and Cody were very professional and worked extremely hard to get our issue fixed in a timely manner and\nat the lowest expense possible, I appreciate two young men showing up to do a job right the first time! 👍  Would highly recommend AAA Septic Service to anyone needing their tank cleaned out!"
        },
        {
          "reviewer_name": "Miriam Adams",
          "review_text": "Two very polite and knowledgeable young men, Jayden and Cody, came to my home today for septic tank service. They were very quick and proficient. They answered all of my questions and made recommendations. They made sure everything was working appropriately before leaving. I would definitely recommend this company."
        },
        {
          "reviewer_name": "Kattie Schweighart",
          "review_text": "The Best. Great people. !!!!!!"
        },
        {
          "reviewer_name": "Preston Woods",
          "review_text": "Very kind and good service. Thank you so much"
        },
        {
          "reviewer_name": "Ty Goodwin",
          "review_text": "Called to schedule a residential septic tank clean out. They had guys available and I was told the guys could come within an hour to an hour and a half. They showed up up early, very polite, and professional. Did the service I asked for and cleaned up and covered up the hole to the point you almost wouldn’t know they were ever there. Great service and I will use again for the next septic clean out."
        },
        {
          "reviewer_name": "Bouliver Kaigasse",
          "review_text": "They arrived the day after I called at the time they said they would. They had to dig (with shovels) deeper than normal to get to my septic tank. They pumped it out, refilled the hole, still charged me the standard rate, and were gone in about 2 hours. Really nice guys.\n\nOh, and pay no attention to that 1 star review. ;-)"
        },
        {
          "reviewer_name": "Elisha Merrell",
          "review_text": ""
        },
        {
          "reviewer_name": "Cindy King",
          "review_text": "They came out the next business day and were very professional and got the work done fast. Highly recommend."
        },
        {
          "reviewer_name": "Sally Wilhite",
          "review_text": "I'm so glad  I called  these guys.  They did  a great job, even found a problem with roots we didn't know  we had and fixed it. Very professional and sure would  recommend  them. They explained everything and offered options to prevent further problems."
        },
        {
          "reviewer_name": "Jimmy & Audrey Parker",
          "review_text": "Quick, same-day service. The men did a great job. Highly recommend."
        },
        {
          "reviewer_name": "Lindy Parsons",
          "review_text": "Great service!  They showed up exactly when they said they would and had the job done in an hour. Very nice and helpful explaining our situation and giving some helpful advice. Thanks again for taking care of us in a thorough and timely manner"
        },
        {
          "reviewer_name": "James Gormley",
          "review_text": "This company really came through for me. Had a severely backed up septic tank. They came and worked past dark they fixed my problem in an hour that took me all day to try and fix. Honest respectful guys woul definitely call them again. Thanks jay and Jacob y'all saved my bacon. Happy holidays AAA"
        },
        {
          "reviewer_name": "Emily Anne Jones",
          "review_text": "These guys have been great! They really went above and beyond to help me troubleshoot and have even taken time after to help me with some more needs. Very kind and professional. Took the time to make sure the job was fully done right (we had a mess going on). Thanks so much guys!"
        },
        {
          "reviewer_name": "Samantha Knighten",
          "review_text": "Did a great job . friendliest folks. They really helped us out getting it done so quickly."
        },
        {
          "reviewer_name": "Bobby Harris",
          "review_text": "Great company and very professional will use again if needed and recommend."
        },
        {
          "reviewer_name": "Kirk Sloan",
          "review_text": "On time, very courteous, worked quickly and was very professional."
        },
        {
          "reviewer_name": "Raymond Nichols",
          "review_text": "Pumped out a 50 yr old septic system for the quoted price. Works perfectly now. I highly recommend using them."
        },
        {
          "reviewer_name": "Bonnie",
          "review_text": "The workers were very good and answered all my questions. Good price! Would highly recommend."
        },
        {
          "reviewer_name": "Amy Black",
          "review_text": "These guys were great! Fast service and the workers they sent out were extremely nice and helpful!"
        },
        {
          "reviewer_name": "Lisa Otts",
          "review_text": "Wonderful service! Explained everything that they were doing and needing to do. Highly recommend for any septic services. Will definitely be using for any septic issues in the future.  Reasonably priced."
        },
        {
          "reviewer_name": "Christine Hardin",
          "review_text": "These guys are awesome! I highly recommend using AAA."
        },
        {
          "reviewer_name": "Jeanette Speegle",
          "review_text": "These guys were professional and great, they took care of our problem in a very timely manner. They were here when they told me they would be. I couldn't ask for better service. Highly recommend using them!"
        },
        {
          "reviewer_name": "Brandon Dotson",
          "review_text": "These guys did a fantastic job at a great price!! They even cleaned out the line coming from the house!"
        }
      ]
    },
    "a-revolution-llc": {
      "business name": "A Revolution LLC",
      "reviews": [
        {
          "reviewer_name": "Patricia S.",
          "review_text": ""
        },
        {
          "reviewer_name": "Draven Cloyne",
          "review_text": ""
        },
        {
          "reviewer_name": "Robert Pat Johnston",
          "review_text": "I have tell you  they did an incredible job painting our whole house, people who see it comment on the excellent work they did, they go over and  beyond.\n\nThey also refaced all the kitchen cabinets in which they did an incredible job. Many did not think could be  restored but they did it.\n\nThey installed all the new flooring in which they also did an amazingly job.\n\nThey were helpful in many ways in this project and would recommend James and his wife for work you need done. You will not be disappointed.\n\nPat and Mary Kay"
        },
        {
          "reviewer_name": "Heather Rukvina",
          "review_text": ""
        },
        {
          "reviewer_name": "Susan Echols",
          "review_text": "These guys do wonderful work. They basically gave me a new kitchen and dining area! They put up fresh paint on the walls, crown molding, chair rail molding, and they regrouted the floor. They also put up a new light over the dining table and a new sink for the kitchen. They also sanded all of the cabinets and gave them some new paint and new fixtures, not to mention the curtain rods and curtains that they put up in the dining area. I could not be more happy! They use such care! My kitchen and dining area are now so beautiful that I want to show it off all the time! You would definitely never be unpleased with the work from James and Kaleigh!"
        },
        {
          "reviewer_name": "Prissy Lowe",
          "review_text": ""
        },
        {
          "reviewer_name": "Jessica Turley",
          "review_text": "We were very pleased with the results of our home repairs. They were professional and courteous. We will definitely use them again."
        },
        {
          "reviewer_name": "Charlotte Ford",
          "review_text": "This company has done so many different jobs for me.  They have redone my whole kitchen, electrical, flooring,and plumbing throughout my entire house. They have also built steps for me.  Anything I have needed doing, they have completed it successfully and beautifully.  I would highly recommend them to anyone."
        }
      ]
    }
  }
}